{
    "twitter_handle": "AugurProject", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": true, 
    "policy_html": "<p>The Forecast Foundation looks forward to working with the security community to find security vulnerabilities in order to keep the Augur protocol safe. </p>\n\n<h1 id=\"sla\">SLA</h1>\n\n<p>The Forecast Foundation will make a best effort to meet the following SLAs for hackers participating in our program:</p>\n\n<ul>\n<li>Time to first response (from report submit) - 1 business days</li>\n<li>Time to triage (from report submit) - 1 business days </li>\n<li>Time to bounty (from triage) - 5 business days</li>\n</ul>\n\n<p>We’ll try to keep you informed about our progress throughout the process.</p>\n\n<h1 id=\"disclosure-policy\">Disclosure Policy</h1>\n\n<ul>\n<li>Before discussing your findings publicly, please allow us time to fix the vulnerability and ask our permission before doing so.</li>\n<li>Follow HackerOne&#39;s <a href=\"https://www.hackerone.com/disclosure-guidelines\" rel=\"nofollow noopener noreferrer\"><span>disclosure guidelines</span><i class=\"icon-external-link\"></i></a>.</li>\n</ul>\n\n<h1 id=\"program-rules\">Program Rules</h1>\n\n<ul>\n<li>Please provide detailed reports with reproducible steps. If the report is not detailed enough to reproduce the issue, the issue will not be eligible for a reward.</li>\n<li>Submit one vulnerability per report, unless you need to chain vulnerabilities to provide impact.</li>\n<li>When duplicates occur, we only award the first report that was received (provided that it can be fully reproduced).</li>\n<li>Multiple vulnerabilities caused by one underlying issue will be awarded one bounty.</li>\n<li>Social engineering (e.g. phishing, vishing, smishing) is prohibited.</li>\n<li>Make a good faith effort to avoid privacy violations, destruction of data, and interruption or degradation of our service. Only interact with accounts you own or with explicit permission of the account holder.</li>\n<li>You are ineligible for bounty rewards if the vulnerability submitted is already known by the Forecast Foundation, if it&#39;s publicly disclosed prior to the completion of the bounty process with the Forecast Foundation, or if it&#39;s found to have been exploited on the main Ethereum network.</li>\n</ul>\n\n<h1 id=\"rewards\">Rewards</h1>\n\n<p>Our rewards are based on severity per CVSS (the Common Vulnerability Scoring Standard). Please note these are general guidelines, and that reward decisions are up to the discretion of the Forecast Foundation.</p>\n\n<table>\n<thead>\n<tr>\n<th>Critical (9.0 - 10.0)</th>\n<th>High (7.0 - 8.9)</th>\n<th>Medium (4.0 - 6.9)</th>\n<th>Low (0.1 - 3.9)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>$200,000</td>\n<td>$5,000</td>\n<td>$2,500</td>\n<td>$1,000</td>\n</tr>\n</tbody>\n</table>\n\n<p>The above amounts are base awards and bonuses will be awarded at the discretion of Augur.</p>\n\n<h1 id=\"what-we-re-interested-in\">What we’re interested in</h1>\n\n<p>The most important class of bugs we’re looking for are any parts of the contract code which would either result in a loss of funds or the platform becoming broken or un-usable.</p>\n\n<h3 id=\"loss-of-funds\">Loss Of Funds</h3>\n\n<p>A loss of funds bug includes any vulnerability where a user can siphon assets from other users or the platform in an unintended way. If for example a user was able to take ETH or Rep or shares in a market <br>\n from a contract in an unintended way, or was able to cause a state change in the contracts that made them able to take more than would normally be allowed.</p>\n\n<p>Also included in this would be any bug allowing someone to lock up funds in such a way that they are irrecoverable.</p>\n\n<h3 id=\"manipulating-open-interest\">Manipulating Open Interest</h3>\n\n<p>Our contracts keep a record of the current Open Interest (OI) escrowed within the platform for trading. This value is used to determine the fee which is taken from traders and paid to reporters on a weekly basis. If someone can find a way to arbitrarily manipulate this value they could render the platform unusable by increasing fees to an absurd amount (33%) or keep them incorrectly low (0.01%). OI should only be “manipulatable” through the purchase and sale of complete sets and with the correct amount of corresponding ETH escrowed in markets)</p>\n\n<h3 id=\"forking-state\">Forking State</h3>\n\n<p>One of the key features Augur provides is the ability to fork the platform into multiple universes, each corresponding to an outcome in a market that proved too contentious for traditional dispute mechanics. When this happens the system enters a special state called “forking” and new child universes get spawned that should behave normally. Because this behavior is complicated and difficult to create and think through completely it is worth investigating specifically to see if any broken state arises or could be caused during forking.</p>\n\n<h1 id=\"platform-architecture-and-setup\">Platform Architecture and Setup</h1>\n\n<p>At a high level the components that make up our stack are:</p>\n\n<ul>\n<li>\n<a href=\"https://github.com/AugurProject/augur-core\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Core</strong></span><i class=\"icon-external-link\"></i></a>: The Ethereum contracts written in Solidity</li>\n<li>\n<a href=\"https://github.com/AugurProject/augur-node\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Node</strong></span><i class=\"icon-external-link\"></i></a>: The Augur Ethereum Node middleware service</li>\n<li>\n<a href=\"https://github.com/AugurProject/augur.js\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur JS</strong></span><i class=\"icon-external-link\"></i></a>: A JS middleware library to make interacting with our contracts simpler in client code<br>\n</li>\n<li>\n<a href=\"https://github.com/AugurProject/augur\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur UI</strong></span><i class=\"icon-external-link\"></i></a>: The Augur client code</li>\n</ul>\n\n<h5 id=\"ethereum-nodes\">Ethereum Nodes</h5>\n\n<p>Though not technically a part of our software stack a component that will always be involved is an Ethereum node.</p>\n\n<p>We provide a hosted version for the Rinkeby test net at <strong><a title=\"https://rinkeby.augur.net/ethereum-http\" href=\"https://rinkeby.augur.net/ethereum-http\" rel=\"nofollow noopener noreferrer\"><span>https://rinkeby.augur.net/ethereum-http</span><i class=\"icon-external-link\"></i></a></strong> &amp; <strong>wss://rinkeby.augur.net/ethereum-ws</strong></p>\n\n<p>We also provide docker images some of which are pre-populated with our contracts which should be used when you want to run a local Ethereum node:</p>\n\n<ul>\n<li>\n<strong><a title=\"https://hub.docker.com/r/augurproject/dev-pop-geth\" href=\"https://hub.docker.com/r/augurproject/dev-pop-geth\" rel=\"nofollow noopener noreferrer\"><span>https://hub.docker.com/r/augurproject/dev-pop-geth</span><i class=\"icon-external-link\"></i></a></strong> should be used normally. This image allows you to manipulate time on the Augur platform.</li>\n<li>\n<strong><a title=\"https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/\" href=\"https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/\" rel=\"nofollow noopener noreferrer\"><span>https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/</span><i class=\"icon-external-link\"></i></a></strong> is the same as the above image but time will progress normally on chain instead of being controlled by you.</li>\n<li>\n<strong><a title=\"https://hub.docker.com/r/augurproject/dev-node-geth\" href=\"https://hub.docker.com/r/augurproject/dev-node-geth\" rel=\"nofollow noopener noreferrer\"><span>https://hub.docker.com/r/augurproject/dev-node-geth</span><i class=\"icon-external-link\"></i></a></strong> This is just a blank Ethereum node image to be used when you want to do a deployment of the contracts yourself</li>\n</ul>\n\n<p>You can pull and run these via commands such as this:</p>\n<pre class=\"highlight plaintext\"><code>docker pull augurproject/dev-pop-geth:latest\ndocker run -it -p 8545:8545 -p 8546:8546 augurproject/dev-pop-geth:latest\n</code></pre>\n<h2 id=\"setting-up-your-testing-environment\">Setting up your testing environment</h2>\n\n<p>There are a variety of ways to set up your environment and begin interacting with the platform.</p>\n\n<p>Starting from easiest to most involved:</p>\n\n<h3 id=\"hosted-rinkeby-ui\">Hosted Rinkeby UI</h3>\n\n<p>We host a <a href=\"http://dev.augur.net\" rel=\"nofollow noopener noreferrer\"><span>beta test version of the client</span><i class=\"icon-external-link\"></i></a> which can be connected to with Metamask pointed at Rinkeby.</p>\n\n<p>It is configured to point at our hosted Ethereum Node and Augur Node for Rinkeby.</p>\n\n<h3 id=\"augur-app\">Augur App</h3>\n\n<p>Augur App is a desktop application we provide that packages Augur Node &amp; the Augur UI along with a GUI to select an Ethereum endpoint to connect to.</p>\n\n<p>Instructions for installing or building it from source can be found <a href=\"https://github.com/AugurProject/augur-app\" rel=\"nofollow noopener noreferrer\"><span>here</span><i class=\"icon-external-link\"></i></a>.</p>\n\n<p>By default it points at our hosted Rinkeby Ethereum node. It will also work with one of our Ethereum node docker images if more control is desired.</p>\n\n<h3 id=\"local-setup\">Local Setup</h3>\n\n<p><a href=\"https://github.com/AugurProject/augur/blob/master/docs/dev-local-node.md\" rel=\"nofollow noopener noreferrer\"><span>Instructions can be found here</span><i class=\"icon-external-link\"></i></a></p>\n\n<h2 id=\"architecture-and-components\">Architecture and Components</h2>\n\n<h3 id=\"augur-core\"><a href=\"https://github.com/AugurProject/augur-core\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Core</strong></span><i class=\"icon-external-link\"></i></a></h3>\n\n<p>The actual Augur contracts, automated tests, and deployment related scripting. This repo and the associated contract code are our primary concern and should be the main area of focus in finding vulnerabilities since problems here cannot be fixed trivially once in the wild.</p>\n\n<p>A very detailed and thorough explanation of the platform can be found <a href=\"https://www.augur.net/whitepaper.pdf\" rel=\"nofollow noopener noreferrer\"><span>here</span><i class=\"icon-external-link\"></i></a></p>\n\n<p>The following is a very high level summary of how the contracts work and interact:</p>\n\n<h5 id=\"delegation\">Delegation</h5>\n\n<p>Something important to note about our contracts is that many of them (any that inherit from the <code>DelegationTarget</code> contract) are actually just instances of the <code>Delegator</code> contract which point at the one registered implementation version.</p>\n\n<h5 id=\"deployment\">Deployment</h5>\n\n<p>The first contract uploaded and the contract which most defines an Augur deployment is the <code>Controller</code> contract. This contract maintains a registry of the legitimate Augur contracts and a whitelist that gives those contracts elevated privileges within the platform.</p>\n\n<p>The second contract uploaded is the <code>Augur</code> contract which is the central authority for all logs emitted and the approval target for users to authorize the platform move their ETH around in the form of our <code>Cash</code> ETH wrapper contract.</p>\n\n<p>After this all the remaining contracts are uploaded and whitelisted as appropriate.</p>\n\n<h5 id=\"universe\">Universe</h5>\n\n<p>the <code>Universe</code> represents a version of the deployed Augur platform that corresponds to a chain of truth. Initially there is one universe, but there could be child universes and children of those if forks occur. A fork occurs when a <code>Market</code> could be not be resolved easily, and so there are new <code>Universe</code>s for any outcome in that <code>Market</code>.</p>\n\n<h5 id=\"markets\">Markets</h5>\n\n<p><code>Market</code>s are created through convenience methods found on the <code>Universe</code>, and are the central component to trading. <code>Market</code>s ask a question and users may purchase and trade shares indicating a belief in that questions outcome. Funds are escrowed within the <code>Market</code> for this purpose. At the <code>Market</code>s end time the reporting process will determine how much the system will award users holding shares for a particular position.</p>\n\n<h5 id=\"trading\">Trading</h5>\n\n<p>The contracts located under <code>trading</code> all deal with the creation, sale, and transfer of shares in a particular <code>Market</code>.</p>\n\n<p>Users can place orders to purchase a position, fill specific orders, or request that the system fill whatever orders are possible then create an order for whatever remains. Fees are collected by the system to compensate reporters and market creators whenever a &quot;complete set&quot; is sold back to the system during this process. A &quot;complete set&quot; is just a set of all the shares offered by a <code>Market</code>.</p>\n\n<p>Trading never ends, even after a <code>Market</code> has finished reporting and even during a fork in the <code>Universe</code>.</p>\n\n<h5 id=\"reporting\">Reporting</h5>\n\n<p>Once a <code>Market</code> had reached it&#39;s end time it can be reported on to indicate the result of the question it asked.</p>\n\n<p>An excellent infographic describing this process can be found <a href=\"http://jonathanwillems.com/infographic-augur/\" rel=\"nofollow noopener noreferrer\"><span>here</span><i class=\"icon-external-link\"></i></a>.</p>\n\n<h3 id=\"augur-node\"><a href=\"https://github.com/AugurProject/augur-node\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Node</strong></span><i class=\"icon-external-link\"></i></a></h3>\n\n<p>As querying &amp; parsing Ethereum logs via client code can become extremely expensive time wise we built a middleware service to run on top of Ethereum which provides a more efficient querying API for Augur. On startup it will connect to a local Ethereum node and based on the network ID will sync itself with the contracts currently specified by <strong>Augur JS</strong> on the network.</p>\n\n<p>It maintains a local sqlite database of relevant Augur data, such as the orderbook, reporting &amp; disputing results, and profit / loss data based on user trades.</p>\n\n<p>Since Augur Node is primarily expected to be run as a local service the ability to crash, DDOS, or SQL inject it remotely via a getter is not a primary concern, but are all still of interest.</p>\n\n<p>An attack which creates false data or a corrupt state done entirely by legitimate ethereum logs would be a more concerning exploit.</p>\n\n<p>Both <strong>Augur JS</strong> and <strong>Augur UI</strong> depend on connecting to <strong>Augur Node</strong> via websocket to function correctly.</p>\n\n<h3 id=\"augur-js-augur-ui\">\n<a href=\"https://github.com/AugurProject/augur.js\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur JS</strong></span><i class=\"icon-external-link\"></i></a> + <a href=\"https://github.com/AugurProject/augur\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur UI</strong></span><i class=\"icon-external-link\"></i></a>\n</h3>\n\n<p>The client code is separated into a middleware component <strong>Augur JS</strong> and the actual web application <strong>Augur UI</strong>.</p>\n\n<p>The <strong>Augur JS</strong> middleware is notably where the <a href=\"https://github.com/AugurProject/augur.js/blob/master/src/contracts/addresses.json\" rel=\"nofollow noopener noreferrer\"><span>mapping from network id to contract addresses</span><i class=\"icon-external-link\"></i></a> is stored.</p>\n\n<p>The typical client exploits are up for consideration in these components, though are not especially critical since they are easy to fix and the initial expectation is that people access the UI locally.</p>\n\n<p>These components do provide some helpful utilities to aid in testing:</p>\n\n<h5 id=\"flash-scripts\">Flash Scripts</h5>\n\n<p>The <strong>Augur JS</strong> repo contains a <a href=\"https://github.com/AugurProject/augur.js/tree/master/scripts/flash\" rel=\"nofollow noopener noreferrer\"><span>collection of scripts</span><i class=\"icon-external-link\"></i></a> which can be run and inspected via the command:</p>\n<pre class=\"highlight plaintext\"><code>node scripts/flash\n</code></pre>\n<p>A few notable useful examples:</p>\n\n<ul>\n<li>Listing existing markets</li>\n<li>Moving time forward</li>\n<li>Creating/Filling Orders</li>\n<li>Reporting/Disputing Markets</li>\n<li>Causing a fork</li>\n</ul>\n\n<h5 id=\"browser-console-commands\">Browser Console commands</h5>\n\n<p>In a development environment we expose the <strong>Augur JS</strong> api and Redux state such that they can be accessed via browser console by <strong>augur</strong> and <strong>state</strong> respectively.</p>\n\n<p>This can be very useful to see what the state of your connection is as well as what the application believes current state is.</p>\n\n<h1 id=\"out-of-scope-vulnerabilities\">Out of scope vulnerabilities</h1>\n\n<p>When reporting vulnerabilities, please consider (1) attack scenario / exploitability, and (2) security impact of the bug. The following issues are considered out of scope:</p>\n\n<ul>\n<li>Clickjacking on pages with no sensitive actions.</li>\n<li>Attacks requiring MITM or physical access to a user&#39;s device.</li>\n<li>Previously known vulnerable libraries without a working Proof of Concept.</li>\n<li>Missing best practices in SSL/TLS configuration.</li>\n<li>Denial of service that is not a result of application engineering.</li>\n<li>Content spoofing and text injection issues without showing an attack vector/without being able to modify HTML/CSS.</li>\n<li>Game theory attacks which are noted already in the whitepaper (e.g parasitic markets, malicious resolution source).</li>\n</ul>\n\n<h1 id=\"known-contract-bugs\">Known Contract Bugs</h1>\n\n<p>The following vulnerabilities / bugs are already known and are not eligible for bounty:</p>\n\n<h2 id=\"incorrect-reporting-fee-calculation\">Incorrect Reporting Fee Calculation</h2>\n\n<p>The reporting fee in Augur is calculated and adjusted by comparing the OI within the platform to a target OI which is based on the price of REP. The goal of this is to dynamically adjust the fee rate downward when the price is too speculative and upward when the price does not reflect the fees being collected.</p>\n\n<p>There is an error in the current contracts however which will prevent the fee from ever rising. Namely the <code>getRepMarketCapInAttoeth</code> function does not properly convert units and will always be many orders of magnitude too high when comparing to the target market cap.</p>\n\n<p>While this is a very serious problem for the platform long term the intention is to release a v2 of the contracts within a relatively short time frame and since the price of REP is still highly speculative relative to OI this will almost certainly not become a problem.</p>\n\n<h2 id=\"orderbook-linked-list-ordering-bugs\">Orderbook Linked List Ordering Bugs</h2>\n\n<p>The structure and logic for the on chain orderbook is spread throughout multiple contracts and is somewhat complex. While generally working correctly there are few known contract logic errors which can cause the orderbook to end up in a broken state.</p>\n\n<p>The first is in the <code>OrdersFetcher</code> contract within the <code>descendOrderList</code> function. Note that if it finds an order of equal price it stops traversing. This is incorrect behavior since a new order of the same price should be considered worse than <u>all</u> orders of that price rather than just the first found. The result is incorrectly ordered orders of the same price, which while not technically correct is a minor issue.</p>\n\n<p>The second ordering bug is found in the <code>Orders</code> contract in the <code>updateWorstBidOrder</code> and <code>updateWorstAskOrder</code> functions. Both of these will only update the respective best and worst orders when they are <u>strictly</u> worse price wise. A new order of the same price however should actually become the new worse order. The result of this bug is that the linked list can become broken and orders may end up being hidden in the orderbook. Steps within the UI have already been implemented to help order creators when this occurs rarely.</p>\n\n<h1 id=\"safe-harbor\">Safe Harbor</h1>\n\n<p>Any activities conducted in a manner consistent with this policy will be considered authorized conduct and we will not initiate legal action against you. If legal action is initiated by a third party against you in connection with activities conducted under this policy, we will take steps to make it known that your actions were conducted in compliance with this policy. </p>\n\n<p>Thank you for helping keep the Augur protocol safe!</p>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "show_mean_bounty_time": true, 
    "total_bounties_paid_prefix": null, 
    "awards_miles": false, 
    "average_bounty_upper_range": 1000.0, 
    "top_bounty_lower_range": 2500.0, 
    "anc_enabled": true, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "show_average_bounty": true, 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2018-08-13T18:57:16.879Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2018-06-21T19:37:23.923Z", 
    "bug_count": 13, 
    "mean_time_to_bounty": 21600, 
    "offers_swag": false, 
    "offers_bounties": true, 
    "id": 24066, 
    "mean_time_to_resolution": 115200, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/024/066/b15d1964080b5df2c430ffc819b57590d7d47445_small.?1509325667", 
        "large": "https://profile-photos.hackerone-user-content.com/000/024/066/a511d881e50e8d91ce8f318dc5c6815dc8de444e_large.?1509325667", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/024/066/088e54ca9b773ea1cfb3187d159e4ac32eea97f5_xtralarge.?1509325667"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "show_top_bounties": true, 
    "target_signal": 0, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "http://augur.net", 
        "about": "Augur is a decentralized prediction market platform built on Ethereum.", 
        "twitter_handle": "AugurProject", 
        "name": "Augur"
    }, 
    "scopes": [], 
    "handle": "augurproject", 
    "cover_color": "", 
    "mean_time_to_first_response": 0, 
    "average_bounty_lower_range": 750.0, 
    "response_efficiency_percentage": 100, 
    "policy": "The Forecast Foundation looks forward to working with the security community to find security vulnerabilities in order to keep the Augur protocol safe. \r\n\r\n# SLA\r\nThe Forecast Foundation will make a best effort to meet the following SLAs for hackers participating in our program:\r\n\r\n* Time to first response (from report submit) - 1 business days\r\n* Time to triage (from report submit) - 1 business days \r\n* Time to bounty (from triage) - 5 business days\r\n\r\nWe’ll try to keep you informed about our progress throughout the process.\r\n\r\n# Disclosure Policy\r\n* Before discussing your findings publicly, please allow us time to fix the vulnerability and ask our permission before doing so.\r\n* Follow HackerOne's [disclosure guidelines](https://www.hackerone.com/disclosure-guidelines).\r\n\r\n\r\n# Program Rules\r\n* Please provide detailed reports with reproducible steps. If the report is not detailed enough to reproduce the issue, the issue will not be eligible for a reward.\r\n* Submit one vulnerability per report, unless you need to chain vulnerabilities to provide impact.\r\n* When duplicates occur, we only award the first report that was received (provided that it can be fully reproduced).\r\n* Multiple vulnerabilities caused by one underlying issue will be awarded one bounty.\r\n* Social engineering (e.g. phishing, vishing, smishing) is prohibited.\r\n* Make a good faith effort to avoid privacy violations, destruction of data, and interruption or degradation of our service. Only interact with accounts you own or with explicit permission of the account holder.\r\n* You are ineligible for bounty rewards if the vulnerability submitted is already known by the Forecast Foundation, if it's publicly disclosed prior to the completion of the bounty process with the Forecast Foundation, or if it's found to have been exploited on the main Ethereum network.\r\n\r\n# Rewards\r\nOur rewards are based on severity per CVSS (the Common Vulnerability Scoring Standard). Please note these are general guidelines, and that reward decisions are up to the discretion of the Forecast Foundation.\r\n\r\n| Critical (9.0 - 10.0) | High (7.0 - 8.9)  | Medium (4.0 - 6.9) | Low (0.1 - 3.9) |\r\n|----------|--------|---------|------|\r\n|  $200,000  | $5,000  |  $2,500    | $1,000 |\r\n\r\nThe above amounts are base awards and bonuses will be awarded at the discretion of Augur.\r\n\r\n# What we’re interested in\r\n\r\nThe most important class of bugs we’re looking for are any parts of the contract code which would either result in a loss of funds or the platform becoming broken or un-usable.\r\n\r\n### Loss Of Funds\r\nA loss of funds bug includes any vulnerability where a user can siphon assets from other users or the platform in an unintended way. If for example a user was able to take ETH or Rep or shares in a market \r\n from a contract in an unintended way, or was able to cause a state change in the contracts that made them able to take more than would normally be allowed.\r\n\r\nAlso included in this would be any bug allowing someone to lock up funds in such a way that they are irrecoverable.\r\n\r\n### Manipulating Open Interest\r\nOur contracts keep a record of the current Open Interest (OI) escrowed within the platform for trading. This value is used to determine the fee which is taken from traders and paid to reporters on a weekly basis. If someone can find a way to arbitrarily manipulate this value they could render the platform unusable by increasing fees to an absurd amount (33%) or keep them incorrectly low (0.01%). OI should only be “manipulatable” through the purchase and sale of complete sets and with the correct amount of corresponding ETH escrowed in markets)\r\n\r\n### Forking State\r\nOne of the key features Augur provides is the ability to fork the platform into multiple universes, each corresponding to an outcome in a market that proved too contentious for traditional dispute mechanics. When this happens the system enters a special state called “forking” and new child universes get spawned that should behave normally. Because this behavior is complicated and difficult to create and think through completely it is worth investigating specifically to see if any broken state arises or could be caused during forking.\r\n\r\n\r\n# Platform Architecture and Setup\r\n\r\nAt a high level the components that make up our stack are:\r\n\r\n* [__Augur Core__](https://github.com/AugurProject/augur-core): The Ethereum contracts written in Solidity\r\n* [__Augur Node__](https://github.com/AugurProject/augur-node): The Augur Ethereum Node middleware service\r\n* [__Augur JS__](https://github.com/AugurProject/augur.js): A JS middleware library to make interacting with our contracts simpler in client code  \r\n* [__Augur UI__](https://github.com/AugurProject/augur): The Augur client code\r\n\r\n##### Ethereum Nodes\r\nThough not technically a part of our software stack a component that will always be involved is an Ethereum node.\r\n\r\nWe provide a hosted version for the Rinkeby test net at __https://rinkeby.augur.net/ethereum-http__ & __wss://rinkeby.augur.net/ethereum-ws__\r\n\r\nWe also provide docker images some of which are pre-populated with our contracts which should be used when you want to run a local Ethereum node:\r\n\r\n* __https://hub.docker.com/r/augurproject/dev-pop-geth__ should be used normally. This image allows you to manipulate time on the Augur platform.\r\n* __https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/__ is the same as the above image but time will progress normally on chain instead of being controlled by you.\r\n* __https://hub.docker.com/r/augurproject/dev-node-geth__ This is just a blank Ethereum node image to be used when you want to do a deployment of the contracts yourself\r\n\r\nYou can pull and run these via commands such as this:\r\n\r\n```\r\ndocker pull augurproject/dev-pop-geth:latest\r\ndocker run -it -p 8545:8545 -p 8546:8546 augurproject/dev-pop-geth:latest\r\n```\r\n\r\n\r\n## Setting up your testing environment\r\n\r\nThere are a variety of ways to set up your environment and begin interacting with the platform.\r\n\r\nStarting from easiest to most involved:\r\n\r\n### Hosted Rinkeby UI\r\n\r\nWe host a [beta test version of the client](dev.augur.net) which can be connected to with Metamask pointed at Rinkeby.\r\n\r\nIt is configured to point at our hosted Ethereum Node and Augur Node for Rinkeby.\r\n\r\n### Augur App\r\n\r\nAugur App is a desktop application we provide that packages Augur Node & the Augur UI along with a GUI to select an Ethereum endpoint to connect to.\r\n\r\nInstructions for installing or building it from source can be found [here](https://github.com/AugurProject/augur-app).\r\n\r\nBy default it points at our hosted Rinkeby Ethereum node. It will also work with one of our Ethereum node docker images if more control is desired.\r\n\r\n### Local Setup\r\n[Instructions can be found here](https://github.com/AugurProject/augur/blob/master/docs/dev-local-node.md)\r\n\r\n\r\n## Architecture and Components\r\n\r\n\r\n### [__Augur Core__](https://github.com/AugurProject/augur-core)\r\n\r\nThe actual Augur contracts, automated tests, and deployment related scripting. This repo and the associated contract code are our primary concern and should be the main area of focus in finding vulnerabilities since problems here cannot be fixed trivially once in the wild.\r\n\r\nA very detailed and thorough explanation of the platform can be found [here](https://www.augur.net/whitepaper.pdf)\r\n\r\nThe following is a very high level summary of how the contracts work and interact:\r\n\r\n##### Delegation\r\n\r\nSomething important to note about our contracts is that many of them (any that inherit from the `DelegationTarget` contract) are actually just instances of the `Delegator` contract which point at the one registered implementation version.\r\n\r\n##### Deployment\r\n\r\nThe first contract uploaded and the contract which most defines an Augur deployment is the `Controller` contract. This contract maintains a registry of the legitimate Augur contracts and a whitelist that gives those contracts elevated privileges within the platform.\r\n\r\nThe second contract uploaded is the `Augur` contract which is the central authority for all logs emitted and the approval target for users to authorize the platform move their ETH around in the form of our `Cash` ETH wrapper contract.\r\n\r\nAfter this all the remaining contracts are uploaded and whitelisted as appropriate.\r\n\r\n##### Universe\r\n\r\nthe `Universe` represents a version of the deployed Augur platform that corresponds to a chain of truth. Initially there is one universe, but there could be child universes and children of those if forks occur. A fork occurs when a `Market` could be not be resolved easily, and so there are new `Universe`s for any outcome in that `Market`.\r\n\r\n##### Markets\r\n\r\n`Market`s are created through convenience methods found on the `Universe`, and are the central component to trading. `Market`s ask a question and users may purchase and trade shares indicating a belief in that questions outcome. Funds are escrowed within the `Market` for this purpose. At the `Market`s end time the reporting process will determine how much the system will award users holding shares for a particular position.\r\n\r\n##### Trading\r\n\r\nThe contracts located under `trading` all deal with the creation, sale, and transfer of shares in a particular `Market`.\r\n\r\nUsers can place orders to purchase a position, fill specific orders, or request that the system fill whatever orders are possible then create an order for whatever remains. Fees are collected by the system to compensate reporters and market creators whenever a \"complete set\" is sold back to the system during this process. A \"complete set\" is just a set of all the shares offered by a `Market`.\r\n\r\nTrading never ends, even after a `Market` has finished reporting and even during a fork in the `Universe`.\r\n\r\n##### Reporting\r\n\r\nOnce a `Market` had reached it's end time it can be reported on to indicate the result of the question it asked.\r\n\r\nAn excellent infographic describing this process can be found [here](http://jonathanwillems.com/infographic-augur/).\r\n\r\n\r\n### [__Augur Node__](https://github.com/AugurProject/augur-node)\r\n\r\nAs querying & parsing Ethereum logs via client code can become extremely expensive time wise we built a middleware service to run on top of Ethereum which provides a more efficient querying API for Augur. On startup it will connect to a local Ethereum node and based on the network ID will sync itself with the contracts currently specified by __Augur JS__ on the network.\r\n\r\nIt maintains a local sqlite database of relevant Augur data, such as the orderbook, reporting & disputing results, and profit / loss data based on user trades.\r\n\r\nSince Augur Node is primarily expected to be run as a local service the ability to crash, DDOS, or SQL inject it remotely via a getter is not a primary concern, but are all still of interest.\r\n\r\nAn attack which creates false data or a corrupt state done entirely by legitimate ethereum logs would be a more concerning exploit.\r\n\r\nBoth __Augur JS__ and __Augur UI__ depend on connecting to __Augur Node__ via websocket to function correctly.\r\n\r\n\r\n### [__Augur JS__](https://github.com/AugurProject/augur.js) + [__Augur UI__](https://github.com/AugurProject/augur)\r\n\r\nThe client code is separated into a middleware component __Augur JS__ and the actual web application __Augur UI__.\r\n\r\nThe __Augur JS__ middleware is notably where the [mapping from network id to contract addresses](https://github.com/AugurProject/augur.js/blob/master/src/contracts/addresses.json) is stored.\r\n\r\nThe typical client exploits are up for consideration in these components, though are not especially critical since they are easy to fix and the initial expectation is that people access the UI locally.\r\n\r\nThese components do provide some helpful utilities to aid in testing:\r\n\r\n##### Flash Scripts\r\n\r\nThe __Augur JS__ repo contains a [collection of scripts](https://github.com/AugurProject/augur.js/tree/master/scripts/flash) which can be run and inspected via the command:\r\n\r\n```\r\nnode scripts/flash\r\n```\r\n\r\nA few notable useful examples:\r\n\r\n* Listing existing markets\r\n* Moving time forward\r\n* Creating/Filling Orders\r\n* Reporting/Disputing Markets\r\n* Causing a fork\r\n\r\n##### Browser Console commands\r\n\r\nIn a development environment we expose the __Augur JS__ api and Redux state such that they can be accessed via browser console by __augur__ and __state__ respectively.\r\n\r\nThis can be very useful to see what the state of your connection is as well as what the application believes current state is.\r\n\r\n#Out of scope vulnerabilities\r\nWhen reporting vulnerabilities, please consider (1) attack scenario / exploitability, and (2) security impact of the bug. The following issues are considered out of scope:\r\n \r\n* Clickjacking on pages with no sensitive actions.\r\n* Attacks requiring MITM or physical access to a user's device.\r\n* Previously known vulnerable libraries without a working Proof of Concept.\r\n* Missing best practices in SSL/TLS configuration.\r\n* Denial of service that is not a result of application engineering.\r\n* Content spoofing and text injection issues without showing an attack vector/without being able to modify HTML/CSS.\r\n* Game theory attacks which are noted already in the whitepaper (e.g parasitic markets, malicious resolution source).\r\n\r\n# Known Contract Bugs\r\nThe following vulnerabilities / bugs are already known and are not eligible for bounty:\r\n\r\n## Incorrect Reporting Fee Calculation\r\nThe reporting fee in Augur is calculated and adjusted by comparing the OI within the platform to a target OI which is based on the price of REP. The goal of this is to dynamically adjust the fee rate downward when the price is too speculative and upward when the price does not reflect the fees being collected.\r\n\r\nThere is an error in the current contracts however which will prevent the fee from ever rising. Namely the `getRepMarketCapInAttoeth` function does not properly convert units and will always be many orders of magnitude too high when comparing to the target market cap.\r\n\r\nWhile this is a very serious problem for the platform long term the intention is to release a v2 of the contracts within a relatively short time frame and since the price of REP is still highly speculative relative to OI this will almost certainly not become a problem.\r\n\r\n## Orderbook Linked List Ordering Bugs\r\nThe structure and logic for the on chain orderbook is spread throughout multiple contracts and is somewhat complex. While generally working correctly there are few known contract logic errors which can cause the orderbook to end up in a broken state.\r\n\r\nThe first is in the `OrdersFetcher` contract within the `descendOrderList` function. Note that if it finds an order of equal price it stops traversing. This is incorrect behavior since a new order of the same price should be considered worse than _all_ orders of that price rather than just the first found. The result is incorrectly ordered orders of the same price, which while not technically correct is a minor issue.\r\n\r\nThe second ordering bug is found in the `Orders` contract in the `updateWorstBidOrder` and `updateWorstAskOrder` functions. Both of these will only update the respective best and worst orders when they are _strictly_ worse price wise. A new order of the same price however should actually become the new worse order. The result of this bug is that the linked list can become broken and orders may end up being hidden in the orderbook. Steps within the UI have already been implemented to help order creators when this occurs rarely.\r\n\r\n# Safe Harbor \r\nAny activities conducted in a manner consistent with this policy will be considered authorized conduct and we will not initiate legal action against you. If legal action is initiated by a third party against you in connection with activities conducted under this policy, we will take steps to make it known that your actions were conducted in compliance with this policy. \r\n\r\nThank you for helping keep the Augur protocol safe!", 
    "can_view_hacktivity": true, 
    "base_bounty": 550, 
    "has_cover_photo": false, 
    "total_bounties_paid": 23450.0, 
    "policy_markdown": "<p>The Forecast Foundation looks forward to working with the security community to find security vulnerabilities in order to keep the Augur protocol safe. </p>\n\n<h1 id=\"sla\">SLA</h1>\n\n<p>The Forecast Foundation will make a best effort to meet the following SLAs for hackers participating in our program:</p>\n\n<ul>\n<li>Time to first response (from report submit) - 1 business days</li>\n<li>Time to triage (from report submit) - 1 business days </li>\n<li>Time to bounty (from triage) - 5 business days</li>\n</ul>\n\n<p>We’ll try to keep you informed about our progress throughout the process.</p>\n\n<h1 id=\"disclosure-policy\">Disclosure Policy</h1>\n\n<ul>\n<li>Before discussing your findings publicly, please allow us time to fix the vulnerability and ask our permission before doing so.</li>\n<li>Follow HackerOne&#39;s <a href=\"https://www.hackerone.com/disclosure-guidelines\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>disclosure guidelines</span><i class=\"icon-external-link\"></i></a>.</li>\n</ul>\n\n<h1 id=\"program-rules\">Program Rules</h1>\n\n<ul>\n<li>Please provide detailed reports with reproducible steps. If the report is not detailed enough to reproduce the issue, the issue will not be eligible for a reward.</li>\n<li>Submit one vulnerability per report, unless you need to chain vulnerabilities to provide impact.</li>\n<li>When duplicates occur, we only award the first report that was received (provided that it can be fully reproduced).</li>\n<li>Multiple vulnerabilities caused by one underlying issue will be awarded one bounty.</li>\n<li>Social engineering (e.g. phishing, vishing, smishing) is prohibited.</li>\n<li>Make a good faith effort to avoid privacy violations, destruction of data, and interruption or degradation of our service. Only interact with accounts you own or with explicit permission of the account holder.</li>\n<li>You are ineligible for bounty rewards if the vulnerability submitted is already known by the Forecast Foundation, if it&#39;s publicly disclosed prior to the completion of the bounty process with the Forecast Foundation, or if it&#39;s found to have been exploited on the main Ethereum network.</li>\n</ul>\n\n<h1 id=\"rewards\">Rewards</h1>\n\n<p>Our rewards are based on severity per CVSS (the Common Vulnerability Scoring Standard). Please note these are general guidelines, and that reward decisions are up to the discretion of the Forecast Foundation.</p>\n\n<table>\n<thead>\n<tr>\n<th>Critical (9.0 - 10.0)</th>\n<th>High (7.0 - 8.9)</th>\n<th>Medium (4.0 - 6.9)</th>\n<th>Low (0.1 - 3.9)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>$200,000</td>\n<td>$5,000</td>\n<td>$2,500</td>\n<td>$1,000</td>\n</tr>\n</tbody>\n</table>\n\n<p>The above amounts are base awards and bonuses will be awarded at the discretion of Augur.</p>\n\n<h1 id=\"what-we-re-interested-in\">What we’re interested in</h1>\n\n<p>The most important class of bugs we’re looking for are any parts of the contract code which would either result in a loss of funds or the platform becoming broken or un-usable.</p>\n\n<h3 id=\"loss-of-funds\">Loss Of Funds</h3>\n\n<p>A loss of funds bug includes any vulnerability where a user can siphon assets from other users or the platform in an unintended way. If for example a user was able to take ETH or Rep or shares in a market <br>\n from a contract in an unintended way, or was able to cause a state change in the contracts that made them able to take more than would normally be allowed.</p>\n\n<p>Also included in this would be any bug allowing someone to lock up funds in such a way that they are irrecoverable.</p>\n\n<h3 id=\"manipulating-open-interest\">Manipulating Open Interest</h3>\n\n<p>Our contracts keep a record of the current Open Interest (OI) escrowed within the platform for trading. This value is used to determine the fee which is taken from traders and paid to reporters on a weekly basis. If someone can find a way to arbitrarily manipulate this value they could render the platform unusable by increasing fees to an absurd amount (33%) or keep them incorrectly low (0.01%). OI should only be “manipulatable” through the purchase and sale of complete sets and with the correct amount of corresponding ETH escrowed in markets)</p>\n\n<h3 id=\"forking-state\">Forking State</h3>\n\n<p>One of the key features Augur provides is the ability to fork the platform into multiple universes, each corresponding to an outcome in a market that proved too contentious for traditional dispute mechanics. When this happens the system enters a special state called “forking” and new child universes get spawned that should behave normally. Because this behavior is complicated and difficult to create and think through completely it is worth investigating specifically to see if any broken state arises or could be caused during forking.</p>\n\n<h1 id=\"platform-architecture-and-setup\">Platform Architecture and Setup</h1>\n\n<p>At a high level the components that make up our stack are:</p>\n\n<ul>\n<li>\n<a href=\"https://github.com/AugurProject/augur-core\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Core</strong></span><i class=\"icon-external-link\"></i></a>: The Ethereum contracts written in Solidity</li>\n<li>\n<a href=\"https://github.com/AugurProject/augur-node\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Node</strong></span><i class=\"icon-external-link\"></i></a>: The Augur Ethereum Node middleware service</li>\n<li>\n<a href=\"https://github.com/AugurProject/augur.js\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur JS</strong></span><i class=\"icon-external-link\"></i></a>: A JS middleware library to make interacting with our contracts simpler in client code<br>\n</li>\n<li>\n<a href=\"https://github.com/AugurProject/augur\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur UI</strong></span><i class=\"icon-external-link\"></i></a>: The Augur client code</li>\n</ul>\n\n<h5 id=\"ethereum-nodes\">Ethereum Nodes</h5>\n\n<p>Though not technically a part of our software stack a component that will always be involved is an Ethereum node.</p>\n\n<p>We provide a hosted version for the Rinkeby test net at <strong><a title=\"https://rinkeby.augur.net/ethereum-http\" href=\"https://rinkeby.augur.net/ethereum-http\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://rinkeby.augur.net/ethereum-http</span><i class=\"icon-external-link\"></i></a></strong> &amp; <strong>wss://rinkeby.augur.net/ethereum-ws</strong></p>\n\n<p>We also provide docker images some of which are pre-populated with our contracts which should be used when you want to run a local Ethereum node:</p>\n\n<ul>\n<li>\n<strong><a title=\"https://hub.docker.com/r/augurproject/dev-pop-geth\" href=\"https://hub.docker.com/r/augurproject/dev-pop-geth\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://hub.docker.com/r/augurproject/dev-pop-geth</span><i class=\"icon-external-link\"></i></a></strong> should be used normally. This image allows you to manipulate time on the Augur platform.</li>\n<li>\n<strong><a title=\"https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/\" href=\"https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://hub.docker.com/r/augurproject/dev-pop-normtime-geth/</span><i class=\"icon-external-link\"></i></a></strong> is the same as the above image but time will progress normally on chain instead of being controlled by you.</li>\n<li>\n<strong><a title=\"https://hub.docker.com/r/augurproject/dev-node-geth\" href=\"https://hub.docker.com/r/augurproject/dev-node-geth\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://hub.docker.com/r/augurproject/dev-node-geth</span><i class=\"icon-external-link\"></i></a></strong> This is just a blank Ethereum node image to be used when you want to do a deployment of the contracts yourself</li>\n</ul>\n\n<p>You can pull and run these via commands such as this:</p>\n<pre class=\"highlight plaintext\"><code>docker pull augurproject/dev-pop-geth:latest\ndocker run -it -p 8545:8545 -p 8546:8546 augurproject/dev-pop-geth:latest\n</code></pre>\n<h2 id=\"setting-up-your-testing-environment\">Setting up your testing environment</h2>\n\n<p>There are a variety of ways to set up your environment and begin interacting with the platform.</p>\n\n<p>Starting from easiest to most involved:</p>\n\n<h3 id=\"hosted-rinkeby-ui\">Hosted Rinkeby UI</h3>\n\n<p>We host a <a href=\"http://dev.augur.net\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>beta test version of the client</span><i class=\"icon-external-link\"></i></a> which can be connected to with Metamask pointed at Rinkeby.</p>\n\n<p>It is configured to point at our hosted Ethereum Node and Augur Node for Rinkeby.</p>\n\n<h3 id=\"augur-app\">Augur App</h3>\n\n<p>Augur App is a desktop application we provide that packages Augur Node &amp; the Augur UI along with a GUI to select an Ethereum endpoint to connect to.</p>\n\n<p>Instructions for installing or building it from source can be found <a href=\"https://github.com/AugurProject/augur-app\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>here</span><i class=\"icon-external-link\"></i></a>.</p>\n\n<p>By default it points at our hosted Rinkeby Ethereum node. It will also work with one of our Ethereum node docker images if more control is desired.</p>\n\n<h3 id=\"local-setup\">Local Setup</h3>\n\n<p><a href=\"https://github.com/AugurProject/augur/blob/master/docs/dev-local-node.md\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>Instructions can be found here</span><i class=\"icon-external-link\"></i></a></p>\n\n<h2 id=\"architecture-and-components\">Architecture and Components</h2>\n\n<h3 id=\"augur-core\"><a href=\"https://github.com/AugurProject/augur-core\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Core</strong></span><i class=\"icon-external-link\"></i></a></h3>\n\n<p>The actual Augur contracts, automated tests, and deployment related scripting. This repo and the associated contract code are our primary concern and should be the main area of focus in finding vulnerabilities since problems here cannot be fixed trivially once in the wild.</p>\n\n<p>A very detailed and thorough explanation of the platform can be found <a href=\"https://www.augur.net/whitepaper.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>here</span><i class=\"icon-external-link\"></i></a></p>\n\n<p>The following is a very high level summary of how the contracts work and interact:</p>\n\n<h5 id=\"delegation\">Delegation</h5>\n\n<p>Something important to note about our contracts is that many of them (any that inherit from the <code>DelegationTarget</code> contract) are actually just instances of the <code>Delegator</code> contract which point at the one registered implementation version.</p>\n\n<h5 id=\"deployment\">Deployment</h5>\n\n<p>The first contract uploaded and the contract which most defines an Augur deployment is the <code>Controller</code> contract. This contract maintains a registry of the legitimate Augur contracts and a whitelist that gives those contracts elevated privileges within the platform.</p>\n\n<p>The second contract uploaded is the <code>Augur</code> contract which is the central authority for all logs emitted and the approval target for users to authorize the platform move their ETH around in the form of our <code>Cash</code> ETH wrapper contract.</p>\n\n<p>After this all the remaining contracts are uploaded and whitelisted as appropriate.</p>\n\n<h5 id=\"universe\">Universe</h5>\n\n<p>the <code>Universe</code> represents a version of the deployed Augur platform that corresponds to a chain of truth. Initially there is one universe, but there could be child universes and children of those if forks occur. A fork occurs when a <code>Market</code> could be not be resolved easily, and so there are new <code>Universe</code>s for any outcome in that <code>Market</code>.</p>\n\n<h5 id=\"markets\">Markets</h5>\n\n<p><code>Market</code>s are created through convenience methods found on the <code>Universe</code>, and are the central component to trading. <code>Market</code>s ask a question and users may purchase and trade shares indicating a belief in that questions outcome. Funds are escrowed within the <code>Market</code> for this purpose. At the <code>Market</code>s end time the reporting process will determine how much the system will award users holding shares for a particular position.</p>\n\n<h5 id=\"trading\">Trading</h5>\n\n<p>The contracts located under <code>trading</code> all deal with the creation, sale, and transfer of shares in a particular <code>Market</code>.</p>\n\n<p>Users can place orders to purchase a position, fill specific orders, or request that the system fill whatever orders are possible then create an order for whatever remains. Fees are collected by the system to compensate reporters and market creators whenever a &quot;complete set&quot; is sold back to the system during this process. A &quot;complete set&quot; is just a set of all the shares offered by a <code>Market</code>.</p>\n\n<p>Trading never ends, even after a <code>Market</code> has finished reporting and even during a fork in the <code>Universe</code>.</p>\n\n<h5 id=\"reporting\">Reporting</h5>\n\n<p>Once a <code>Market</code> had reached it&#39;s end time it can be reported on to indicate the result of the question it asked.</p>\n\n<p>An excellent infographic describing this process can be found <a href=\"http://jonathanwillems.com/infographic-augur/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>here</span><i class=\"icon-external-link\"></i></a>.</p>\n\n<h3 id=\"augur-node\"><a href=\"https://github.com/AugurProject/augur-node\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur Node</strong></span><i class=\"icon-external-link\"></i></a></h3>\n\n<p>As querying &amp; parsing Ethereum logs via client code can become extremely expensive time wise we built a middleware service to run on top of Ethereum which provides a more efficient querying API for Augur. On startup it will connect to a local Ethereum node and based on the network ID will sync itself with the contracts currently specified by <strong>Augur JS</strong> on the network.</p>\n\n<p>It maintains a local sqlite database of relevant Augur data, such as the orderbook, reporting &amp; disputing results, and profit / loss data based on user trades.</p>\n\n<p>Since Augur Node is primarily expected to be run as a local service the ability to crash, DDOS, or SQL inject it remotely via a getter is not a primary concern, but are all still of interest.</p>\n\n<p>An attack which creates false data or a corrupt state done entirely by legitimate ethereum logs would be a more concerning exploit.</p>\n\n<p>Both <strong>Augur JS</strong> and <strong>Augur UI</strong> depend on connecting to <strong>Augur Node</strong> via websocket to function correctly.</p>\n\n<h3 id=\"augur-js-augur-ui\">\n<a href=\"https://github.com/AugurProject/augur.js\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur JS</strong></span><i class=\"icon-external-link\"></i></a> + <a href=\"https://github.com/AugurProject/augur\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span><strong>Augur UI</strong></span><i class=\"icon-external-link\"></i></a>\n</h3>\n\n<p>The client code is separated into a middleware component <strong>Augur JS</strong> and the actual web application <strong>Augur UI</strong>.</p>\n\n<p>The <strong>Augur JS</strong> middleware is notably where the <a href=\"https://github.com/AugurProject/augur.js/blob/master/src/contracts/addresses.json\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>mapping from network id to contract addresses</span><i class=\"icon-external-link\"></i></a> is stored.</p>\n\n<p>The typical client exploits are up for consideration in these components, though are not especially critical since they are easy to fix and the initial expectation is that people access the UI locally.</p>\n\n<p>These components do provide some helpful utilities to aid in testing:</p>\n\n<h5 id=\"flash-scripts\">Flash Scripts</h5>\n\n<p>The <strong>Augur JS</strong> repo contains a <a href=\"https://github.com/AugurProject/augur.js/tree/master/scripts/flash\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>collection of scripts</span><i class=\"icon-external-link\"></i></a> which can be run and inspected via the command:</p>\n<pre class=\"highlight plaintext\"><code>node scripts/flash\n</code></pre>\n<p>A few notable useful examples:</p>\n\n<ul>\n<li>Listing existing markets</li>\n<li>Moving time forward</li>\n<li>Creating/Filling Orders</li>\n<li>Reporting/Disputing Markets</li>\n<li>Causing a fork</li>\n</ul>\n\n<h5 id=\"browser-console-commands\">Browser Console commands</h5>\n\n<p>In a development environment we expose the <strong>Augur JS</strong> api and Redux state such that they can be accessed via browser console by <strong>augur</strong> and <strong>state</strong> respectively.</p>\n\n<p>This can be very useful to see what the state of your connection is as well as what the application believes current state is.</p>\n\n<h1 id=\"out-of-scope-vulnerabilities\">Out of scope vulnerabilities</h1>\n\n<p>When reporting vulnerabilities, please consider (1) attack scenario / exploitability, and (2) security impact of the bug. The following issues are considered out of scope:</p>\n\n<ul>\n<li>Clickjacking on pages with no sensitive actions.</li>\n<li>Attacks requiring MITM or physical access to a user&#39;s device.</li>\n<li>Previously known vulnerable libraries without a working Proof of Concept.</li>\n<li>Missing best practices in SSL/TLS configuration.</li>\n<li>Denial of service that is not a result of application engineering.</li>\n<li>Content spoofing and text injection issues without showing an attack vector/without being able to modify HTML/CSS.</li>\n<li>Game theory attacks which are noted already in the whitepaper (e.g parasitic markets, malicious resolution source).</li>\n</ul>\n\n<h1 id=\"known-contract-bugs\">Known Contract Bugs</h1>\n\n<p>The following vulnerabilities / bugs are already known and are not eligible for bounty:</p>\n\n<h2 id=\"incorrect-reporting-fee-calculation\">Incorrect Reporting Fee Calculation</h2>\n\n<p>The reporting fee in Augur is calculated and adjusted by comparing the OI within the platform to a target OI which is based on the price of REP. The goal of this is to dynamically adjust the fee rate downward when the price is too speculative and upward when the price does not reflect the fees being collected.</p>\n\n<p>There is an error in the current contracts however which will prevent the fee from ever rising. Namely the <code>getRepMarketCapInAttoeth</code> function does not properly convert units and will always be many orders of magnitude too high when comparing to the target market cap.</p>\n\n<p>While this is a very serious problem for the platform long term the intention is to release a v2 of the contracts within a relatively short time frame and since the price of REP is still highly speculative relative to OI this will almost certainly not become a problem.</p>\n\n<h2 id=\"orderbook-linked-list-ordering-bugs\">Orderbook Linked List Ordering Bugs</h2>\n\n<p>The structure and logic for the on chain orderbook is spread throughout multiple contracts and is somewhat complex. While generally working correctly there are few known contract logic errors which can cause the orderbook to end up in a broken state.</p>\n\n<p>The first is in the <code>OrdersFetcher</code> contract within the <code>descendOrderList</code> function. Note that if it finds an order of equal price it stops traversing. This is incorrect behavior since a new order of the same price should be considered worse than <u>all</u> orders of that price rather than just the first found. The result is incorrectly ordered orders of the same price, which while not technically correct is a minor issue.</p>\n\n<p>The second ordering bug is found in the <code>Orders</code> contract in the <code>updateWorstBidOrder</code> and <code>updateWorstAskOrder</code> functions. Both of these will only update the respective best and worst orders when they are <u>strictly</u> worse price wise. A new order of the same price however should actually become the new worse order. The result of this bug is that the linked list can become broken and orders may end up being hidden in the orderbook. Steps within the UI have already been implemented to help order creators when this occurs rarely.</p>\n\n<h1 id=\"safe-harbor\">Safe Harbor</h1>\n\n<p>Any activities conducted in a manner consistent with this policy will be considered authorized conduct and we will not initiate legal action against you. If legal action is initiated by a third party against you in connection with activities conducted under this policy, we will take steps to make it known that your actions were conducted in compliance with this policy. </p>\n\n<p>Thank you for helping keep the Augur protocol safe!</p>\n", 
    "show_mean_first_response_time": true, 
    "show_total_bounties_paid": true, 
    "can_invite_team_member": false, 
    "researcher_count": 8, 
    "number_of_updates": 0, 
    "show_mean_report_triage_time": false, 
    "top_bounty_upper_range": 5000.0, 
    "name": "Augur", 
    "submission_state": "open", 
    "url": "https://hackerone.com/augurproject", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": null, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}