{
    "twitter_handle": "", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": false, 
    "policy_html": "<h1 id=\"any-updates-aka-the-localtapiola-bug-bounty-microblog\">&quot;Any updates??&quot; - aka the LocalTapiola Bug Bounty Microblog</h1>\n\n<ul>\n<li>28 August 2018: toimitilat.lahitapiola.fi has been taken off the program due to issues in overall response times </li>\n<li>12 June 2018: Bug Bounty operations will slow down between June 18 and August 10. Triaging will be significantly slower and there are no production updates during this time. Reports are still welcomed of course!</li>\n<li>25 May 2018: Happy GDPR day! We have added a few lines about privacy in our policy.</li>\n<li>11 Mar 2018: Two new domains - <a href=\"http://www.lahitapiolarahoitus.fi\" rel=\"nofollow noopener noreferrer\"><span>www.lahitapiolarahoitus.fi</span><i class=\"icon-external-link\"></i></a> and myynti.lahitapiolarahoitus.fi have been added. As always - read the instructions before reporting, or risk the chance of n/a.</li>\n<li>2 Mar 2018 UPDATE <em>jasenet.hr-palvelut.com  is taken out of the scope until further notice. We are assessing the security level with the service provider to make sure this domain can be made eligible for our bug bounty program again. All submitted reports will be duly processed, no new reports will be accepted.</em>\n</li>\n<li>2 Mar 2018 - Another addition to our scope - jasenet.hr-palvelut.com is here. No brute scanning and no best practices reports will be processed - do read the fine print about the asset first.</li>\n<li>13 Jan 2018 - A new addition to our scope - the secure messaging service - is added. Now before you get your scanners out and start submitting results - again, do read the instructions. The most successful of you will leave your nmaps and likes behind.</li>\n<li>7 Jan 2018 - A new addition to our scope - toimitilat - is added. </li>\n<li>17 Dec 2017 - We would like to remind hackers that reporting out of scope findings is a known risk that might lead to reports being closed as N/A.</li>\n<li>21 Sep 2017 - We are public again. Welcome quality reports.</li>\n</ul>\n\n<h1 id=\"the-localtapiola-bug-bounty-program\">The LocalTapiola bug bounty program</h1>\n\n<p>We expect all reporters to be professional in their manners, have the ability to submit a quality report and have a decent understanding of how our bug bounty program works. </p>\n\n<p>In order to avoid misunderstandings and ambiguities, please read this policy AND the notes in our submission form before participating.</p>\n\n<p>We want to hear about any security vulnerabilities in our services. We offer monetary rewards for eligible security vulnerability reports that are disclosed to us in a coordinated way. These are the rules that need to be followed to ensure that your security research does not cause security risk to other users or their data, and to decrease the likelihood that your research would be flagged as a malicious intrusion attempt by our monitoring. We also want to be clear about certain aspects relating to acceptance of reports and payment of rewards in order to avoid any surprises.</p>\n\n<h1 id=\"our-bounty-policy\">Our bounty policy</h1>\n\n<p>Qualified security vulnerabilities will be rewarded based on severity and impact, to be determined by the LocalTapiola security team.</p>\n\n<p>We want to be fair in our bounties - similar reports will be awarded in a similar manner. We assess all reports based on business risk - criticality - and impact. Therefore we reserve all rights to make bounty policy changes. Changes in bounties will never be retrospective. Our bug bounty program is constantly evolving.</p>\n\n<p>We aim to &quot;bounty-on-triage&quot; - that is, make bounty decisions as soon as possible. The time to resolve issues can take a significant time and we want to be fair to the reporters regarding time spent and payouts.</p>\n\n<p>Due to complex import regulations in different parts of the world, swag is only available to our Finnish hackers.</p>\n\n<h1 id=\"about-our-customers-privacy-and-how-we-handle-the-gdpr\">About our customers privacy and how we handle the GDPR</h1>\n\n<p>Our bug bounty program is an additional strategic component in our ICT risk management process. As such, the bug bounty program also falls under the umbrella of security testing. Security testing engagements<br>\noccasionally run into live production data which may or may not contain PII (personally identifiable information). Whenever PII data is encountered during testing, we expect and require any and all persons<br>\ninvolved to handle that data with utmost care. Showing or proving the existence of a flaw does likely not require any data dumps - so even if possible, no dumping of PII data is allowed. Ever. Any exfiltrated PII<br>\ndata must immediately be deleted and any testing that might result in further PII being revealed must be halted. Do not store PII data. PII data samples, if needed in the report, should be properly obfuscated<br>\nbefore posting. This includes submitting reports that contain your own data. In the case where PII data is posted in a report we will redact that information as soon as possible. If after the redaction the report is unintelligible, it will not be processed.</p>\n\n<p>Our bounty policy allows us to add a bonus for finding flaws related to PII - when properly reported we usually do.</p>\n\n<p>Please do note that email addresses, phone numbers as well as pictures of our staff which is available on our public websites does not count as a data leak.</p>\n\n<h1 id=\"rewards\">Rewards</h1>\n\n<p>Rewards may range from $50 up to $50,000. Rewards are NOT based on vulnerability classifications nor technical gimmicky trickery. Rewards are based on business impact. That being said, certain technical vulnerabilities - like RCE against a customer system - will always carry a huge business impact. However, not all targets are equally valuable.</p>\n\n<p>In some cases, rewards may be consolidated into a single payout. For example, multiple reports of the same vulnerability across different parameters of a resource, or demonstrations of multiple attack vectors against a fundamental framework issue. If you report several issues that are duplicates in different parts of the service (e.g., the same code running on different nodes or platforms), or part of a larger issue, these may be combined into one and only one reward may be paid.</p>\n\n<p>Rewards may be reduced or declined if there is evidence of abuse or breach of the LocalTapiola Bug Bounty program rules.</p>\n\n<h2 id=\"criticality-and-impact\">Criticality and impact</h2>\n\n<p>Reward amounts will vary based upon the severity of the reported vulnerability. The bigger the potential impact on users and customer data, the bigger the reward will be. The following factors affect the reward</p>\n\n<ul>\n<li>customer scope (how many customers are potentially affected)</li>\n<li>internal users scope (how many users are potentially affected)</li>\n<li>systems extent (how many systems are potentially affected)</li>\n<li>authentication requirements (prerequisites for exploiting)</li>\n<li>difficulty of exploitability (additional requirements for exploiting)</li>\n<li>exploitability time window (limitations to exploiting)</li>\n<li>classification of data affected (privacy related)</li>\n</ul>\n\n<p><strong>ALL REWARDS, INCLUDING BUT NOT LIMITED TO THE EXAMPLES BELOW, ARE ALWAYS SUBJECT TO CRITICALITY AND IMPACT BASED ASSESSMENTS WHICH MAY REDUCE THE ACTUAL REWARD.</strong></p>\n\n<h3 id=\"minimum-5000-examples\">Minimum $5000 - examples:</h3>\n\n<ul>\n<li>Remote code execution on production systems housing sensitive data/functionality</li>\n<li>Access to ciritical customer data </li>\n<li>Gaining access to a customer client device</li>\n<li>Changing critical functionality of a system which may lead to severe system misuse</li>\n<li>Stealing identities or directly exploiting customer identities</li>\n<li>A combination of several lesser issues which in combination may lead to severe outages to systems</li>\n</ul>\n\n<h3 id=\"minimum-1500-examples\">Minimum $1500 - examples:</h3>\n\n<ul>\n<li>Remote code execution on secondary/segregated low criticality systems</li>\n<li>Accessing customer data or manipulating customer data with minor privacy impact</li>\n<li>Data leaks from internal systems</li>\n<li>Blind stored XSS with proven and relevant business impact</li>\n<li>Unathorized access to internal systems</li>\n<li>Privilege escalations with major impact</li>\n</ul>\n\n<h3 id=\"minimum-500-examples\">Minimum $500 - examples:</h3>\n\n<ul>\n<li>Subdomain takeovers</li>\n<li>User rights elevation with minor data impact</li>\n<li>Privilege escalations with minor impact</li>\n<li>Technical SQL injection with customer data affected</li>\n</ul>\n\n<h3 id=\"less-than-500-examples\">Less than $500 - examples:</h3>\n\n<ul>\n<li>Header / cookie injections</li>\n<li>XSS and Open Redirects</li>\n<li>Html injections in emails</li>\n<li>Injections enabling realistic phishing scenarios</li>\n<li>Single user dos or client-side dos</li>\n</ul>\n\n<h1 id=\"program-rules-and-further-information\">Program Rules and further information</h1>\n\n<h2 id=\"language\">Language</h2>\n\n<p>We run our program in universal english and expect all reports to be submitted in english. That is, spoken or conversational english.  We do appreciate the fact that reporters come from around the world - but if you are submitting reports to our program we require that you can have a decent discussion around the finding that has been submitted. </p>\n\n<h2 id=\"a-few-basic-groundrules\">A few basic groundrules</h2>\n\n<p>We are pleased to reward everyone who submits valid reports which help us improve the security of LocalTapiola, however, only those that meet the following eligibility requirements may receive a monetary reward:</p>\n\n<ul>\n<li>You must be the first reporter of a vulnerability.</li>\n<li>The vulnerability must be a qualifying vulnerability (as described in these rules) associated with affecting an in-scope site (see below).</li>\n<li>You may not publicly disclose the vulnerability prior to our resolution</li>\n</ul>\n\n<p>We only disclose reports publicly that are resolved. Also remember - If we cannot reproduce it, we cannot reward you. Make sure your reports are well written.  There is no need to describe the security impact of your finding - we understand security risks and we can figure that out.</p>\n\n<p>Internal pivoting, scanning, exploiting, or exfiltrating data from internal LocalTapiola systems is prohibited. Do not exploit vulnerabilities more than you need to prove your point. Do not steal data and do not use malicious or destructive payloads. Don&#39;t break the law.</p>\n\n<p>We welcome vulnerability reports about out of scope LocalTapiola services or public web pages, too - as long as there is an actual business impact involved. Speculative reports, pure scanning tool results, best practices and copy-paste bountybegging reports will brutally and ruthlessly be closed as n/a. Don&#39;t waste our time and we won&#39;t waste yours.</p>\n\n<p>Finnish bug hunters: please note that bug bounty reports shall be in English not Finnish. Thank you for your understanding.</p>\n\n<h2 id=\"regarding-duplicates\">Regarding duplicates</h2>\n\n<p>We get a lot of duplicates - especially when it comes to easy-to-find and simple issues which are mostly low-value findings. We always link back to the original report, regardless of if the original issue is publicly disclosed or not. If the original report is not disclosed, it will most likely be disclosed later, at which time you can verify it. The simple answer to the question &quot;if it is not publicly disclosed, how can I verify it&quot; is, you have to trust us. We know what we are doing.</p>\n\n<p>According to our internal ways of working, we do not add reporters of duplicates to the original reports. Of course, we reserve the right to make exceptions to prove this rule.</p>\n\n<h2 id=\"reports-that-are-most-likely-to-be-dismissed-or-not-eligible-for-bounty\">Reports that are most likely to be dismissed or not eligible for bounty</h2>\n\n<ul>\n<li>Most best-practices -based reports will be dismissed</li>\n<li>Reports that are not directly related to the web-applications on our in-scope domains will most likely be dismissed</li>\n<li>Reports with very low business value (nonexistent risk, very low impact, ...) or reports that are purely theoretical will most likely be dismissed</li>\n<li>Physical or social engineering attacks that pose a direct personal threat will NEVER be processed</li>\n<li>Reports that are plain copy-paste from automated scanners with clearly no thought behind how to exploit the findings will most likely have a low (or no) bounty awarded</li>\n<li>It is not worth reporting self-exploitation or self-xss - there will be no bounties</li>\n</ul>\n\n<p>To sum it up - we appreciate reports where vulnerabilities have a proof of (minimal) exploitation included. We appreciate reports around issues that carry significant business value to us. Again, we reserve the right to make exceptions to prove these rules. Subpar English skills (talking plainly through Google Translaite) will most likely lead to mutual dissapointment as we will most likely not find a common understanding. Explaining business impacts require good report writing skills. </p>\n\n<h2 id=\"versions-numbers-and-cve-codes\">Versions numbers and CVE-codes</h2>\n\n<p>We run a number of off the shelf products, commercial as well as open source. We do not accept reports purely based on CVE numbers and copy-pasted information from any CVE-database or scanning tools. As this usually involves scanning for version numbers, we do not accept reports with no (almost) other information than a version number. Patching and fixing for these kinds of vulnerabilities are part of our normal updating and patching cycles and we will not award any bounties for these kinds of reports. Having said this, we do NOT exclude reports that rely on known vulnerabilities nor findings which are very much business oriented and have a proven PoC against either our data or customers, regardless of how the vulnerability has been found (through a known CVE or based on finding a version number).  </p>\n\n<h2 id=\"our-policy-regarding-vulnerabilities-in-3rd-party-commonly-used-and-widespread-libraries\">Our policy regarding vulnerabilities in 3rd party commonly used and widespread libraries</h2>\n\n<p>We accept reports on vulnerabilities and flaws found in 3rd party commonly used and widespread libraries which we are using in our services and applications. However, we strongly encourage to report these findings upstream directly to the author of the affected libraries. We regard these findings as &quot;heads-up&quot; warnings and our bounty policy is strict - the bounty for a vulnerability in a common 3rd party library that we will eventually fix and/or patch is always $100 USD - awarded on triage. In the name of making the Internet a safer place and in the case where the reporter does not want to handle the upstream reporting to the authors of the library, we reserve the right to do so ourselves.</p>\n\n<h1 id=\"legal\">Legal</h1>\n\n<p>In connection with your participation in this program you agree to comply with all applicable local and national laws.</p>\n\n<p>You may not participate in this program if you are a resident or individual located within a country appearing on any U.S. or E.U. sanctions list.</p>\n\n<p>Vulnerabilities obtained by exploiting LocalTapiola users or employees are not eligible for a bounty and will result in immediate disqualification from the program.</p>\n\n<p>LocalTapiola has never given permission/authorization (either implied or explicit) to an individual or group of individuals to extract personal information or content of LocalTapiola customers and publicize this information on the open, public-facing Internet without customer consent, nor has LocalTapiola ever given permission for programs or data belonging to LocalTapiola to be modified or corrupted in order to extract and publicly disclose data belonging to LocalTapiola.</p>\n\n<p>LocalTapiola reserves the right to discontinue this reward program and change its terms at any time without prior notification. All decisions regarding reward payments are final. The rules of this reward program or any communication related thereto do not provide or imply any obligations to LocalTapiola of any kind.</p>\n\n<p>Thank you for helping keep LocalTapiola and our customers safe!</p>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "show_mean_bounty_time": true, 
    "total_bounties_paid_prefix": null, 
    "awards_miles": false, 
    "average_bounty_upper_range": 200.0, 
    "top_bounty_lower_range": 1000.0, 
    "anc_enabled": false, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "show_average_bounty": true, 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2018-08-28T08:52:40.768Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2017-11-22T14:09:54.355Z", 
    "bug_count": 212, 
    "mean_time_to_bounty": 1573200, 
    "offers_swag": true, 
    "offers_bounties": true, 
    "id": 8416, 
    "mean_time_to_resolution": null, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/008/416/23d72f4d3433458578a2ce1b4cc7574a935e2316_small.png?1457688936", 
        "large": "https://profile-photos.hackerone-user-content.com/000/008/416/b17813b9cf8a825b2c01725fbc9e3dc4fdfe2597_large.png?1457688936", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/008/416/364a041244ebbf6d8660e071edc48b334052a9bb_xtralarge.png?1457688936"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "show_top_bounties": true, 
    "target_signal": 0, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "http://www.lahitapiola.fi", 
        "about": "LocalTapiola’s products and services cover non-life, life and pension insurance, as well as investment and saving services.", 
        "twitter_handle": "", 
        "name": "LocalTapiola"
    }, 
    "scopes": [
        "www.lahitapiola.fi", 
        "verkkopalvelu.lahitapiola.fi", 
        "verkkopalvelu.tapiola.fi", 
        "yrityspalvelu.tapiola.fi", 
        "viestinta.lahitapiola.fi"
    ], 
    "handle": "localtapiola", 
    "cover_color": "#32b8df", 
    "mean_time_to_first_response": 64800, 
    "average_bounty_lower_range": 100.0, 
    "response_efficiency_percentage": 82, 
    "policy": "#\"Any updates??\" - aka the LocalTapiola Bug Bounty Microblog\r\n- 28 August 2018: toimitilat.lahitapiola.fi has been taken off the program due to issues in overall response times \r\n- 12 June 2018: Bug Bounty operations will slow down between June 18 and August 10. Triaging will be significantly slower and there are no production updates during this time. Reports are still welcomed of course!\r\n- 25 May 2018: Happy GDPR day! We have added a few lines about privacy in our policy.\r\n- 11 Mar 2018: Two new domains - www.lahitapiolarahoitus.fi and myynti.lahitapiolarahoitus.fi have been added. As always - read the instructions before reporting, or risk the chance of n/a.\r\n- 2 Mar 2018 UPDATE *jasenet.hr-palvelut.com  is taken out of the scope until further notice. We are assessing the security level with the service provider to make sure this domain can be made eligible for our bug bounty program again. All submitted reports will be duly processed, no new reports will be accepted.*\r\n- 2 Mar 2018 - Another addition to our scope - jasenet.hr-palvelut.com is here. No brute scanning and no best practices reports will be processed - do read the fine print about the asset first.\r\n- 13 Jan 2018 - A new addition to our scope - the secure messaging service - is added. Now before you get your scanners out and start submitting results - again, do read the instructions. The most successful of you will leave your nmaps and likes behind.\r\n- 7 Jan 2018 - A new addition to our scope - toimitilat - is added. \r\n- 17 Dec 2017 - We would like to remind hackers that reporting out of scope findings is a known risk that might lead to reports being closed as N/A.\r\n- 21 Sep 2017 - We are public again. Welcome quality reports.\r\n\r\n#The LocalTapiola bug bounty program\r\nWe expect all reporters to be professional in their manners, have the ability to submit a quality report and have a decent understanding of how our bug bounty program works. \r\n\r\nIn order to avoid misunderstandings and ambiguities, please read this policy AND the notes in our submission form before participating.\r\n\r\nWe want to hear about any security vulnerabilities in our services. We offer monetary rewards for eligible security vulnerability reports that are disclosed to us in a coordinated way. These are the rules that need to be followed to ensure that your security research does not cause security risk to other users or their data, and to decrease the likelihood that your research would be flagged as a malicious intrusion attempt by our monitoring. We also want to be clear about certain aspects relating to acceptance of reports and payment of rewards in order to avoid any surprises.\r\n\r\n#Our bounty policy\r\nQualified security vulnerabilities will be rewarded based on severity and impact, to be determined by the LocalTapiola security team.\r\n\r\nWe want to be fair in our bounties - similar reports will be awarded in a similar manner. We assess all reports based on business risk - criticality - and impact. Therefore we reserve all rights to make bounty policy changes. Changes in bounties will never be retrospective. Our bug bounty program is constantly evolving.\r\n\r\nWe aim to \"bounty-on-triage\" - that is, make bounty decisions as soon as possible. The time to resolve issues can take a significant time and we want to be fair to the reporters regarding time spent and payouts.\r\n\r\nDue to complex import regulations in different parts of the world, swag is only available to our Finnish hackers.\r\n\r\n#About our customers privacy and how we handle the GDPR\r\n\r\nOur bug bounty program is an additional strategic component in our ICT risk management process. As such, the bug bounty program also falls under the umbrella of security testing. Security testing engagements\r\noccasionally run into live production data which may or may not contain PII (personally identifiable information). Whenever PII data is encountered during testing, we expect and require any and all persons\r\ninvolved to handle that data with utmost care. Showing or proving the existence of a flaw does likely not require any data dumps - so even if possible, no dumping of PII data is allowed. Ever. Any exfiltrated PII\r\ndata must immediately be deleted and any testing that might result in further PII being revealed must be halted. Do not store PII data. PII data samples, if needed in the report, should be properly obfuscated\r\nbefore posting. This includes submitting reports that contain your own data. In the case where PII data is posted in a report we will redact that information as soon as possible. If after the redaction the report is unintelligible, it will not be processed.\r\n\r\nOur bounty policy allows us to add a bonus for finding flaws related to PII - when properly reported we usually do.\r\n\r\nPlease do note that email addresses, phone numbers as well as pictures of our staff which is available on our public websites does not count as a data leak.\r\n\r\n#Rewards\r\n\r\nRewards may range from $50 up to $50,000. Rewards are NOT based on vulnerability classifications nor technical gimmicky trickery. Rewards are based on business impact. That being said, certain technical vulnerabilities - like RCE against a customer system - will always carry a huge business impact. However, not all targets are equally valuable.\r\n\r\nIn some cases, rewards may be consolidated into a single payout. For example, multiple reports of the same vulnerability across different parameters of a resource, or demonstrations of multiple attack vectors against a fundamental framework issue. If you report several issues that are duplicates in different parts of the service (e.g., the same code running on different nodes or platforms), or part of a larger issue, these may be combined into one and only one reward may be paid.\r\n\r\nRewards may be reduced or declined if there is evidence of abuse or breach of the LocalTapiola Bug Bounty program rules.\r\n\r\n##Criticality and impact\r\nReward amounts will vary based upon the severity of the reported vulnerability. The bigger the potential impact on users and customer data, the bigger the reward will be. The following factors affect the reward\r\n* customer scope (how many customers are potentially affected)\r\n* internal users scope (how many users are potentially affected)\r\n* systems extent (how many systems are potentially affected)\r\n* authentication requirements (prerequisites for exploiting)\r\n* difficulty of exploitability (additional requirements for exploiting)\r\n* exploitability time window (limitations to exploiting)\r\n* classification of data affected (privacy related)\r\n\r\n**ALL REWARDS, INCLUDING BUT NOT LIMITED TO THE EXAMPLES BELOW, ARE ALWAYS SUBJECT TO CRITICALITY AND IMPACT BASED ASSESSMENTS WHICH MAY REDUCE THE ACTUAL REWARD.**\r\n\r\n###Minimum $5000 - examples:\r\n* Remote code execution on production systems housing sensitive data/functionality\r\n* Access to ciritical customer data \r\n* Gaining access to a customer client device\r\n* Changing critical functionality of a system which may lead to severe system misuse\r\n* Stealing identities or directly exploiting customer identities\r\n* A combination of several lesser issues which in combination may lead to severe outages to systems\r\n\r\n###Minimum $1500 - examples:\r\n* Remote code execution on secondary/segregated low criticality systems\r\n* Accessing customer data or manipulating customer data with minor privacy impact\r\n* Data leaks from internal systems\r\n* Blind stored XSS with proven and relevant business impact\r\n* Unathorized access to internal systems\r\n* Privilege escalations with major impact\r\n\r\n###Minimum $500 - examples:\r\n* Subdomain takeovers\r\n* User rights elevation with minor data impact\r\n* Privilege escalations with minor impact\r\n* Technical SQL injection with customer data affected\r\n\r\n###Less than $500 - examples:\r\n* Header / cookie injections\r\n* XSS and Open Redirects\r\n* Html injections in emails\r\n* Injections enabling realistic phishing scenarios\r\n* Single user dos or client-side dos\r\n\r\n#Program Rules and further information\r\n\r\n##Language\r\nWe run our program in universal english and expect all reports to be submitted in english. That is, spoken or conversational english.  We do appreciate the fact that reporters come from around the world - but if you are submitting reports to our program we require that you can have a decent discussion around the finding that has been submitted. \r\n\r\n##A few basic groundrules\r\n\r\nWe are pleased to reward everyone who submits valid reports which help us improve the security of LocalTapiola, however, only those that meet the following eligibility requirements may receive a monetary reward:\r\n* You must be the first reporter of a vulnerability.\r\n* The vulnerability must be a qualifying vulnerability (as described in these rules) associated with affecting an in-scope site (see below).\r\n* You may not publicly disclose the vulnerability prior to our resolution\r\n\r\nWe only disclose reports publicly that are resolved. Also remember - If we cannot reproduce it, we cannot reward you. Make sure your reports are well written.  There is no need to describe the security impact of your finding - we understand security risks and we can figure that out.\r\n\r\nInternal pivoting, scanning, exploiting, or exfiltrating data from internal LocalTapiola systems is prohibited. Do not exploit vulnerabilities more than you need to prove your point. Do not steal data and do not use malicious or destructive payloads. Don't break the law.\r\n\r\nWe welcome vulnerability reports about out of scope LocalTapiola services or public web pages, too - as long as there is an actual business impact involved. Speculative reports, pure scanning tool results, best practices and copy-paste bountybegging reports will brutally and ruthlessly be closed as n/a. Don't waste our time and we won't waste yours.\r\n\r\nFinnish bug hunters: please note that bug bounty reports shall be in English not Finnish. Thank you for your understanding.\r\n\r\n##Regarding duplicates\r\nWe get a lot of duplicates - especially when it comes to easy-to-find and simple issues which are mostly low-value findings. We always link back to the original report, regardless of if the original issue is publicly disclosed or not. If the original report is not disclosed, it will most likely be disclosed later, at which time you can verify it. The simple answer to the question \"if it is not publicly disclosed, how can I verify it\" is, you have to trust us. We know what we are doing.\r\n\r\nAccording to our internal ways of working, we do not add reporters of duplicates to the original reports. Of course, we reserve the right to make exceptions to prove this rule.\r\n\r\n##Reports that are most likely to be dismissed or not eligible for bounty\r\n* Most best-practices -based reports will be dismissed\r\n* Reports that are not directly related to the web-applications on our in-scope domains will most likely be dismissed\r\n* Reports with very low business value (nonexistent risk, very low impact, ...) or reports that are purely theoretical will most likely be dismissed\r\n* Physical or social engineering attacks that pose a direct personal threat will NEVER be processed\r\n* Reports that are plain copy-paste from automated scanners with clearly no thought behind how to exploit the findings will most likely have a low (or no) bounty awarded\r\n* It is not worth reporting self-exploitation or self-xss - there will be no bounties\r\n\r\nTo sum it up - we appreciate reports where vulnerabilities have a proof of (minimal) exploitation included. We appreciate reports around issues that carry significant business value to us. Again, we reserve the right to make exceptions to prove these rules. Subpar English skills (talking plainly through Google Translaite) will most likely lead to mutual dissapointment as we will most likely not find a common understanding. Explaining business impacts require good report writing skills. \r\n\r\n##Versions numbers and CVE-codes\r\nWe run a number of off the shelf products, commercial as well as open source. We do not accept reports purely based on CVE numbers and copy-pasted information from any CVE-database or scanning tools. As this usually involves scanning for version numbers, we do not accept reports with no (almost) other information than a version number. Patching and fixing for these kinds of vulnerabilities are part of our normal updating and patching cycles and we will not award any bounties for these kinds of reports. Having said this, we do NOT exclude reports that rely on known vulnerabilities nor findings which are very much business oriented and have a proven PoC against either our data or customers, regardless of how the vulnerability has been found (through a known CVE or based on finding a version number).  \r\n\r\n##Our policy regarding vulnerabilities in 3rd party commonly used and widespread libraries\r\nWe accept reports on vulnerabilities and flaws found in 3rd party commonly used and widespread libraries which we are using in our services and applications. However, we strongly encourage to report these findings upstream directly to the author of the affected libraries. We regard these findings as \"heads-up\" warnings and our bounty policy is strict - the bounty for a vulnerability in a common 3rd party library that we will eventually fix and/or patch is always $100 USD - awarded on triage. In the name of making the Internet a safer place and in the case where the reporter does not want to handle the upstream reporting to the authors of the library, we reserve the right to do so ourselves.\r\n\r\n#Legal\r\nIn connection with your participation in this program you agree to comply with all applicable local and national laws.\r\n\r\nYou may not participate in this program if you are a resident or individual located within a country appearing on any U.S. or E.U. sanctions list.\r\n\r\nVulnerabilities obtained by exploiting LocalTapiola users or employees are not eligible for a bounty and will result in immediate disqualification from the program.\r\n\r\nLocalTapiola has never given permission/authorization (either implied or explicit) to an individual or group of individuals to extract personal information or content of LocalTapiola customers and publicize this information on the open, public-facing Internet without customer consent, nor has LocalTapiola ever given permission for programs or data belonging to LocalTapiola to be modified or corrupted in order to extract and publicly disclose data belonging to LocalTapiola.\r\n\r\nLocalTapiola reserves the right to discontinue this reward program and change its terms at any time without prior notification. All decisions regarding reward payments are final. The rules of this reward program or any communication related thereto do not provide or imply any obligations to LocalTapiola of any kind.\r\n\r\nThank you for helping keep LocalTapiola and our customers safe!\r\n", 
    "can_view_hacktivity": true, 
    "base_bounty": 50, 
    "has_cover_photo": false, 
    "total_bounties_paid": 126090.0, 
    "policy_markdown": "<h1 id=\"any-updates-aka-the-localtapiola-bug-bounty-microblog\">&quot;Any updates??&quot; - aka the LocalTapiola Bug Bounty Microblog</h1>\n\n<ul>\n<li>28 August 2018: toimitilat.lahitapiola.fi has been taken off the program due to issues in overall response times </li>\n<li>12 June 2018: Bug Bounty operations will slow down between June 18 and August 10. Triaging will be significantly slower and there are no production updates during this time. Reports are still welcomed of course!</li>\n<li>25 May 2018: Happy GDPR day! We have added a few lines about privacy in our policy.</li>\n<li>11 Mar 2018: Two new domains - <a href=\"http://www.lahitapiolarahoitus.fi\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>www.lahitapiolarahoitus.fi</span><i class=\"icon-external-link\"></i></a> and myynti.lahitapiolarahoitus.fi have been added. As always - read the instructions before reporting, or risk the chance of n/a.</li>\n<li>2 Mar 2018 UPDATE <em>jasenet.hr-palvelut.com  is taken out of the scope until further notice. We are assessing the security level with the service provider to make sure this domain can be made eligible for our bug bounty program again. All submitted reports will be duly processed, no new reports will be accepted.</em>\n</li>\n<li>2 Mar 2018 - Another addition to our scope - jasenet.hr-palvelut.com is here. No brute scanning and no best practices reports will be processed - do read the fine print about the asset first.</li>\n<li>13 Jan 2018 - A new addition to our scope - the secure messaging service - is added. Now before you get your scanners out and start submitting results - again, do read the instructions. The most successful of you will leave your nmaps and likes behind.</li>\n<li>7 Jan 2018 - A new addition to our scope - toimitilat - is added. </li>\n<li>17 Dec 2017 - We would like to remind hackers that reporting out of scope findings is a known risk that might lead to reports being closed as N/A.</li>\n<li>21 Sep 2017 - We are public again. Welcome quality reports.</li>\n</ul>\n\n<h1 id=\"the-localtapiola-bug-bounty-program\">The LocalTapiola bug bounty program</h1>\n\n<p>We expect all reporters to be professional in their manners, have the ability to submit a quality report and have a decent understanding of how our bug bounty program works. </p>\n\n<p>In order to avoid misunderstandings and ambiguities, please read this policy AND the notes in our submission form before participating.</p>\n\n<p>We want to hear about any security vulnerabilities in our services. We offer monetary rewards for eligible security vulnerability reports that are disclosed to us in a coordinated way. These are the rules that need to be followed to ensure that your security research does not cause security risk to other users or their data, and to decrease the likelihood that your research would be flagged as a malicious intrusion attempt by our monitoring. We also want to be clear about certain aspects relating to acceptance of reports and payment of rewards in order to avoid any surprises.</p>\n\n<h1 id=\"our-bounty-policy\">Our bounty policy</h1>\n\n<p>Qualified security vulnerabilities will be rewarded based on severity and impact, to be determined by the LocalTapiola security team.</p>\n\n<p>We want to be fair in our bounties - similar reports will be awarded in a similar manner. We assess all reports based on business risk - criticality - and impact. Therefore we reserve all rights to make bounty policy changes. Changes in bounties will never be retrospective. Our bug bounty program is constantly evolving.</p>\n\n<p>We aim to &quot;bounty-on-triage&quot; - that is, make bounty decisions as soon as possible. The time to resolve issues can take a significant time and we want to be fair to the reporters regarding time spent and payouts.</p>\n\n<p>Due to complex import regulations in different parts of the world, swag is only available to our Finnish hackers.</p>\n\n<h1 id=\"about-our-customers-privacy-and-how-we-handle-the-gdpr\">About our customers privacy and how we handle the GDPR</h1>\n\n<p>Our bug bounty program is an additional strategic component in our ICT risk management process. As such, the bug bounty program also falls under the umbrella of security testing. Security testing engagements<br>\noccasionally run into live production data which may or may not contain PII (personally identifiable information). Whenever PII data is encountered during testing, we expect and require any and all persons<br>\ninvolved to handle that data with utmost care. Showing or proving the existence of a flaw does likely not require any data dumps - so even if possible, no dumping of PII data is allowed. Ever. Any exfiltrated PII<br>\ndata must immediately be deleted and any testing that might result in further PII being revealed must be halted. Do not store PII data. PII data samples, if needed in the report, should be properly obfuscated<br>\nbefore posting. This includes submitting reports that contain your own data. In the case where PII data is posted in a report we will redact that information as soon as possible. If after the redaction the report is unintelligible, it will not be processed.</p>\n\n<p>Our bounty policy allows us to add a bonus for finding flaws related to PII - when properly reported we usually do.</p>\n\n<p>Please do note that email addresses, phone numbers as well as pictures of our staff which is available on our public websites does not count as a data leak.</p>\n\n<h1 id=\"rewards\">Rewards</h1>\n\n<p>Rewards may range from $50 up to $50,000. Rewards are NOT based on vulnerability classifications nor technical gimmicky trickery. Rewards are based on business impact. That being said, certain technical vulnerabilities - like RCE against a customer system - will always carry a huge business impact. However, not all targets are equally valuable.</p>\n\n<p>In some cases, rewards may be consolidated into a single payout. For example, multiple reports of the same vulnerability across different parameters of a resource, or demonstrations of multiple attack vectors against a fundamental framework issue. If you report several issues that are duplicates in different parts of the service (e.g., the same code running on different nodes or platforms), or part of a larger issue, these may be combined into one and only one reward may be paid.</p>\n\n<p>Rewards may be reduced or declined if there is evidence of abuse or breach of the LocalTapiola Bug Bounty program rules.</p>\n\n<h2 id=\"criticality-and-impact\">Criticality and impact</h2>\n\n<p>Reward amounts will vary based upon the severity of the reported vulnerability. The bigger the potential impact on users and customer data, the bigger the reward will be. The following factors affect the reward</p>\n\n<ul>\n<li>customer scope (how many customers are potentially affected)</li>\n<li>internal users scope (how many users are potentially affected)</li>\n<li>systems extent (how many systems are potentially affected)</li>\n<li>authentication requirements (prerequisites for exploiting)</li>\n<li>difficulty of exploitability (additional requirements for exploiting)</li>\n<li>exploitability time window (limitations to exploiting)</li>\n<li>classification of data affected (privacy related)</li>\n</ul>\n\n<p><strong>ALL REWARDS, INCLUDING BUT NOT LIMITED TO THE EXAMPLES BELOW, ARE ALWAYS SUBJECT TO CRITICALITY AND IMPACT BASED ASSESSMENTS WHICH MAY REDUCE THE ACTUAL REWARD.</strong></p>\n\n<h3 id=\"minimum-5000-examples\">Minimum $5000 - examples:</h3>\n\n<ul>\n<li>Remote code execution on production systems housing sensitive data/functionality</li>\n<li>Access to ciritical customer data </li>\n<li>Gaining access to a customer client device</li>\n<li>Changing critical functionality of a system which may lead to severe system misuse</li>\n<li>Stealing identities or directly exploiting customer identities</li>\n<li>A combination of several lesser issues which in combination may lead to severe outages to systems</li>\n</ul>\n\n<h3 id=\"minimum-1500-examples\">Minimum $1500 - examples:</h3>\n\n<ul>\n<li>Remote code execution on secondary/segregated low criticality systems</li>\n<li>Accessing customer data or manipulating customer data with minor privacy impact</li>\n<li>Data leaks from internal systems</li>\n<li>Blind stored XSS with proven and relevant business impact</li>\n<li>Unathorized access to internal systems</li>\n<li>Privilege escalations with major impact</li>\n</ul>\n\n<h3 id=\"minimum-500-examples\">Minimum $500 - examples:</h3>\n\n<ul>\n<li>Subdomain takeovers</li>\n<li>User rights elevation with minor data impact</li>\n<li>Privilege escalations with minor impact</li>\n<li>Technical SQL injection with customer data affected</li>\n</ul>\n\n<h3 id=\"less-than-500-examples\">Less than $500 - examples:</h3>\n\n<ul>\n<li>Header / cookie injections</li>\n<li>XSS and Open Redirects</li>\n<li>Html injections in emails</li>\n<li>Injections enabling realistic phishing scenarios</li>\n<li>Single user dos or client-side dos</li>\n</ul>\n\n<h1 id=\"program-rules-and-further-information\">Program Rules and further information</h1>\n\n<h2 id=\"language\">Language</h2>\n\n<p>We run our program in universal english and expect all reports to be submitted in english. That is, spoken or conversational english.  We do appreciate the fact that reporters come from around the world - but if you are submitting reports to our program we require that you can have a decent discussion around the finding that has been submitted. </p>\n\n<h2 id=\"a-few-basic-groundrules\">A few basic groundrules</h2>\n\n<p>We are pleased to reward everyone who submits valid reports which help us improve the security of LocalTapiola, however, only those that meet the following eligibility requirements may receive a monetary reward:</p>\n\n<ul>\n<li>You must be the first reporter of a vulnerability.</li>\n<li>The vulnerability must be a qualifying vulnerability (as described in these rules) associated with affecting an in-scope site (see below).</li>\n<li>You may not publicly disclose the vulnerability prior to our resolution</li>\n</ul>\n\n<p>We only disclose reports publicly that are resolved. Also remember - If we cannot reproduce it, we cannot reward you. Make sure your reports are well written.  There is no need to describe the security impact of your finding - we understand security risks and we can figure that out.</p>\n\n<p>Internal pivoting, scanning, exploiting, or exfiltrating data from internal LocalTapiola systems is prohibited. Do not exploit vulnerabilities more than you need to prove your point. Do not steal data and do not use malicious or destructive payloads. Don&#39;t break the law.</p>\n\n<p>We welcome vulnerability reports about out of scope LocalTapiola services or public web pages, too - as long as there is an actual business impact involved. Speculative reports, pure scanning tool results, best practices and copy-paste bountybegging reports will brutally and ruthlessly be closed as n/a. Don&#39;t waste our time and we won&#39;t waste yours.</p>\n\n<p>Finnish bug hunters: please note that bug bounty reports shall be in English not Finnish. Thank you for your understanding.</p>\n\n<h2 id=\"regarding-duplicates\">Regarding duplicates</h2>\n\n<p>We get a lot of duplicates - especially when it comes to easy-to-find and simple issues which are mostly low-value findings. We always link back to the original report, regardless of if the original issue is publicly disclosed or not. If the original report is not disclosed, it will most likely be disclosed later, at which time you can verify it. The simple answer to the question &quot;if it is not publicly disclosed, how can I verify it&quot; is, you have to trust us. We know what we are doing.</p>\n\n<p>According to our internal ways of working, we do not add reporters of duplicates to the original reports. Of course, we reserve the right to make exceptions to prove this rule.</p>\n\n<h2 id=\"reports-that-are-most-likely-to-be-dismissed-or-not-eligible-for-bounty\">Reports that are most likely to be dismissed or not eligible for bounty</h2>\n\n<ul>\n<li>Most best-practices -based reports will be dismissed</li>\n<li>Reports that are not directly related to the web-applications on our in-scope domains will most likely be dismissed</li>\n<li>Reports with very low business value (nonexistent risk, very low impact, ...) or reports that are purely theoretical will most likely be dismissed</li>\n<li>Physical or social engineering attacks that pose a direct personal threat will NEVER be processed</li>\n<li>Reports that are plain copy-paste from automated scanners with clearly no thought behind how to exploit the findings will most likely have a low (or no) bounty awarded</li>\n<li>It is not worth reporting self-exploitation or self-xss - there will be no bounties</li>\n</ul>\n\n<p>To sum it up - we appreciate reports where vulnerabilities have a proof of (minimal) exploitation included. We appreciate reports around issues that carry significant business value to us. Again, we reserve the right to make exceptions to prove these rules. Subpar English skills (talking plainly through Google Translaite) will most likely lead to mutual dissapointment as we will most likely not find a common understanding. Explaining business impacts require good report writing skills. </p>\n\n<h2 id=\"versions-numbers-and-cve-codes\">Versions numbers and CVE-codes</h2>\n\n<p>We run a number of off the shelf products, commercial as well as open source. We do not accept reports purely based on CVE numbers and copy-pasted information from any CVE-database or scanning tools. As this usually involves scanning for version numbers, we do not accept reports with no (almost) other information than a version number. Patching and fixing for these kinds of vulnerabilities are part of our normal updating and patching cycles and we will not award any bounties for these kinds of reports. Having said this, we do NOT exclude reports that rely on known vulnerabilities nor findings which are very much business oriented and have a proven PoC against either our data or customers, regardless of how the vulnerability has been found (through a known CVE or based on finding a version number).  </p>\n\n<h2 id=\"our-policy-regarding-vulnerabilities-in-3rd-party-commonly-used-and-widespread-libraries\">Our policy regarding vulnerabilities in 3rd party commonly used and widespread libraries</h2>\n\n<p>We accept reports on vulnerabilities and flaws found in 3rd party commonly used and widespread libraries which we are using in our services and applications. However, we strongly encourage to report these findings upstream directly to the author of the affected libraries. We regard these findings as &quot;heads-up&quot; warnings and our bounty policy is strict - the bounty for a vulnerability in a common 3rd party library that we will eventually fix and/or patch is always $100 USD - awarded on triage. In the name of making the Internet a safer place and in the case where the reporter does not want to handle the upstream reporting to the authors of the library, we reserve the right to do so ourselves.</p>\n\n<h1 id=\"legal\">Legal</h1>\n\n<p>In connection with your participation in this program you agree to comply with all applicable local and national laws.</p>\n\n<p>You may not participate in this program if you are a resident or individual located within a country appearing on any U.S. or E.U. sanctions list.</p>\n\n<p>Vulnerabilities obtained by exploiting LocalTapiola users or employees are not eligible for a bounty and will result in immediate disqualification from the program.</p>\n\n<p>LocalTapiola has never given permission/authorization (either implied or explicit) to an individual or group of individuals to extract personal information or content of LocalTapiola customers and publicize this information on the open, public-facing Internet without customer consent, nor has LocalTapiola ever given permission for programs or data belonging to LocalTapiola to be modified or corrupted in order to extract and publicly disclose data belonging to LocalTapiola.</p>\n\n<p>LocalTapiola reserves the right to discontinue this reward program and change its terms at any time without prior notification. All decisions regarding reward payments are final. The rules of this reward program or any communication related thereto do not provide or imply any obligations to LocalTapiola of any kind.</p>\n\n<p>Thank you for helping keep LocalTapiola and our customers safe!</p>\n", 
    "show_mean_first_response_time": true, 
    "show_total_bounties_paid": true, 
    "can_invite_team_member": false, 
    "researcher_count": 198, 
    "number_of_updates": 0, 
    "show_mean_report_triage_time": false, 
    "top_bounty_upper_range": 18000.0, 
    "name": "LocalTapiola", 
    "submission_state": "open", 
    "url": "https://hackerone.com/localtapiola", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": null, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}