{
    "twitter_handle": "paypal", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": true, 
    "policy_html": "<p>Our team of dedicated security professionals works vigilantly to help keep customer information secure. We recognize the important role that security researchers and our user community play in helping to keep PayPal and our customers secure. If you discover a site or product vulnerability please notify us using the guidelines below.</p>\n\n<h1 id=\"program-terms\">Program Terms</h1>\n\n<p>Please note that your participation in the Bug Bounty Program is voluntary and subject to the terms and conditions set forth on this page (“Program Terms”). By submitting a site or product vulnerability to PayPal, Inc. (“PayPal”) you acknowledge that you have read and agreed to these Program Terms.</p>\n\n<p>These Program Terms supplement the terms of PayPal User Agreement, the PayPal Acceptable Use Policy, and any other agreement in which you have entered with PayPal (collectively “PayPal Agreements”). The terms of those PayPal Agreements will apply to your use of, and participation in, the Bug Bounty Program as if fully set forth herein. If any inconsistency exists between the terms of the PayPal Agreements and these Program Terms, these Program Terms will control, but only with regard to the Bug Bounty Program.</p>\n\n<p>To encourage responsible disclosures, PayPal commits that, if we conclude, in our sole discretion, that a disclosure respects and meets all the guidelines of these Program Terms and the PayPal Agreements, PayPal will not bring a private action against you or refer a matter for public inquiry.</p>\n\n<p>PayPal will make a best effort to adhere to the following response targets:</p>\n\n<table>\n<thead>\n<tr>\n<th>Type of Response</th>\n<th>Business days</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>First Response</td>\n<td>2 days</td>\n</tr>\n<tr>\n<td>Time to Triage</td>\n<td>2 days</td>\n</tr>\n<tr>\n<td>Time to  Bounty</td>\n<td>14 days</td>\n</tr>\n<tr>\n<td>Time to Resolution</td>\n<td>depends on severity and complexity</td>\n</tr>\n</tbody>\n</table>\n\n<h1 id=\"eligibility-requirements\">Eligibility Requirements</h1>\n\n<p>To participate in the Bug Bounty Program, you must have a verified PayPal account in good standing in order to receive bounty rewards. If you do not currently have a PayPal account, you can sign up for one <a href=\"http://paypal.com/signup\" rel=\"nofollow noopener noreferrer\"><span>here.</span><i class=\"icon-external-link\"></i></a></p>\n\n<p>To be eligible for the Bug Bounty Program, you must not:</p>\n\n<ul>\n<li>Be a resident of, or make your Submission from, a country against which the United States has issued export sanctions or other trade restrictions (e.g., Cuba, Iran, North Korea, Sudan and Syria);</li>\n<li>Be in violation of any national, state, or local law or regulation;</li>\n<li>Be employed by PayPal, Inc. or its subsidiaries;</li>\n<li>Be an immediate family member of a person employed by PayPal, Inc. or its subsidiaries or affiliates; or</li>\n<li>Be less than 14 years of age. If you are at least 14 years old, but are considered a minor in your place of residence, you must get your parent’s or legal guardian’s permission prior to participating in the program.</li>\n</ul>\n\n<p>If PayPal discovers that you meet any of the criteria above, PayPal will remove you from the Bug Bounty Program and disqualify you from receiving any Bounty Payments. </p>\n\n<h1 id=\"disclosure-guidelines\">Disclosure Guidelines</h1>\n\n<p>By providing a Submission or agreeing to the Program Terms, You agree that you may not publicly disclose your findings or the contents of your Submission to any third parties in any way without PayPal’s prior written approval.</p>\n\n<p>Failure to comply with the Program Terms will result in immediate disqualification from the Bug Bounty Program and ineligibility for receiving any Bounty Payments.</p>\n\n<h1 id=\"scope-for-web-applications\">Scope for Web Applications</h1>\n\n<h2 id=\"in-scope-vulnerabilities\">In-Scope Vulnerabilities</h2>\n\n<p>Accepted, in-scope vulnerabilities include, but are not limited to:</p>\n\n<ul>\n<li>Disclosure of sensitive or personally identifiable information</li>\n<li>Cross-Site Scripting (XSS)</li>\n<li>Cross-Site Request Forgery (CSRF) for sensitive functions in a privileged context</li>\n<li>Server-side or remote code execution (RCE)</li>\n<li>Authentication or authorization flaws, including insecure direct object references and authentication bypass</li>\n<li>Injection vulnerabilities, including SQL and XML injection</li>\n<li>Directory traversal</li>\n<li>Significant security misconfiguration with a verifiable vulnerability</li>\n</ul>\n\n<h2 id=\"out-of-scope-vulnerabilities\">Out-of-Scope Vulnerabilities</h2>\n\n<p>Certain vulnerabilities are considered out-of-scope for the Bug Bounty Program. Those out-of-scope vulnerabilities include, but are not limited to:</p>\n\n<ul>\n<li>Any physical attacks against PayPal property or data centers</li>\n<li>Scanner output or scanner-generated reports, including any automated or active exploit tool</li>\n<li>Attacks involving payment fraud, theft, or malicious merchant accounts</li>\n<li>Man-in-the-Middle attacks</li>\n<li>Vulnerabilities involving stolen credentials or physical access to a device</li>\n<li>Social engineering attacks, including those targeting internal employees</li>\n<li>Vulnerabilities for which there are existing, documented controls (e.g. <a title=\"https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/\" href=\"https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/\" rel=\"nofollow noopener noreferrer\"><span>https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/</span><i class=\"icon-external-link\"></i></a>)</li>\n<li>Open redirects with low security impact or requiring user interaction</li>\n<li>Host header injections without a specific, demonstrable impact</li>\n<li>Denial of service (DOS) attacks using automated tools</li>\n<li>Self-XSS, which includes any payload entered by the victim</li>\n<li>Any vulnerabilities requiring significant and unlikely interaction by the victim, such as disabling browser controls</li>\n<li>Login/logout CSRF</li>\n<li>Content spoofing without embedded HTML or JavaScript</li>\n<li>Infrastructure vulnerabilities, including:</li>\n<li>Issues related to SSL certificates</li>\n<li>DNS configuration issues</li>\n<li>Server configuration issues (e.g. open ports, TLS versions, etc.)</li>\n<li>Most vulnerabilities within our sandbox, lab, or staging environments, except Braintree.</li>\n<li>Vulnerabilities only affecting users of outdated or unpatched browsers and platforms</li>\n<li>Vulnerabilities that only affect one browser will be considered on a case-by-case basis, and may be closed as informative due to the reduced attack surface</li>\n<li>Information disclosure of public or non-protected information (e.g. code in a public repository, server banners, etc.)</li>\n<li>Any XSS that requires Flash. Flash is disabled by default in most modern browsers, thus greatly reducing the attack surface and associated risk.</li>\n<li>Any other submission determined to be low risk, based on unlikely or theoretical attack vectors, requiring significant user interaction, or resulting in minimal impact </li>\n</ul>\n\n<h1 id=\"scope-for-mobile-applications\">Scope for Mobile Applications</h1>\n\n<h2 id=\"in-scope-vulnerabilities\">In-Scope Vulnerabilities</h2>\n\n<p>In addition to in-scope items mentioned above, some additional vulnerability types will be considered in-scope for mobile applications. These include:</p>\n\n<ul>\n<li>Man-in-the-Middle attacks</li>\n<li>Attacks requiring physical access to a mobile device</li>\n</ul>\n\n<p>Certain vulnerabilities with a working proof of concept on some of our Android mobile app(s) may qualify for an additional bounty through the Google Play Security Rewards Program. To see which apps and vulnerabilities may qualify for a bounty, please refer to the <a href=\"https://hackerone.com/googleplay\">Google Play Security Rewards Program’s Scope and Vulnerability Criteria</a>.</p>\n\n<h2 id=\"out-of-scope-vulnerabilities\">Out-of-Scope Vulnerabilities</h2>\n\n<p>The following mobile vulnerabilities are out-of-scope and will not be accepted:</p>\n\n<ul>\n<li>Vulnerabilities requiring a rooted, jailbroken, or otherwise modified device</li>\n<li>Vulnerabilities requiring extensive user interaction</li>\n<li>Exposure of non-sensitive data on the device</li>\n<li>Vulnerabilities on third party libraries without showing specific impact to the target application (e.g. a CVE with no exploit)</li>\n</ul>\n\n<h1 id=\"bug-submission-requirements\">Bug Submission Requirements</h1>\n\n<h2 id=\"required-information\">Required information</h2>\n\n<p>For all submissions, please include:</p>\n\n<ul>\n<li>Full description of the vulnerability being reported, including the exploitability and impact</li>\n<li>Evidence and explanation of all steps required to reproduce the submission, which may include:</li>\n<li>Videos</li>\n<li>Screenshots</li>\n<li>Exploit code</li>\n<li>Traffic logs</li>\n<li>Web/API requests and responses</li>\n<li>Email address or user ID of any test accounts</li>\n<li>IP address used during testing</li>\n<li>For RCE submissions, see below</li>\n<li>Failure to include any of the above items may delay or jeopardize the Bounty Payment</li>\n</ul>\n\n<h1 id=\"remote-code-execution-rce-submission-guidelines\">Remote Code Execution (RCE) Submission Guidelines:</h1>\n\n<p>Failure to meet the below conditions and requirements could result in a forfeiture of any potential Bounty Payment.</p>\n\n<ul>\n<li>Source IP address</li>\n<li>Timestamp, including time zone</li>\n<li>Full server request and responses</li>\n<li>Filenames of any uploaded files, which must include “bugbounty” and the timestamp</li>\n<li>Callback IP and port, if applicable</li>\n<li>Any data that was accessed, either deliberately or inadvertently</li>\n<li>Allowed Actions:</li>\n<li>Directly injecting benign commands via the web application or interface (e.g. whoami, hostname, ifconfig)</li>\n<li>Uploading a file that outputs the result of a hard-coded benign command</li>\n<li>Prohibited Actions:</li>\n<li>Uploading files that allow arbitrary commands (i.e. a webshell)</li>\n<li>Modifying any files or data, including permissions</li>\n<li>Deleting any files or data</li>\n<li>Interrupting normal operations (e.g. triggering a reboot)</li>\n<li>Creating and maintaining a persistent connection to the server</li>\n<li>Intentionally viewing any files or data beyond what is needed to prove the vulnerability</li>\n<li>Failing to disclose any actions taken or applicable required information</li>\n</ul>\n\n<h1 id=\"bounty-payments\">Bounty Payments</h1>\n\n<h3 id=\"bounty-payments-will-be-processed-by-paypal-rather-than-hackerone-at-this-time-all-bounty-payments-must-be-made-to-a-verified-paypal-account-in-good-standing-if-you-do-not-have-a-verified-paypal-account-in-good-standing-at-the-time-of-payment-you-will-not-be-eligible-to-receive-a-bounty\">Bounty Payments will be processed by PayPal rather than HackerOne at this time. All Bounty Payments must be made to a verified PayPal Account in good standing. If you do not have a verified PayPal Account in good standing at the time of payment, you will not be eligible to receive a bounty</h3>\n\n<p>Exceptions will only be made in extraordinary circumstances agreed to by PayPal, in its sole discretion, via email from the Bug Bounty Program team). In order to receive payment, you&#39;ll be asked to add and verify your <a href=\"https://docs.hackerone.com/hackers/hacker-email-alias.html\">HackerOne email alias</a> to you PayPal account.</p>\n\n<p>You may be eligible to receive a monetary reward (“Bounty Payment”) if: (i) you are the first person to submit a site or product vulnerability; (ii) that vulnerability is determined to by a valid security issue by PayPal’s security team; and (iii) you have complied with all Program Terms.<br>\nBounty Payments, if any, will be determined by PayPal, in PayPal’s sole discretion. In no event shall PayPal be obligated to pay you a bounty for any Submission. All Bounty Payments shall be considered gratuitous.</p>\n\n<p>All Bounty Payments will be made in United States dollars (USD). You will be responsible for any tax implications related to Bounty Payments you receive, as determined by the laws of your jurisdiction of residence or citizenship.</p>\n\n<p>PayPal will determine all Bounty Payments based on the risk and impact of the vulnerability. The minimum bounty amount for a validated bug submission is $50 USD and the maximum bounty for a validated bug submission is $30,000 USD.</p>\n\n<p>PayPal Bug Bounty Team retains the right to determine if the bug submitted to the Bug Bounty Program is eligible. All determinations as to the amount of a bounty made by the PayPal Bug Bounty Team are final. Bounty Payment ranges are based on the classification and sensitivity of the data impacted, ease of exploit and overall risk to PayPal customers, PayPal brand and determined to be a valid security issue by PayPal’s security engineers.</p>\n\n<h1 id=\"ownership-of-submissions\">Ownership of Submissions</h1>\n\n<p>As a condition of participation in the PayPal Bug Bounty Program, you hereby grant PayPal, its subsidiaries, affiliates and customers a perpetual, irrevocable, worldwide, royalty-free, transferrable, sublicensable (through multiple tiers) and non-exclusive license to use, reproduce, adapt, modify, publish, distribute, publicly perform, create derivative work from, make, use, sell, offer for sale and import the Submission, as well as any materials submitted to PayPal in connection therewith, for any purpose. You should not send us any Submission that you do not wish to license to us.<br>\nYou hereby represent and warrant that the Submission is original to you and you own all right, title and interest in and to the Submission. Further, you hereby waive all other claims of any nature, including express contract, implied-in-fact contract, or quasi-contract, arising out of any disclosure of the Submission to PayPal. In no event shall PayPal be precluded from discussing, reviewing, developing for itself, having developed, or developing for third parties, materials which are competitive with those set forth in the Submission irrespective of their similarity to the information in the Submission, so long as PayPal complies with the terms of participation stated herein.</p>\n\n<h1 id=\"termination\">Termination</h1>\n\n<p>In the event (i) you breach any of these Program Terms or the terms and conditions of the PayPal Agreements; or (ii) PayPal determines, in its sole discretion that your continued participation in the Bug Bounty Program could adversely impact PayPal (including, but not limited to, presenting any threat to PayPal’s systems, security, finances and/or reputation) PayPal may immediately terminate your participation in the Bug Bounty Program and disqualify you from receiving any Bounty Payments. Please see our recommendations on the proper procedures for testing our applications.</p>\n\n<h1 id=\"confidentiality\">Confidentiality</h1>\n\n<p>Any information you receive or collect about PayPal or any PayPal user through the Bug Bounty Program (“Confidential Information”) must be kept confidential and only used in connection with the Bug Bounty Program. You may not use, disclose or distribute any such Confidential Information, including, but not limited to, any information regarding your Submission and information you obtain when researching the PayPal sites, without PayPal’s prior written consent.</p>\n\n<h1 id=\"indemnification\">Indemnification</h1>\n\n<p>In addition to any indemnification obligations you may have under the PayPal Agreements, you agree to defend, indemnify and hold PayPal, its subsidiaries, affiliates and the officers, directors, agents, joint ventures, employees and suppliers of PayPal, its subsidiaries, or our affiliates, harmless from any claim or demand (including attorneys’ fees) made or incurred by any third party due to or arising out of your Submissions, your breach of these Program Terms and/or your improper use of the Bug Bounty Program.</p>\n\n<h1 id=\"changes-to-program-terms\">Changes to Program Terms</h1>\n\n<p>The Bug Bounty Program, including its policies, is subject to change or cancellation by PayPal at any time, without notice. As such, PayPal may amend these Program Terms and/or its policies at any time by posting a revised version on our website. By continuing to participate in the Bug Bounty Program after PayPal posts any such changes, you accept the Program Terms, as modified.</p>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "show_mean_bounty_time": true, 
    "total_bounties_paid_prefix": null, 
    "awards_miles": false, 
    "average_bounty_upper_range": 2900.0, 
    "top_bounty_lower_range": 7500.0, 
    "anc_enabled": true, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "show_average_bounty": true, 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2018-11-28T21:35:28.014Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2018-09-26T17:05:39.371Z", 
    "bug_count": 225, 
    "mean_time_to_bounty": 482400, 
    "offers_swag": false, 
    "offers_bounties": true, 
    "id": 1915, 
    "mean_time_to_resolution": 4078800, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/001/915/288388ab4483e1dba7650c99a2dcfc68b4e2a631_small.jpg?1538081674", 
        "large": "https://profile-photos.hackerone-user-content.com/000/001/915/5c2b0ff272a66b41b82198d00a474a209352b19c_large.jpg?1538081674", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/001/915/b1eef9685d6862722650fa6e3d7ab29961396aed_xtralarge.jpg?1538081674"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "show_top_bounties": true, 
    "target_signal": null, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "http://paypal.com/", 
        "about": "Send Money, Pay Online or Set Up a Merchant Account - PayPal.", 
        "twitter_handle": "paypal", 
        "name": "PayPal"
    }, 
    "scopes": [
        "paypal.com", 
        "paypal-forward.com", 
        "zong.com", 
        "billmelater.com", 
        "card.io"
    ], 
    "handle": "paypal", 
    "cover_color": "#002f85", 
    "mean_time_to_first_response": 104400, 
    "average_bounty_lower_range": 1900.0, 
    "response_efficiency_percentage": 89, 
    "policy": "Our team of dedicated security professionals works vigilantly to help keep customer information secure. We recognize the important role that security researchers and our user community play in helping to keep PayPal and our customers secure. If you discover a site or product vulnerability please notify us using the guidelines below.\r\n\r\n# Program Terms\r\nPlease note that your participation in the Bug Bounty Program is voluntary and subject to the terms and conditions set forth on this page (“Program Terms”). By submitting a site or product vulnerability to PayPal, Inc. (“PayPal”) you acknowledge that you have read and agreed to these Program Terms.\r\n\r\nThese Program Terms supplement the terms of PayPal User Agreement, the PayPal Acceptable Use Policy, and any other agreement in which you have entered with PayPal (collectively “PayPal Agreements”). The terms of those PayPal Agreements will apply to your use of, and participation in, the Bug Bounty Program as if fully set forth herein. If any inconsistency exists between the terms of the PayPal Agreements and these Program Terms, these Program Terms will control, but only with regard to the Bug Bounty Program.\r\n\r\nTo encourage responsible disclosures, PayPal commits that, if we conclude, in our sole discretion, that a disclosure respects and meets all the guidelines of these Program Terms and the PayPal Agreements, PayPal will not bring a private action against you or refer a matter for public inquiry.\r\n\r\nPayPal will make a best effort to adhere to the following response targets:\r\n\r\n| Type of Response | Business days |\r\n|----------|--------------------|\r\n|  First Response |        2 days |\r\n| Time to Triage   |         2 days |\r\n| Time to  Bounty   |        14 days |\r\n|  Time to Resolution   | depends on severity and complexity |\r\n\r\n# Eligibility Requirements\r\nTo participate in the Bug Bounty Program, you must have a verified PayPal account in good standing in order to receive bounty rewards. If you do not currently have a PayPal account, you can sign up for one [here.](paypal.com/signup)\r\n\r\nTo be eligible for the Bug Bounty Program, you must not:\r\n* Be a resident of, or make your Submission from, a country against which the United States has issued export sanctions or other trade restrictions (e.g., Cuba, Iran, North Korea, Sudan and Syria);\r\n* Be in violation of any national, state, or local law or regulation;\r\n* Be employed by PayPal, Inc. or its subsidiaries;\r\n* Be an immediate family member of a person employed by PayPal, Inc. or its subsidiaries or affiliates; or\r\n* Be less than 14 years of age. If you are at least 14 years old, but are considered a minor in your place of residence, you must get your parent’s or legal guardian’s permission prior to participating in the program.\r\n\r\nIf PayPal discovers that you meet any of the criteria above, PayPal will remove you from the Bug Bounty Program and disqualify you from receiving any Bounty Payments. \r\n\r\n# Disclosure Guidelines\r\n\r\nBy providing a Submission or agreeing to the Program Terms, You agree that you may not publicly disclose your findings or the contents of your Submission to any third parties in any way without PayPal’s prior written approval.\r\n\r\nFailure to comply with the Program Terms will result in immediate disqualification from the Bug Bounty Program and ineligibility for receiving any Bounty Payments.\r\n\r\n# Scope for Web Applications\r\n\r\n## In-Scope Vulnerabilities\r\n\r\nAccepted, in-scope vulnerabilities include, but are not limited to:\r\n* Disclosure of sensitive or personally identifiable information\r\n* Cross-Site Scripting (XSS)\r\n* Cross-Site Request Forgery (CSRF) for sensitive functions in a privileged context\r\n* Server-side or remote code execution (RCE)\r\n* Authentication or authorization flaws, including insecure direct object references and authentication bypass\r\n* Injection vulnerabilities, including SQL and XML injection\r\n* Directory traversal\r\n* Significant security misconfiguration with a verifiable vulnerability\r\n\r\n## Out-of-Scope Vulnerabilities\r\nCertain vulnerabilities are considered out-of-scope for the Bug Bounty Program. Those out-of-scope vulnerabilities include, but are not limited to:\r\n* Any physical attacks against PayPal property or data centers\r\n* Scanner output or scanner-generated reports, including any automated or active exploit tool\r\n* Attacks involving payment fraud, theft, or malicious merchant accounts\r\n* Man-in-the-Middle attacks\r\n* Vulnerabilities involving stolen credentials or physical access to a device\r\n* Social engineering attacks, including those targeting internal employees\r\n* Vulnerabilities for which there are existing, documented controls (e.g. https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/)\r\n* Open redirects with low security impact or requiring user interaction\r\n* Host header injections without a specific, demonstrable impact\r\n* Denial of service (DOS) attacks using automated tools\r\n* Self-XSS, which includes any payload entered by the victim\r\n* Any vulnerabilities requiring significant and unlikely interaction by the victim, such as disabling browser controls\r\n* Login/logout CSRF\r\n* Content spoofing without embedded HTML or JavaScript\r\n* Infrastructure vulnerabilities, including:\r\n* Issues related to SSL certificates\r\n* DNS configuration issues\r\n* Server configuration issues (e.g. open ports, TLS versions, etc.)\r\n* Most vulnerabilities within our sandbox, lab, or staging environments, except Braintree.\r\n* Vulnerabilities only affecting users of outdated or unpatched browsers and platforms\r\n* Vulnerabilities that only affect one browser will be considered on a case-by-case basis, and may be closed as informative due to the reduced attack surface\r\n* Information disclosure of public or non-protected information (e.g. code in a public repository, server banners, etc.)\r\n* Any XSS that requires Flash. Flash is disabled by default in most modern browsers, thus greatly reducing the attack surface and associated risk.\r\n* Any other submission determined to be low risk, based on unlikely or theoretical attack vectors, requiring significant user interaction, or resulting in minimal impact \r\n\r\n# Scope for Mobile Applications\r\n\r\n## In-Scope Vulnerabilities\r\nIn addition to in-scope items mentioned above, some additional vulnerability types will be considered in-scope for mobile applications. These include:\r\n* Man-in-the-Middle attacks\r\n* Attacks requiring physical access to a mobile device\r\n\r\nCertain vulnerabilities with a working proof of concept on some of our Android mobile app(s) may qualify for an additional bounty through the Google Play Security Rewards Program. To see which apps and vulnerabilities may qualify for a bounty, please refer to the [Google Play Security Rewards Program’s Scope and Vulnerability Criteria] (https://hackerone.com/googleplay).\r\n\r\n## Out-of-Scope Vulnerabilities\r\nThe following mobile vulnerabilities are out-of-scope and will not be accepted:\r\n* Vulnerabilities requiring a rooted, jailbroken, or otherwise modified device\r\n* Vulnerabilities requiring extensive user interaction\r\n* Exposure of non-sensitive data on the device\r\n* Vulnerabilities on third party libraries without showing specific impact to the target application (e.g. a CVE with no exploit)\r\n\r\n# Bug Submission Requirements\r\n\r\n## Required information\r\nFor all submissions, please include:\r\n* Full description of the vulnerability being reported, including the exploitability and impact\r\n* Evidence and explanation of all steps required to reproduce the submission, which may include:\r\n* Videos\r\n* Screenshots\r\n* Exploit code\r\n* Traffic logs\r\n* Web/API requests and responses\r\n* Email address or user ID of any test accounts\r\n* IP address used during testing\r\n* For RCE submissions, see below\r\n* Failure to include any of the above items may delay or jeopardize the Bounty Payment\r\n\r\n# Remote Code Execution (RCE) Submission Guidelines:\r\n\r\nFailure to meet the below conditions and requirements could result in a forfeiture of any potential Bounty Payment.\r\n\r\n* Source IP address\r\n* Timestamp, including time zone\r\n* Full server request and responses\r\n* Filenames of any uploaded files, which must include “bugbounty” and the timestamp\r\n* Callback IP and port, if applicable\r\n* Any data that was accessed, either deliberately or inadvertently\r\n* Allowed Actions:\r\n* Directly injecting benign commands via the web application or interface (e.g. whoami, hostname, ifconfig)\r\n* Uploading a file that outputs the result of a hard-coded benign command\r\n* Prohibited Actions:\r\n* Uploading files that allow arbitrary commands (i.e. a webshell)\r\n* Modifying any files or data, including permissions\r\n* Deleting any files or data\r\n* Interrupting normal operations (e.g. triggering a reboot)\r\n* Creating and maintaining a persistent connection to the server\r\n* Intentionally viewing any files or data beyond what is needed to prove the vulnerability\r\n* Failing to disclose any actions taken or applicable required information\r\n\r\n# Bounty Payments\r\n\r\n### Bounty Payments will be processed by PayPal rather than HackerOne at this time. All Bounty Payments must be made to a verified PayPal Account in good standing. If you do not have a verified PayPal Account in good standing at the time of payment, you will not be eligible to receive a bounty \r\n\r\nExceptions will only be made in extraordinary circumstances agreed to by PayPal, in its sole discretion, via email from the Bug Bounty Program team). In order to receive payment, you'll be asked to add and verify your [HackerOne email alias](https://docs.hackerone.com/hackers/hacker-email-alias.html) to you PayPal account.\r\n\r\nYou may be eligible to receive a monetary reward (“Bounty Payment”) if: (i) you are the first person to submit a site or product vulnerability; (ii) that vulnerability is determined to by a valid security issue by PayPal’s security team; and (iii) you have complied with all Program Terms.\r\nBounty Payments, if any, will be determined by PayPal, in PayPal’s sole discretion. In no event shall PayPal be obligated to pay you a bounty for any Submission. All Bounty Payments shall be considered gratuitous.\r\n\r\nAll Bounty Payments will be made in United States dollars (USD). You will be responsible for any tax implications related to Bounty Payments you receive, as determined by the laws of your jurisdiction of residence or citizenship.\r\n\r\nPayPal will determine all Bounty Payments based on the risk and impact of the vulnerability. The minimum bounty amount for a validated bug submission is $50 USD and the maximum bounty for a validated bug submission is $30,000 USD.\r\n\r\nPayPal Bug Bounty Team retains the right to determine if the bug submitted to the Bug Bounty Program is eligible. All determinations as to the amount of a bounty made by the PayPal Bug Bounty Team are final. Bounty Payment ranges are based on the classification and sensitivity of the data impacted, ease of exploit and overall risk to PayPal customers, PayPal brand and determined to be a valid security issue by PayPal’s security engineers.\r\n\r\n# Ownership of Submissions\r\nAs a condition of participation in the PayPal Bug Bounty Program, you hereby grant PayPal, its subsidiaries, affiliates and customers a perpetual, irrevocable, worldwide, royalty-free, transferrable, sublicensable (through multiple tiers) and non-exclusive license to use, reproduce, adapt, modify, publish, distribute, publicly perform, create derivative work from, make, use, sell, offer for sale and import the Submission, as well as any materials submitted to PayPal in connection therewith, for any purpose. You should not send us any Submission that you do not wish to license to us.\r\nYou hereby represent and warrant that the Submission is original to you and you own all right, title and interest in and to the Submission. Further, you hereby waive all other claims of any nature, including express contract, implied-in-fact contract, or quasi-contract, arising out of any disclosure of the Submission to PayPal. In no event shall PayPal be precluded from discussing, reviewing, developing for itself, having developed, or developing for third parties, materials which are competitive with those set forth in the Submission irrespective of their similarity to the information in the Submission, so long as PayPal complies with the terms of participation stated herein.\r\n\r\n# Termination\r\nIn the event (i) you breach any of these Program Terms or the terms and conditions of the PayPal Agreements; or (ii) PayPal determines, in its sole discretion that your continued participation in the Bug Bounty Program could adversely impact PayPal (including, but not limited to, presenting any threat to PayPal’s systems, security, finances and/or reputation) PayPal may immediately terminate your participation in the Bug Bounty Program and disqualify you from receiving any Bounty Payments. Please see our recommendations on the proper procedures for testing our applications.\r\n\r\n# Confidentiality\r\nAny information you receive or collect about PayPal or any PayPal user through the Bug Bounty Program (“Confidential Information”) must be kept confidential and only used in connection with the Bug Bounty Program. You may not use, disclose or distribute any such Confidential Information, including, but not limited to, any information regarding your Submission and information you obtain when researching the PayPal sites, without PayPal’s prior written consent.\r\n\r\n# Indemnification\r\nIn addition to any indemnification obligations you may have under the PayPal Agreements, you agree to defend, indemnify and hold PayPal, its subsidiaries, affiliates and the officers, directors, agents, joint ventures, employees and suppliers of PayPal, its subsidiaries, or our affiliates, harmless from any claim or demand (including attorneys’ fees) made or incurred by any third party due to or arising out of your Submissions, your breach of these Program Terms and/or your improper use of the Bug Bounty Program.\r\n\r\n# Changes to Program Terms\r\nThe Bug Bounty Program, including its policies, is subject to change or cancellation by PayPal at any time, without notice. As such, PayPal may amend these Program Terms and/or its policies at any time by posting a revised version on our website. By continuing to participate in the Bug Bounty Program after PayPal posts any such changes, you accept the Program Terms, as modified.\r\n\r\n\r\n", 
    "can_view_hacktivity": true, 
    "has_cover_photo": false, 
    "total_bounties_paid": 381300.0, 
    "policy_markdown": "<p>Our team of dedicated security professionals works vigilantly to help keep customer information secure. We recognize the important role that security researchers and our user community play in helping to keep PayPal and our customers secure. If you discover a site or product vulnerability please notify us using the guidelines below.</p>\n\n<h1 id=\"program-terms\">Program Terms</h1>\n\n<p>Please note that your participation in the Bug Bounty Program is voluntary and subject to the terms and conditions set forth on this page (“Program Terms”). By submitting a site or product vulnerability to PayPal, Inc. (“PayPal”) you acknowledge that you have read and agreed to these Program Terms.</p>\n\n<p>These Program Terms supplement the terms of PayPal User Agreement, the PayPal Acceptable Use Policy, and any other agreement in which you have entered with PayPal (collectively “PayPal Agreements”). The terms of those PayPal Agreements will apply to your use of, and participation in, the Bug Bounty Program as if fully set forth herein. If any inconsistency exists between the terms of the PayPal Agreements and these Program Terms, these Program Terms will control, but only with regard to the Bug Bounty Program.</p>\n\n<p>To encourage responsible disclosures, PayPal commits that, if we conclude, in our sole discretion, that a disclosure respects and meets all the guidelines of these Program Terms and the PayPal Agreements, PayPal will not bring a private action against you or refer a matter for public inquiry.</p>\n\n<p>PayPal will make a best effort to adhere to the following response targets:</p>\n\n<table>\n<thead>\n<tr>\n<th>Type of Response</th>\n<th>Business days</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>First Response</td>\n<td>2 days</td>\n</tr>\n<tr>\n<td>Time to Triage</td>\n<td>2 days</td>\n</tr>\n<tr>\n<td>Time to  Bounty</td>\n<td>14 days</td>\n</tr>\n<tr>\n<td>Time to Resolution</td>\n<td>depends on severity and complexity</td>\n</tr>\n</tbody>\n</table>\n\n<h1 id=\"eligibility-requirements\">Eligibility Requirements</h1>\n\n<p>To participate in the Bug Bounty Program, you must have a verified PayPal account in good standing in order to receive bounty rewards. If you do not currently have a PayPal account, you can sign up for one <a href=\"http://paypal.com/signup\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>here.</span><i class=\"icon-external-link\"></i></a></p>\n\n<p>To be eligible for the Bug Bounty Program, you must not:</p>\n\n<ul>\n<li>Be a resident of, or make your Submission from, a country against which the United States has issued export sanctions or other trade restrictions (e.g., Cuba, Iran, North Korea, Sudan and Syria);</li>\n<li>Be in violation of any national, state, or local law or regulation;</li>\n<li>Be employed by PayPal, Inc. or its subsidiaries;</li>\n<li>Be an immediate family member of a person employed by PayPal, Inc. or its subsidiaries or affiliates; or</li>\n<li>Be less than 14 years of age. If you are at least 14 years old, but are considered a minor in your place of residence, you must get your parent’s or legal guardian’s permission prior to participating in the program.</li>\n</ul>\n\n<p>If PayPal discovers that you meet any of the criteria above, PayPal will remove you from the Bug Bounty Program and disqualify you from receiving any Bounty Payments. </p>\n\n<h1 id=\"disclosure-guidelines\">Disclosure Guidelines</h1>\n\n<p>By providing a Submission or agreeing to the Program Terms, You agree that you may not publicly disclose your findings or the contents of your Submission to any third parties in any way without PayPal’s prior written approval.</p>\n\n<p>Failure to comply with the Program Terms will result in immediate disqualification from the Bug Bounty Program and ineligibility for receiving any Bounty Payments.</p>\n\n<h1 id=\"scope-for-web-applications\">Scope for Web Applications</h1>\n\n<h2 id=\"in-scope-vulnerabilities\">In-Scope Vulnerabilities</h2>\n\n<p>Accepted, in-scope vulnerabilities include, but are not limited to:</p>\n\n<ul>\n<li>Disclosure of sensitive or personally identifiable information</li>\n<li>Cross-Site Scripting (XSS)</li>\n<li>Cross-Site Request Forgery (CSRF) for sensitive functions in a privileged context</li>\n<li>Server-side or remote code execution (RCE)</li>\n<li>Authentication or authorization flaws, including insecure direct object references and authentication bypass</li>\n<li>Injection vulnerabilities, including SQL and XML injection</li>\n<li>Directory traversal</li>\n<li>Significant security misconfiguration with a verifiable vulnerability</li>\n</ul>\n\n<h2 id=\"out-of-scope-vulnerabilities\">Out-of-Scope Vulnerabilities</h2>\n\n<p>Certain vulnerabilities are considered out-of-scope for the Bug Bounty Program. Those out-of-scope vulnerabilities include, but are not limited to:</p>\n\n<ul>\n<li>Any physical attacks against PayPal property or data centers</li>\n<li>Scanner output or scanner-generated reports, including any automated or active exploit tool</li>\n<li>Attacks involving payment fraud, theft, or malicious merchant accounts</li>\n<li>Man-in-the-Middle attacks</li>\n<li>Vulnerabilities involving stolen credentials or physical access to a device</li>\n<li>Social engineering attacks, including those targeting internal employees</li>\n<li>Vulnerabilities for which there are existing, documented controls (e.g. <a title=\"https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/\" href=\"https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://developer.paypal.com/docs/classic/paypal-payments-standard/integration-guide/encryptedwebpayments/</span><i class=\"icon-external-link\"></i></a>)</li>\n<li>Open redirects with low security impact or requiring user interaction</li>\n<li>Host header injections without a specific, demonstrable impact</li>\n<li>Denial of service (DOS) attacks using automated tools</li>\n<li>Self-XSS, which includes any payload entered by the victim</li>\n<li>Any vulnerabilities requiring significant and unlikely interaction by the victim, such as disabling browser controls</li>\n<li>Login/logout CSRF</li>\n<li>Content spoofing without embedded HTML or JavaScript</li>\n<li>Infrastructure vulnerabilities, including:</li>\n<li>Issues related to SSL certificates</li>\n<li>DNS configuration issues</li>\n<li>Server configuration issues (e.g. open ports, TLS versions, etc.)</li>\n<li>Most vulnerabilities within our sandbox, lab, or staging environments, except Braintree.</li>\n<li>Vulnerabilities only affecting users of outdated or unpatched browsers and platforms</li>\n<li>Vulnerabilities that only affect one browser will be considered on a case-by-case basis, and may be closed as informative due to the reduced attack surface</li>\n<li>Information disclosure of public or non-protected information (e.g. code in a public repository, server banners, etc.)</li>\n<li>Any XSS that requires Flash. Flash is disabled by default in most modern browsers, thus greatly reducing the attack surface and associated risk.</li>\n<li>Any other submission determined to be low risk, based on unlikely or theoretical attack vectors, requiring significant user interaction, or resulting in minimal impact </li>\n</ul>\n\n<h1 id=\"scope-for-mobile-applications\">Scope for Mobile Applications</h1>\n\n<h2 id=\"in-scope-vulnerabilities\">In-Scope Vulnerabilities</h2>\n\n<p>In addition to in-scope items mentioned above, some additional vulnerability types will be considered in-scope for mobile applications. These include:</p>\n\n<ul>\n<li>Man-in-the-Middle attacks</li>\n<li>Attacks requiring physical access to a mobile device</li>\n</ul>\n\n<p>Certain vulnerabilities with a working proof of concept on some of our Android mobile app(s) may qualify for an additional bounty through the Google Play Security Rewards Program. To see which apps and vulnerabilities may qualify for a bounty, please refer to the <a href=\"https://hackerone.com/googleplay\" target=\"_blank\">Google Play Security Rewards Program’s Scope and Vulnerability Criteria</a>.</p>\n\n<h2 id=\"out-of-scope-vulnerabilities\">Out-of-Scope Vulnerabilities</h2>\n\n<p>The following mobile vulnerabilities are out-of-scope and will not be accepted:</p>\n\n<ul>\n<li>Vulnerabilities requiring a rooted, jailbroken, or otherwise modified device</li>\n<li>Vulnerabilities requiring extensive user interaction</li>\n<li>Exposure of non-sensitive data on the device</li>\n<li>Vulnerabilities on third party libraries without showing specific impact to the target application (e.g. a CVE with no exploit)</li>\n</ul>\n\n<h1 id=\"bug-submission-requirements\">Bug Submission Requirements</h1>\n\n<h2 id=\"required-information\">Required information</h2>\n\n<p>For all submissions, please include:</p>\n\n<ul>\n<li>Full description of the vulnerability being reported, including the exploitability and impact</li>\n<li>Evidence and explanation of all steps required to reproduce the submission, which may include:</li>\n<li>Videos</li>\n<li>Screenshots</li>\n<li>Exploit code</li>\n<li>Traffic logs</li>\n<li>Web/API requests and responses</li>\n<li>Email address or user ID of any test accounts</li>\n<li>IP address used during testing</li>\n<li>For RCE submissions, see below</li>\n<li>Failure to include any of the above items may delay or jeopardize the Bounty Payment</li>\n</ul>\n\n<h1 id=\"remote-code-execution-rce-submission-guidelines\">Remote Code Execution (RCE) Submission Guidelines:</h1>\n\n<p>Failure to meet the below conditions and requirements could result in a forfeiture of any potential Bounty Payment.</p>\n\n<ul>\n<li>Source IP address</li>\n<li>Timestamp, including time zone</li>\n<li>Full server request and responses</li>\n<li>Filenames of any uploaded files, which must include “bugbounty” and the timestamp</li>\n<li>Callback IP and port, if applicable</li>\n<li>Any data that was accessed, either deliberately or inadvertently</li>\n<li>Allowed Actions:</li>\n<li>Directly injecting benign commands via the web application or interface (e.g. whoami, hostname, ifconfig)</li>\n<li>Uploading a file that outputs the result of a hard-coded benign command</li>\n<li>Prohibited Actions:</li>\n<li>Uploading files that allow arbitrary commands (i.e. a webshell)</li>\n<li>Modifying any files or data, including permissions</li>\n<li>Deleting any files or data</li>\n<li>Interrupting normal operations (e.g. triggering a reboot)</li>\n<li>Creating and maintaining a persistent connection to the server</li>\n<li>Intentionally viewing any files or data beyond what is needed to prove the vulnerability</li>\n<li>Failing to disclose any actions taken or applicable required information</li>\n</ul>\n\n<h1 id=\"bounty-payments\">Bounty Payments</h1>\n\n<h3 id=\"bounty-payments-will-be-processed-by-paypal-rather-than-hackerone-at-this-time-all-bounty-payments-must-be-made-to-a-verified-paypal-account-in-good-standing-if-you-do-not-have-a-verified-paypal-account-in-good-standing-at-the-time-of-payment-you-will-not-be-eligible-to-receive-a-bounty\">Bounty Payments will be processed by PayPal rather than HackerOne at this time. All Bounty Payments must be made to a verified PayPal Account in good standing. If you do not have a verified PayPal Account in good standing at the time of payment, you will not be eligible to receive a bounty</h3>\n\n<p>Exceptions will only be made in extraordinary circumstances agreed to by PayPal, in its sole discretion, via email from the Bug Bounty Program team). In order to receive payment, you&#39;ll be asked to add and verify your <a href=\"https://docs.hackerone.com/hackers/hacker-email-alias.html\" target=\"_blank\">HackerOne email alias</a> to you PayPal account.</p>\n\n<p>You may be eligible to receive a monetary reward (“Bounty Payment”) if: (i) you are the first person to submit a site or product vulnerability; (ii) that vulnerability is determined to by a valid security issue by PayPal’s security team; and (iii) you have complied with all Program Terms.<br>\nBounty Payments, if any, will be determined by PayPal, in PayPal’s sole discretion. In no event shall PayPal be obligated to pay you a bounty for any Submission. All Bounty Payments shall be considered gratuitous.</p>\n\n<p>All Bounty Payments will be made in United States dollars (USD). You will be responsible for any tax implications related to Bounty Payments you receive, as determined by the laws of your jurisdiction of residence or citizenship.</p>\n\n<p>PayPal will determine all Bounty Payments based on the risk and impact of the vulnerability. The minimum bounty amount for a validated bug submission is $50 USD and the maximum bounty for a validated bug submission is $30,000 USD.</p>\n\n<p>PayPal Bug Bounty Team retains the right to determine if the bug submitted to the Bug Bounty Program is eligible. All determinations as to the amount of a bounty made by the PayPal Bug Bounty Team are final. Bounty Payment ranges are based on the classification and sensitivity of the data impacted, ease of exploit and overall risk to PayPal customers, PayPal brand and determined to be a valid security issue by PayPal’s security engineers.</p>\n\n<h1 id=\"ownership-of-submissions\">Ownership of Submissions</h1>\n\n<p>As a condition of participation in the PayPal Bug Bounty Program, you hereby grant PayPal, its subsidiaries, affiliates and customers a perpetual, irrevocable, worldwide, royalty-free, transferrable, sublicensable (through multiple tiers) and non-exclusive license to use, reproduce, adapt, modify, publish, distribute, publicly perform, create derivative work from, make, use, sell, offer for sale and import the Submission, as well as any materials submitted to PayPal in connection therewith, for any purpose. You should not send us any Submission that you do not wish to license to us.<br>\nYou hereby represent and warrant that the Submission is original to you and you own all right, title and interest in and to the Submission. Further, you hereby waive all other claims of any nature, including express contract, implied-in-fact contract, or quasi-contract, arising out of any disclosure of the Submission to PayPal. In no event shall PayPal be precluded from discussing, reviewing, developing for itself, having developed, or developing for third parties, materials which are competitive with those set forth in the Submission irrespective of their similarity to the information in the Submission, so long as PayPal complies with the terms of participation stated herein.</p>\n\n<h1 id=\"termination\">Termination</h1>\n\n<p>In the event (i) you breach any of these Program Terms or the terms and conditions of the PayPal Agreements; or (ii) PayPal determines, in its sole discretion that your continued participation in the Bug Bounty Program could adversely impact PayPal (including, but not limited to, presenting any threat to PayPal’s systems, security, finances and/or reputation) PayPal may immediately terminate your participation in the Bug Bounty Program and disqualify you from receiving any Bounty Payments. Please see our recommendations on the proper procedures for testing our applications.</p>\n\n<h1 id=\"confidentiality\">Confidentiality</h1>\n\n<p>Any information you receive or collect about PayPal or any PayPal user through the Bug Bounty Program (“Confidential Information”) must be kept confidential and only used in connection with the Bug Bounty Program. You may not use, disclose or distribute any such Confidential Information, including, but not limited to, any information regarding your Submission and information you obtain when researching the PayPal sites, without PayPal’s prior written consent.</p>\n\n<h1 id=\"indemnification\">Indemnification</h1>\n\n<p>In addition to any indemnification obligations you may have under the PayPal Agreements, you agree to defend, indemnify and hold PayPal, its subsidiaries, affiliates and the officers, directors, agents, joint ventures, employees and suppliers of PayPal, its subsidiaries, or our affiliates, harmless from any claim or demand (including attorneys’ fees) made or incurred by any third party due to or arising out of your Submissions, your breach of these Program Terms and/or your improper use of the Bug Bounty Program.</p>\n\n<h1 id=\"changes-to-program-terms\">Changes to Program Terms</h1>\n\n<p>The Bug Bounty Program, including its policies, is subject to change or cancellation by PayPal at any time, without notice. As such, PayPal may amend these Program Terms and/or its policies at any time by posting a revised version on our website. By continuing to participate in the Bug Bounty Program after PayPal posts any such changes, you accept the Program Terms, as modified.</p>\n", 
    "show_mean_first_response_time": true, 
    "show_total_bounties_paid": true, 
    "can_invite_team_member": false, 
    "researcher_count": 50, 
    "number_of_updates": 0, 
    "show_mean_report_triage_time": false, 
    "top_bounty_upper_range": 16300.0, 
    "name": "PayPal", 
    "submission_state": "open", 
    "url": "https://hackerone.com/paypal", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": null, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}