{
    "twitter_handle": "", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": false, 
    "policy_html": "<h1 id=\"rbkmoney-vulnerability-disclosure-program-policy\">RBKmoney Vulnerability Disclosure Program policy</h1>\n\n<p>If you found a security vulnerability at any of RBKmoney services, let us know. We will review all legitimate reports and do our best to quickly fix the issue. Before reporting vulnerability, check out the materials on this page including information disclosure policy and vulnerabilities that should not be reported.</p>\n\n<h2 id=\"program-scope-and-terms\">Program scope and terms</h2>\n\n<p>The Program&#39;s scope involves the following RBKmoney domains (сheck out the exceptions):</p>\n<pre class=\"highlight plaintext\"><code>*.rbk.money\n*.rbkmoney.st\n*.rbk.mn\n*.rbkmoney.net\nrbkmoney.com\n</code></pre>\n<p>If you are unsure whether a service is eligible for Program or not, feel free to ask us.</p>\n\n<blockquote>\n<p><strong>Note</strong> </p>\n\n<ul>\n<li>Use your own test accounts for vulnerability research. Do not interact with other accounts without their owner permission.</li>\n<li>Avoid breach of data confidentiality.</li>\n<li>Do not use discovered vulnerabilities for your own benefit. This includes demonstrating additional risks, attempting to disclose confidential data or finding other problems.</li>\n<li>Do not use any vulnerability testing tools that automatically generate very significant volumes of traffic.</li>\n<li>Do not perform any attack that could harm the reliability / integrity of our services or data (denial-of-service attacks, etc.).</li>\n<li>Do not try sneaking into RBKmoney offices and data centers.</li>\n<li>Do not perform spamming and social engineering attacks against our clients and employees and do not carry out other similarly questionable things.</li>\n</ul>\n</blockquote>\n\n<h3 id=\"qualifying-vulnerabilities\">Qualifying vulnerabilities</h3>\n\n<p>Any design or implementation vulnerability that substantially affects the confidentiality or integrity of data is likely to be in scope for the Program. Common examples include:</p>\n\n<ul>\n<li>server-side code execution vulnerabilities</li>\n<li>authentication or authorization vulnerabilities</li>\n<li>business logic vulnerabilities</li>\n<li>cross-site request forgery</li>\n<li>cross-site scripting</li>\n</ul>\n\n<h3 id=\"non-qualifying-vulnerabilities\">Non-qualifying vulnerabilities</h3>\n\n<p>Scope of the Program is limited to <strong>technical</strong> vulnerabilities in our services and web applications.</p>\n\n<h4 id=\"we-do-not-accept-and-review-reports-generated-by-automated-vulnerability-scanners-and-reports-of\">We do not accept and review reports generated by automated vulnerability scanners and reports of:</h4>\n\n<ul>\n<li>CSRF for non-significant actions (logout, etc.)</li>\n<li>Self-XSS without demonstration of real security impact for users or system</li>\n<li>framing and clickjacking vulnerabilities without a documented series of clicks that produce a real security impact</li>\n<li>lack of security mechanism / inconsistency with best practices without demonstration of real security impact</li>\n<li>not enforced SSL/TLS, use of insecure SSL/TLS ciphers</li>\n<li>attacks which require full access to passwords, tokens, browser profile or local system</li>\n<li>non-sensitive information disclosure (such as product or protocol version)</li>\n<li>bugs that don’t affect the latest version of modern browsers and bugs related to browser extensions</li>\n<li>vulnerabilities that only affect users with specific browsers</li>\n<li>attacks requiring exceedingly unlikely user interaction</li>\n<li>denial-of-service attacks or vulnerabilities related to rate limiting</li>\n<li>timing attacks, that prove the existence of a user account, etc.</li>\n<li>insecure cookie settings for non-sensitive cookies</li>\n<li>bugs in content / services that are not owned or operated by RBKmoney (include third party services operating on our subdomains)</li>\n<li>vulnerabilities that RBKmoney determines to be an accepted risk</li>\n<li>scripting or other automation, brute forcing of intended functionality and parameters (include invoice, url-shortener payment link brute forcing, etc.)</li>\n<li>phishing related issues (like text injection, available similar domains, etc.)</li>\n<li>weak password policy</li>\n</ul>\n\n<h2 id=\"vulnerability-report-requirements\">Vulnerability report requirements</h2>\n\n<p>By submitting a bug report you agree to comply with RBKmoney information disclosure policy.</p>\n\n<p>A bug report must contain a detailed description of the discovered vulnerability:</p>\n\n<ul>\n<li>vulnerable hosts and components</li>\n<li>discovered vulnerability and security impact</li>\n<li>reproduction steps</li>\n<li>attack scenario</li>\n<li>recommendations for remediation </li>\n</ul>\n\n<p>Reproduction steps describes the exploitation process required, step-by-step, in the proper order.</p>\n\n<p>Attack scenario describes details about how an attacker would use the bug you are submitting, any necessary conditions for it to work, and what the attacker would gain through a successful attack.</p>\n\n<p>Reports that clearly and concisely identify the affected component, present a well-developed attack scenario, and include clear reproduction steps, will get triaged much faster.</p>\n\n<p>We accept reports in Russian and English.</p>\n\n<h2 id=\"reward-policy\">Reward policy</h2>\n\n<p>Currently we not provide awards according to HackerOne Vulnerability Disclosure Program (VDP) rules.</p>\n\n<h2 id=\"information-disclosure-policy\">Information disclosure policy</h2>\n\n<p>Vulnerability details should be disclosed only in accordance with <a href=\"https://www.hackerone.com/disclosure-guidelines\" rel=\"nofollow noopener noreferrer\"><span>HackerOne disclosure guidelines</span><i class=\"icon-external-link\"></i></a> and RBKmoney vulnerability disclosure program policy.</p>\n\n<p>Public or private disclosure of the details of any vulnerability found on RBKmoney is allowed 90 days after vulnerability is fixed and only by mutual agreement of the parties.</p>\n\n<p>Request for vulnerability disclosure should be filed via HackerOne report interface. No vulnerability disclosure, including partial is allowed before vulnerability is disclosed on HackerOne.</p>\n\n<blockquote>\n<p><strong>Note</strong></p>\n\n<p>Any sensitive information accidently obtained during vulnerability research or demonstration should not be disclosed. This information includes (but not limited to) infrastructure and implementation details, internal documentation and interfaces, source code, user’s and employee’s data. <br>\nIntentional access to this information is strictly prohibited.</p>\n</blockquote>\n\n<hr>\n\n<h1 id=\"rbkmoney\">Политика программы раскрытия уязвимостей RBKmoney</h1>\n\n<p>Если вы нашли уязвимости безопасности в сервисах RBKmoney, сообщите нам об этом. Мы рассматриваем все легитимные отчеты и делаем все возможное, чтобы максимально быстро устранить уязвимость. Прежде чем сообщать об уязвимости, ознакомьтесь с материалами на этой странице, включая политику раскрытия информации и уязвимости, о которых не следует сообщать.</p>\n\n<h2 id=\"part-8b73ffa515cd9368\">Условия и область действия Программы</h2>\n\n<p>В область действия Программы входят следующие домены RBKmoney (ознакомьтесь с исключениями):</p>\n<pre class=\"highlight plaintext\"><code>*.rbk.money\n*.rbkmoney.st\n*.rbk.mn\n*.rbkmoney.net\nrbkmoney.com\n</code></pre>\n<p>Если вы обнаружите уязвимость, которая не касается перечисленных выше доменов, мы исследуем ее. Если вы не уверены в том, участвует сервис в Программе или нет, не стесняйтесь спрашивать нас.</p>\n\n<blockquote>\n<p><strong>Примечание</strong> </p>\n\n<ul>\n<li>Используйте свои собственные тестовые учетные записи для поиска уязвимостей. Не взаимодействуйте с другими учетными записями без разрешения их владельцев.</li>\n<li>Избегайте нарушения конфиденциальности данных.</li>\n<li>Не используйте обнаруженную уязвимость для своей собственной выгоды. Сюда входит демонстрация дополнительных рисков, попытка раскрыть конфиденциальные данные или найти другие уязвимости.</li>\n<li>Не используйте инструменты тестирования уязвимостей, которые автоматически генерируют значительные объемы трафика.</li>\n<li>Не выполняйте атаки, которые могут нанести вред надежности / целостности наших служб или данных (атаки типа «отказ в обслуживании» и другие).</li>\n<li>Не пытайтесь проникнуть в офисы и центры обработки данных RBKmoney.</li>\n<li>Не осуществляйте рассылку спама и атаки социальной инженерии на наших клиентов и сотрудников, а также не делайте другие сомнительные вещи.</li>\n</ul>\n</blockquote>\n\n<h3 id=\"part-e3b10f98d9a30383\">Квалифицируемые уязвимости</h3>\n\n<p>Любая уязвимость дизайна или реализации, которая существенно влияет на конфиденциальность или целостность данных, вероятно, будет участвовать в Программе. Общие примеры включают:</p>\n\n<ul>\n<li>удаленное исполнение кода на стороне сервера</li>\n<li>уязвимости в реализации протоколов аутентификации или авторизации</li>\n<li>уязвимости бизнес-логики</li>\n<li>CSRF-уязвимости</li>\n<li>XSS-уязвимости</li>\n</ul>\n\n<h3 id=\"part-f94a22325b90f15\">Неквалифицируемые уязвимости</h3>\n\n<p>Область действия программы ограничена исключительно <strong>техническими</strong> уязвимостями в наших сервисах и веб-приложениях.</p>\n\n<h4 id=\"part-8ab61347d88260da\">Мы не принимаем и не рассматриваем отчеты, сгенерированные автоматическими сканерами уязвимостей, а также отчеты о:</h4>\n\n<ul>\n<li>CSRF-уязвимостях для некритичных действий (logout и другие)</li>\n<li>уязвимостях типа Self-XSS без демонстрации реального воздействия на безопасность пользователей или систем</li>\n<li>framing и clickjacking-уязвимостях без документированной серии кликов, подтверждающей существование уязвимости</li>\n<li>отсутствии механизма безопасности / несоответствии лучшим практикам без демонстрации реального воздействия на безопасность пользователей или систем</li>\n<li>отсутствии SSL/TLS, использовании небезопасных шифров SSL/TLS</li>\n<li>атаках, требующих полного доступа к паролям, токенам, профилю браузера или локальной системе</li>\n<li>раскрытии некритичной информации (такой как версия продукта, протокола и т.д.)</li>\n<li>ошибках, которые не затрагивают последние версии современных браузеров и ошибках, связанных с расширениями браузеров</li>\n<li>уязвимостях, которые затрагивают только пользователей с определенными браузерами</li>\n<li>атаках, требующих чрезвычайно маловероятного пользовательского взаимодействия</li>\n<li>атаках типа «отказ в обслуживании» или уязвимостях, связанных с ограничением частоты запросов</li>\n<li>временных атаках, которые доказывают существование учетной записи пользователя и т.п.</li>\n<li>небезопасных настройках cookie для некритичных cookie</li>\n<li>ошибках в содержании / сервисах, которые не принадлежат или не управляются RBKmoney (сюда входят сторонние службы, работающие на субдоменах)</li>\n<li>уязвимостях, которые RBKmoney определяет как уязвимости с приемлемым уровнем риска</li>\n<li>скриптинге или другой автоматизации, переборе предполагаемой функциональности и параметров (например, идентификатора счета, платежных ссылок в сервисе rbk.mn)</li>\n<li>вопросах, связанных с фишингом (например, инъекция текста, доступные похожие домены, и т.д.)</li>\n<li>слабой парольной политике</li>\n</ul>\n\n<h2 id=\"part-8292128984a78003\">Требования к отчетам об уязвимостях</h2>\n\n<p>Предоставляя отчет об уязвимостях, вы соглашаетесь соблюдать политику раскрытия информации RBKmoney.</p>\n\n<p>Отчет должен содержать подробное описание обнаруженной уязвимости:</p>\n\n<ul>\n<li>уязвимые узлы и компоненты</li>\n<li>обнаруженная уязвимость и ее влияние на безопасность</li>\n<li>этапы воспроизведения</li>\n<li>сценарий атаки</li>\n<li>рекомендации по устранению</li>\n</ul>\n\n<p>Этапы воспроизведения описывают процесс эксплуатации уязвимости, шаг за шагом, в правильном порядке.</p>\n\n<p>В сценарии атаки описывается информация о том, как злоумышленник может использовать обнаруженную вами уязвимость, необходимые условия для ее эксплуатации и то, что атакующий может получить в случае успешной атаки.</p>\n\n<p>Отчеты, которые четко и лаконично идентифицируют затронутый компонент, описывают хорошо разработанный сценарий атаки и включают четкие этапы воспроизведения, рассматриваются намного быстрее.</p>\n\n<p>Мы предпочитаем получать отчеты на русском или английском языке.</p>\n\n<h2 id=\"part-20e7e0dba2606c36\">Политика вознаграждения</h2>\n\n<p>В настоящий момент мы не осуществляем выплату вознаграждения за найденные уязвимости в соответствии с правилами HackerOne Vulnerability disclosure program (VDP).</p>\n\n<h2 id=\"part-752d6b7c865bd02b\">Политика раскрытия информации</h2>\n\n<p>Информация об уязвимостях может раскрываться только в соответствии с <a href=\"https://www.hackerone.com/disclosure-guidelines\" rel=\"nofollow noopener noreferrer\"><span>HackerOne disclosure guidelines</span><i class=\"icon-external-link\"></i></a> и политикой настоящей Программы.</p>\n\n<p>Публичное или частное раскрытие сведений о любой уязвимости, обнаруженной в RBKmoney, разрешено через 90 дней после устранения уязвимости и только по взаимному согласию сторон.</p>\n\n<p>Запрос на раскрытие информации об уязвимости должен быть подан через интерфейс HackerOne. Раскрытие информации об уязвимости, в том числе частичное, до раскрытия уязвимости в HackerOne не разрешается.</p>\n\n<blockquote>\n<p><strong>Примечание</strong></p>\n\n<p>Любая конфиденциальная информация, случайно полученная в ходе поиска уязвимостей или демонстрации, не должна раскрываться. Эта информация включает (но не ограничивается) сведения об инфраструктуре, интерфейсах и деталях реализации, внутреннюю документацию, исходный код, данные пользователей и сотрудников.<br>\nПреднамеренный доступ к этой информации строго запрещен.</p>\n</blockquote>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "total_bounties_paid_prefix": null, 
    "awards_miles": false, 
    "average_bounty_upper_range": null, 
    "top_bounty_lower_range": null, 
    "anc_enabled": null, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2018-01-21T14:56:53.001Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2017-12-02T03:08:13.949Z", 
    "mean_time_to_bounty": null, 
    "offers_swag": false, 
    "offers_bounties": false, 
    "id": 18073, 
    "mean_time_to_resolution": null, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/018/073/d158d79d2a49b4b31923a3088c4832d3721c2fbc_small.png?1516880904", 
        "large": "https://profile-photos.hackerone-user-content.com/000/018/073/2fd71c7c8b287273e661771e1a6326b37d783c02_large.png?1516880904", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/018/073/648b5d340035bd84b14f4cdb5efb4a1b1119021a_xtralarge.png?1516880904"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "number_of_updates": 0, 
    "target_signal": 0, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "http://rbk.money", 
        "about": "Payment system for business", 
        "twitter_handle": "", 
        "name": "RBKmoney"
    }, 
    "scopes": [
        "rbk.money", 
        "rbkmoney.com", 
        "rbkmoney.ru"
    ], 
    "handle": "rbkmoney", 
    "cover_color": "#000000", 
    "mean_time_to_first_response": null, 
    "average_bounty_lower_range": null, 
    "response_efficiency_percentage": 100, 
    "policy": "# RBKmoney Vulnerability Disclosure Program policy\r\n\r\nIf you found a security vulnerability at any of RBKmoney services, let us know. We will review all legitimate reports and do our best to quickly fix the issue. Before reporting vulnerability, check out the materials on this page including information disclosure policy and vulnerabilities that should not be reported.\r\n\r\n## Program scope and terms\r\n\r\nThe Program's scope involves the following RBKmoney domains (сheck out the exceptions):\r\n\r\n```\r\n*.rbk.money\r\n*.rbkmoney.st\r\n*.rbk.mn\r\n*.rbkmoney.net\r\nrbkmoney.com\r\n```\r\n\r\nIf you are unsure whether a service is eligible for Program or not, feel free to ask us.\r\n\r\n> **Note** \r\n>+ Use your own test accounts for vulnerability research. Do not interact with other accounts without their owner permission.\r\n>+ Avoid breach of data confidentiality.\r\n>+ Do not use discovered vulnerabilities for your own benefit. This includes demonstrating additional risks, attempting to disclose confidential data or finding other problems.\r\n>+ Do not use any vulnerability testing tools that automatically generate very significant volumes of traffic.\r\n>+ Do not perform any attack that could harm the reliability / integrity of our services or data (denial-of-service attacks, etc.).\r\n>+ Do not try sneaking into RBKmoney offices and data centers.\r\n>+ Do not perform spamming and social engineering attacks against our clients and employees and do not carry out other similarly questionable things.\r\n\r\n### Qualifying vulnerabilities\r\n\r\nAny design or implementation vulnerability that substantially affects the confidentiality or integrity of data is likely to be in scope for the Program. Common examples include:\r\n\r\n+ server-side code execution vulnerabilities\r\n+ authentication or authorization vulnerabilities\r\n+ business logic vulnerabilities\r\n+ cross-site request forgery\r\n+ cross-site scripting\r\n\r\n### Non-qualifying vulnerabilities\r\n\r\nScope of the Program is limited to **technical** vulnerabilities in our services and web applications.\r\n\r\n#### We do not accept and review reports generated by automated vulnerability scanners and reports of:\r\n\r\n+ CSRF for non-significant actions (logout, etc.)\r\n+ Self-XSS without demonstration of real security impact for users or system\r\n+ framing and clickjacking vulnerabilities without a documented series of clicks that produce a real security impact\r\n+ lack of security mechanism / inconsistency with best practices without demonstration of real security impact\r\n+ not enforced SSL/TLS, use of insecure SSL/TLS ciphers\r\n+ attacks which require full access to passwords, tokens, browser profile or local system\r\n+ non-sensitive information disclosure (such as product or protocol version)\r\n+ bugs that don’t affect the latest version of modern browsers and bugs related to browser extensions\r\n+ vulnerabilities that only affect users with specific browsers\r\n+ attacks requiring exceedingly unlikely user interaction\r\n+ denial-of-service attacks or vulnerabilities related to rate limiting\r\n+ timing attacks, that prove the existence of a user account, etc.\r\n+ insecure cookie settings for non-sensitive cookies\r\n+ bugs in content / services that are not owned or operated by RBKmoney (include third party services operating on our subdomains)\r\n+ vulnerabilities that RBKmoney determines to be an accepted risk\r\n+ scripting or other automation, brute forcing of intended functionality and parameters (include invoice, url-shortener payment link brute forcing, etc.)\r\n+ phishing related issues (like text injection, available similar domains, etc.)\r\n+ weak password policy\r\n\r\n## Vulnerability report requirements\r\n\r\nBy submitting a bug report you agree to comply with RBKmoney information disclosure policy.\r\n\r\nA bug report must contain a detailed description of the discovered vulnerability:\r\n\r\n+ vulnerable hosts and components\r\n+ discovered vulnerability and security impact\r\n+ reproduction steps\r\n+ attack scenario\r\n+ recommendations for remediation \r\n\r\nReproduction steps describes the exploitation process required, step-by-step, in the proper order.\r\n\r\nAttack scenario describes details about how an attacker would use the bug you are submitting, any necessary conditions for it to work, and what the attacker would gain through a successful attack.\r\n\r\nReports that clearly and concisely identify the affected component, present a well-developed attack scenario, and include clear reproduction steps, will get triaged much faster.\r\n\r\nWe accept reports in Russian and English.\r\n\r\n## Reward policy\r\n\r\nCurrently we not provide awards according to HackerOne Vulnerability Disclosure Program (VDP) rules.\r\n\r\n## Information disclosure policy\r\n\r\nVulnerability details should be disclosed only in accordance with [HackerOne disclosure guidelines](https://www.hackerone.com/disclosure-guidelines) and RBKmoney vulnerability disclosure program policy.\r\n\r\nPublic or private disclosure of the details of any vulnerability found on RBKmoney is allowed 90 days after vulnerability is fixed and only by mutual agreement of the parties.\r\n\r\nRequest for vulnerability disclosure should be filed via HackerOne report interface. No vulnerability disclosure, including partial is allowed before vulnerability is disclosed on HackerOne.\r\n\r\n> **Note**\r\n>\r\n> Any sensitive information accidently obtained during vulnerability research or demonstration should not be disclosed. This information includes (but not limited to) infrastructure and implementation details, internal documentation and interfaces, source code, user’s and employee’s data. \r\n> Intentional access to this information is strictly prohibited.\r\n\r\n----------\r\n\r\n# Политика программы раскрытия уязвимостей RBKmoney\r\n\r\nЕсли вы нашли уязвимости безопасности в сервисах RBKmoney, сообщите нам об этом. Мы рассматриваем все легитимные отчеты и делаем все возможное, чтобы максимально быстро устранить уязвимость. Прежде чем сообщать об уязвимости, ознакомьтесь с материалами на этой странице, включая политику раскрытия информации и уязвимости, о которых не следует сообщать.\r\n\r\n## Условия и область действия Программы\r\n\r\nВ область действия Программы входят следующие домены RBKmoney (ознакомьтесь с исключениями):\r\n\r\n```\r\n*.rbk.money\r\n*.rbkmoney.st\r\n*.rbk.mn\r\n*.rbkmoney.net\r\nrbkmoney.com\r\n```\r\n\r\nЕсли вы обнаружите уязвимость, которая не касается перечисленных выше доменов, мы исследуем ее. Если вы не уверены в том, участвует сервис в Программе или нет, не стесняйтесь спрашивать нас.\r\n\r\n> **Примечание** \r\n>+ Используйте свои собственные тестовые учетные записи для поиска уязвимостей. Не взаимодействуйте с другими учетными записями без разрешения их владельцев.\r\n>+ Избегайте нарушения конфиденциальности данных.\r\n>+ Не используйте обнаруженную уязвимость для своей собственной выгоды. Сюда входит демонстрация дополнительных рисков, попытка раскрыть конфиденциальные данные или найти другие уязвимости.\r\n>+ Не используйте инструменты тестирования уязвимостей, которые автоматически генерируют значительные объемы трафика.\r\n>+ Не выполняйте атаки, которые могут нанести вред надежности / целостности наших служб или данных (атаки типа «отказ в обслуживании» и другие).\r\n>+ Не пытайтесь проникнуть в офисы и центры обработки данных RBKmoney.\r\n>+ Не осуществляйте рассылку спама и атаки социальной инженерии на наших клиентов и сотрудников, а также не делайте другие сомнительные вещи.\r\n\r\n### Квалифицируемые уязвимости\r\n\r\nЛюбая уязвимость дизайна или реализации, которая существенно влияет на конфиденциальность или целостность данных, вероятно, будет участвовать в Программе. Общие примеры включают:\r\n\r\n+ удаленное исполнение кода на стороне сервера\r\n+ уязвимости в реализации протоколов аутентификации или авторизации\r\n+ уязвимости бизнес-логики\r\n+ CSRF-уязвимости\r\n+ XSS-уязвимости\r\n\r\n### Неквалифицируемые уязвимости\r\n\r\nОбласть действия программы ограничена исключительно **техническими** уязвимостями в наших сервисах и веб-приложениях.\r\n\r\n#### Мы не принимаем и не рассматриваем отчеты, сгенерированные автоматическими сканерами уязвимостей, а также отчеты о:\r\n\r\n+ CSRF-уязвимостях для некритичных действий (logout и другие)\r\n+ уязвимостях типа Self-XSS без демонстрации реального воздействия на безопасность пользователей или систем\r\n+ framing и clickjacking-уязвимостях без документированной серии кликов, подтверждающей существование уязвимости\r\n+ отсутствии механизма безопасности / несоответствии лучшим практикам без демонстрации реального воздействия на безопасность пользователей или систем\r\n+ отсутствии SSL/TLS, использовании небезопасных шифров SSL/TLS\r\n+ атаках, требующих полного доступа к паролям, токенам, профилю браузера или локальной системе\r\n+ раскрытии некритичной информации (такой как версия продукта, протокола и т.д.)\r\n+ ошибках, которые не затрагивают последние версии современных браузеров и ошибках, связанных с расширениями браузеров\r\n+ уязвимостях, которые затрагивают только пользователей с определенными браузерами\r\n+ атаках, требующих чрезвычайно маловероятного пользовательского взаимодействия\r\n+ атаках типа «отказ в обслуживании» или уязвимостях, связанных с ограничением частоты запросов\r\n+ временных атаках, которые доказывают существование учетной записи пользователя и т.п.\r\n+ небезопасных настройках cookie для некритичных cookie\r\n+ ошибках в содержании / сервисах, которые не принадлежат или не управляются RBKmoney (сюда входят сторонние службы, работающие на субдоменах)\r\n+ уязвимостях, которые RBKmoney определяет как уязвимости с приемлемым уровнем риска\r\n+ скриптинге или другой автоматизации, переборе предполагаемой функциональности и параметров (например, идентификатора счета, платежных ссылок в сервисе rbk.mn)\r\n+ вопросах, связанных с фишингом (например, инъекция текста, доступные похожие домены, и т.д.)\r\n+ слабой парольной политике\r\n\r\n## Требования к отчетам об уязвимостях\r\n\r\nПредоставляя отчет об уязвимостях, вы соглашаетесь соблюдать политику раскрытия информации RBKmoney.\r\n\r\nОтчет должен содержать подробное описание обнаруженной уязвимости:\r\n\r\n+ уязвимые узлы и компоненты\r\n+ обнаруженная уязвимость и ее влияние на безопасность\r\n+ этапы воспроизведения\r\n+ сценарий атаки\r\n+ рекомендации по устранению\r\n\r\nЭтапы воспроизведения описывают процесс эксплуатации уязвимости, шаг за шагом, в правильном порядке.\r\n\r\nВ сценарии атаки описывается информация о том, как злоумышленник может использовать обнаруженную вами уязвимость, необходимые условия для ее эксплуатации и то, что атакующий может получить в случае успешной атаки.\r\n\r\nОтчеты, которые четко и лаконично идентифицируют затронутый компонент, описывают хорошо разработанный сценарий атаки и включают четкие этапы воспроизведения, рассматриваются намного быстрее.\r\n\r\nМы предпочитаем получать отчеты на русском или английском языке.\r\n\r\n## Политика вознаграждения\r\n\r\nВ настоящий момент мы не осуществляем выплату вознаграждения за найденные уязвимости в соответствии с правилами HackerOne Vulnerability disclosure program (VDP).\r\n\r\n## Политика раскрытия информации\r\n\r\nИнформация об уязвимостях может раскрываться только в соответствии с [HackerOne disclosure guidelines](https://www.hackerone.com/disclosure-guidelines) и политикой настоящей Программы.\r\n\r\nПубличное или частное раскрытие сведений о любой уязвимости, обнаруженной в RBKmoney, разрешено через 90 дней после устранения уязвимости и только по взаимному согласию сторон.\r\n\r\nЗапрос на раскрытие информации об уязвимости должен быть подан через интерфейс HackerOne. Раскрытие информации об уязвимости, в том числе частичное, до раскрытия уязвимости в HackerOne не разрешается.\r\n\r\n> **Примечание**\r\n>\r\n> Любая конфиденциальная информация, случайно полученная в ходе поиска уязвимостей или демонстрации, не должна раскрываться. Эта информация включает (но не ограничивается) сведения об инфраструктуре, интерфейсах и деталях реализации, внутреннюю документацию, исходный код, данные пользователей и сотрудников.\r\n> Преднамеренный доступ к этой информации строго запрещен.", 
    "can_view_hacktivity": true, 
    "has_cover_photo": false, 
    "total_bounties_paid": null, 
    "policy_markdown": "<h1 id=\"rbkmoney-vulnerability-disclosure-program-policy\">RBKmoney Vulnerability Disclosure Program policy</h1>\n\n<p>If you found a security vulnerability at any of RBKmoney services, let us know. We will review all legitimate reports and do our best to quickly fix the issue. Before reporting vulnerability, check out the materials on this page including information disclosure policy and vulnerabilities that should not be reported.</p>\n\n<h2 id=\"program-scope-and-terms\">Program scope and terms</h2>\n\n<p>The Program&#39;s scope involves the following RBKmoney domains (сheck out the exceptions):</p>\n<pre class=\"highlight plaintext\"><code>*.rbk.money\n*.rbkmoney.st\n*.rbk.mn\n*.rbkmoney.net\nrbkmoney.com\n</code></pre>\n<p>If you are unsure whether a service is eligible for Program or not, feel free to ask us.</p>\n\n<blockquote>\n<p><strong>Note</strong> </p>\n\n<ul>\n<li>Use your own test accounts for vulnerability research. Do not interact with other accounts without their owner permission.</li>\n<li>Avoid breach of data confidentiality.</li>\n<li>Do not use discovered vulnerabilities for your own benefit. This includes demonstrating additional risks, attempting to disclose confidential data or finding other problems.</li>\n<li>Do not use any vulnerability testing tools that automatically generate very significant volumes of traffic.</li>\n<li>Do not perform any attack that could harm the reliability / integrity of our services or data (denial-of-service attacks, etc.).</li>\n<li>Do not try sneaking into RBKmoney offices and data centers.</li>\n<li>Do not perform spamming and social engineering attacks against our clients and employees and do not carry out other similarly questionable things.</li>\n</ul>\n</blockquote>\n\n<h3 id=\"qualifying-vulnerabilities\">Qualifying vulnerabilities</h3>\n\n<p>Any design or implementation vulnerability that substantially affects the confidentiality or integrity of data is likely to be in scope for the Program. Common examples include:</p>\n\n<ul>\n<li>server-side code execution vulnerabilities</li>\n<li>authentication or authorization vulnerabilities</li>\n<li>business logic vulnerabilities</li>\n<li>cross-site request forgery</li>\n<li>cross-site scripting</li>\n</ul>\n\n<h3 id=\"non-qualifying-vulnerabilities\">Non-qualifying vulnerabilities</h3>\n\n<p>Scope of the Program is limited to <strong>technical</strong> vulnerabilities in our services and web applications.</p>\n\n<h4 id=\"we-do-not-accept-and-review-reports-generated-by-automated-vulnerability-scanners-and-reports-of\">We do not accept and review reports generated by automated vulnerability scanners and reports of:</h4>\n\n<ul>\n<li>CSRF for non-significant actions (logout, etc.)</li>\n<li>Self-XSS without demonstration of real security impact for users or system</li>\n<li>framing and clickjacking vulnerabilities without a documented series of clicks that produce a real security impact</li>\n<li>lack of security mechanism / inconsistency with best practices without demonstration of real security impact</li>\n<li>not enforced SSL/TLS, use of insecure SSL/TLS ciphers</li>\n<li>attacks which require full access to passwords, tokens, browser profile or local system</li>\n<li>non-sensitive information disclosure (such as product or protocol version)</li>\n<li>bugs that don’t affect the latest version of modern browsers and bugs related to browser extensions</li>\n<li>vulnerabilities that only affect users with specific browsers</li>\n<li>attacks requiring exceedingly unlikely user interaction</li>\n<li>denial-of-service attacks or vulnerabilities related to rate limiting</li>\n<li>timing attacks, that prove the existence of a user account, etc.</li>\n<li>insecure cookie settings for non-sensitive cookies</li>\n<li>bugs in content / services that are not owned or operated by RBKmoney (include third party services operating on our subdomains)</li>\n<li>vulnerabilities that RBKmoney determines to be an accepted risk</li>\n<li>scripting or other automation, brute forcing of intended functionality and parameters (include invoice, url-shortener payment link brute forcing, etc.)</li>\n<li>phishing related issues (like text injection, available similar domains, etc.)</li>\n<li>weak password policy</li>\n</ul>\n\n<h2 id=\"vulnerability-report-requirements\">Vulnerability report requirements</h2>\n\n<p>By submitting a bug report you agree to comply with RBKmoney information disclosure policy.</p>\n\n<p>A bug report must contain a detailed description of the discovered vulnerability:</p>\n\n<ul>\n<li>vulnerable hosts and components</li>\n<li>discovered vulnerability and security impact</li>\n<li>reproduction steps</li>\n<li>attack scenario</li>\n<li>recommendations for remediation </li>\n</ul>\n\n<p>Reproduction steps describes the exploitation process required, step-by-step, in the proper order.</p>\n\n<p>Attack scenario describes details about how an attacker would use the bug you are submitting, any necessary conditions for it to work, and what the attacker would gain through a successful attack.</p>\n\n<p>Reports that clearly and concisely identify the affected component, present a well-developed attack scenario, and include clear reproduction steps, will get triaged much faster.</p>\n\n<p>We accept reports in Russian and English.</p>\n\n<h2 id=\"reward-policy\">Reward policy</h2>\n\n<p>Currently we not provide awards according to HackerOne Vulnerability Disclosure Program (VDP) rules.</p>\n\n<h2 id=\"information-disclosure-policy\">Information disclosure policy</h2>\n\n<p>Vulnerability details should be disclosed only in accordance with <a href=\"https://www.hackerone.com/disclosure-guidelines\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>HackerOne disclosure guidelines</span><i class=\"icon-external-link\"></i></a> and RBKmoney vulnerability disclosure program policy.</p>\n\n<p>Public or private disclosure of the details of any vulnerability found on RBKmoney is allowed 90 days after vulnerability is fixed and only by mutual agreement of the parties.</p>\n\n<p>Request for vulnerability disclosure should be filed via HackerOne report interface. No vulnerability disclosure, including partial is allowed before vulnerability is disclosed on HackerOne.</p>\n\n<blockquote>\n<p><strong>Note</strong></p>\n\n<p>Any sensitive information accidently obtained during vulnerability research or demonstration should not be disclosed. This information includes (but not limited to) infrastructure and implementation details, internal documentation and interfaces, source code, user’s and employee’s data. <br>\nIntentional access to this information is strictly prohibited.</p>\n</blockquote>\n\n<hr>\n\n<h1 id=\"rbkmoney\">Политика программы раскрытия уязвимостей RBKmoney</h1>\n\n<p>Если вы нашли уязвимости безопасности в сервисах RBKmoney, сообщите нам об этом. Мы рассматриваем все легитимные отчеты и делаем все возможное, чтобы максимально быстро устранить уязвимость. Прежде чем сообщать об уязвимости, ознакомьтесь с материалами на этой странице, включая политику раскрытия информации и уязвимости, о которых не следует сообщать.</p>\n\n<h2 id=\"part-8b73ffa515cd9368\">Условия и область действия Программы</h2>\n\n<p>В область действия Программы входят следующие домены RBKmoney (ознакомьтесь с исключениями):</p>\n<pre class=\"highlight plaintext\"><code>*.rbk.money\n*.rbkmoney.st\n*.rbk.mn\n*.rbkmoney.net\nrbkmoney.com\n</code></pre>\n<p>Если вы обнаружите уязвимость, которая не касается перечисленных выше доменов, мы исследуем ее. Если вы не уверены в том, участвует сервис в Программе или нет, не стесняйтесь спрашивать нас.</p>\n\n<blockquote>\n<p><strong>Примечание</strong> </p>\n\n<ul>\n<li>Используйте свои собственные тестовые учетные записи для поиска уязвимостей. Не взаимодействуйте с другими учетными записями без разрешения их владельцев.</li>\n<li>Избегайте нарушения конфиденциальности данных.</li>\n<li>Не используйте обнаруженную уязвимость для своей собственной выгоды. Сюда входит демонстрация дополнительных рисков, попытка раскрыть конфиденциальные данные или найти другие уязвимости.</li>\n<li>Не используйте инструменты тестирования уязвимостей, которые автоматически генерируют значительные объемы трафика.</li>\n<li>Не выполняйте атаки, которые могут нанести вред надежности / целостности наших служб или данных (атаки типа «отказ в обслуживании» и другие).</li>\n<li>Не пытайтесь проникнуть в офисы и центры обработки данных RBKmoney.</li>\n<li>Не осуществляйте рассылку спама и атаки социальной инженерии на наших клиентов и сотрудников, а также не делайте другие сомнительные вещи.</li>\n</ul>\n</blockquote>\n\n<h3 id=\"part-e3b10f98d9a30383\">Квалифицируемые уязвимости</h3>\n\n<p>Любая уязвимость дизайна или реализации, которая существенно влияет на конфиденциальность или целостность данных, вероятно, будет участвовать в Программе. Общие примеры включают:</p>\n\n<ul>\n<li>удаленное исполнение кода на стороне сервера</li>\n<li>уязвимости в реализации протоколов аутентификации или авторизации</li>\n<li>уязвимости бизнес-логики</li>\n<li>CSRF-уязвимости</li>\n<li>XSS-уязвимости</li>\n</ul>\n\n<h3 id=\"part-f94a22325b90f15\">Неквалифицируемые уязвимости</h3>\n\n<p>Область действия программы ограничена исключительно <strong>техническими</strong> уязвимостями в наших сервисах и веб-приложениях.</p>\n\n<h4 id=\"part-8ab61347d88260da\">Мы не принимаем и не рассматриваем отчеты, сгенерированные автоматическими сканерами уязвимостей, а также отчеты о:</h4>\n\n<ul>\n<li>CSRF-уязвимостях для некритичных действий (logout и другие)</li>\n<li>уязвимостях типа Self-XSS без демонстрации реального воздействия на безопасность пользователей или систем</li>\n<li>framing и clickjacking-уязвимостях без документированной серии кликов, подтверждающей существование уязвимости</li>\n<li>отсутствии механизма безопасности / несоответствии лучшим практикам без демонстрации реального воздействия на безопасность пользователей или систем</li>\n<li>отсутствии SSL/TLS, использовании небезопасных шифров SSL/TLS</li>\n<li>атаках, требующих полного доступа к паролям, токенам, профилю браузера или локальной системе</li>\n<li>раскрытии некритичной информации (такой как версия продукта, протокола и т.д.)</li>\n<li>ошибках, которые не затрагивают последние версии современных браузеров и ошибках, связанных с расширениями браузеров</li>\n<li>уязвимостях, которые затрагивают только пользователей с определенными браузерами</li>\n<li>атаках, требующих чрезвычайно маловероятного пользовательского взаимодействия</li>\n<li>атаках типа «отказ в обслуживании» или уязвимостях, связанных с ограничением частоты запросов</li>\n<li>временных атаках, которые доказывают существование учетной записи пользователя и т.п.</li>\n<li>небезопасных настройках cookie для некритичных cookie</li>\n<li>ошибках в содержании / сервисах, которые не принадлежат или не управляются RBKmoney (сюда входят сторонние службы, работающие на субдоменах)</li>\n<li>уязвимостях, которые RBKmoney определяет как уязвимости с приемлемым уровнем риска</li>\n<li>скриптинге или другой автоматизации, переборе предполагаемой функциональности и параметров (например, идентификатора счета, платежных ссылок в сервисе rbk.mn)</li>\n<li>вопросах, связанных с фишингом (например, инъекция текста, доступные похожие домены, и т.д.)</li>\n<li>слабой парольной политике</li>\n</ul>\n\n<h2 id=\"part-8292128984a78003\">Требования к отчетам об уязвимостях</h2>\n\n<p>Предоставляя отчет об уязвимостях, вы соглашаетесь соблюдать политику раскрытия информации RBKmoney.</p>\n\n<p>Отчет должен содержать подробное описание обнаруженной уязвимости:</p>\n\n<ul>\n<li>уязвимые узлы и компоненты</li>\n<li>обнаруженная уязвимость и ее влияние на безопасность</li>\n<li>этапы воспроизведения</li>\n<li>сценарий атаки</li>\n<li>рекомендации по устранению</li>\n</ul>\n\n<p>Этапы воспроизведения описывают процесс эксплуатации уязвимости, шаг за шагом, в правильном порядке.</p>\n\n<p>В сценарии атаки описывается информация о том, как злоумышленник может использовать обнаруженную вами уязвимость, необходимые условия для ее эксплуатации и то, что атакующий может получить в случае успешной атаки.</p>\n\n<p>Отчеты, которые четко и лаконично идентифицируют затронутый компонент, описывают хорошо разработанный сценарий атаки и включают четкие этапы воспроизведения, рассматриваются намного быстрее.</p>\n\n<p>Мы предпочитаем получать отчеты на русском или английском языке.</p>\n\n<h2 id=\"part-20e7e0dba2606c36\">Политика вознаграждения</h2>\n\n<p>В настоящий момент мы не осуществляем выплату вознаграждения за найденные уязвимости в соответствии с правилами HackerOne Vulnerability disclosure program (VDP).</p>\n\n<h2 id=\"part-752d6b7c865bd02b\">Политика раскрытия информации</h2>\n\n<p>Информация об уязвимостях может раскрываться только в соответствии с <a href=\"https://www.hackerone.com/disclosure-guidelines\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>HackerOne disclosure guidelines</span><i class=\"icon-external-link\"></i></a> и политикой настоящей Программы.</p>\n\n<p>Публичное или частное раскрытие сведений о любой уязвимости, обнаруженной в RBKmoney, разрешено через 90 дней после устранения уязвимости и только по взаимному согласию сторон.</p>\n\n<p>Запрос на раскрытие информации об уязвимости должен быть подан через интерфейс HackerOne. Раскрытие информации об уязвимости, в том числе частичное, до раскрытия уязвимости в HackerOne не разрешается.</p>\n\n<blockquote>\n<p><strong>Примечание</strong></p>\n\n<p>Любая конфиденциальная информация, случайно полученная в ходе поиска уязвимостей или демонстрации, не должна раскрываться. Эта информация включает (но не ограничивается) сведения об инфраструктуре, интерфейсах и деталях реализации, внутреннюю документацию, исходный код, данные пользователей и сотрудников.<br>\nПреднамеренный доступ к этой информации строго запрещен.</p>\n</blockquote>\n", 
    "show_mean_first_response_time": false, 
    "can_invite_team_member": false, 
    "researcher_count": 23, 
    "can_view_insights": true, 
    "show_mean_report_triage_time": false, 
    "top_bounty_upper_range": null, 
    "name": "RBKmoney", 
    "submission_state": "open", 
    "url": "https://hackerone.com/rbkmoney", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": null, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}