{
    "twitter_handle": "", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": true, 
    "policy_html": "<h1 id=\"introduction\">Introduction</h1>\n\n<p>Shopify&#39;s whitehat program is our way to reward security researchers for finding serious security vulnerabilities in the <code>In Scope</code> properties listed at the bottom of this page, including our core application (all functionality associated with a Shopify store, particularly <code>your-store.myshopify.com/admin</code>) and certain ancillary applications.</p>\n\n<p>We look forward to working with all security researchers and strive to be respectful, always assume the best and treat others as peers. We expect the same in return from all participants. To achieve this, our team strives to:</p>\n\n<ul>\n<li>Reply to all reports within one business day and triage within two business days (if applicable)</li>\n<li>Determine security impacts transparently</li>\n<li>Award bounties within a week of resolution (excluding extenuating circumstances)</li>\n<li>Only close reports as <code>N/A</code> when the issue reported is included in <code>Known Issues</code>, <code>Ineligible Vulnerabilities Types</code> or lacks evidence of a vulnerability</li>\n</ul>\n\n<p><strong>All valid vulnerabilities will be awarded our minimum amount, $500, on triage with the remainder awarded on resolution.</strong> </p>\n\n<h1 id=\"accounts\">Accounts</h1>\n\n<p>We encourage security researchers to sign up for a whitehat partner account, which allows you to create shops and private Shopify apps for testing within the program guidelines, <a title=\"https://app.shopify.com/services/partners/signup/whitehat\" href=\"https://app.shopify.com/services/partners/signup/whitehat\" rel=\"nofollow noopener noreferrer\"><span>https://app.shopify.com/services/partners/signup/whitehat</span><i class=\"icon-external-link\"></i></a>. </p>\n\n<p>You must use a whitehat partner account to create shops for testing or <strong>use your HackerOne email address, YOURHANDLE @ wearehackerone.com (e.g. hackerjuan @ wearehackerone.com) so we can properly identify your shop</strong>. Doing so may also give you access to new features on your shop before the feature is fully released.</p>\n\n<h1 id=\"eligibility\">Eligibility</h1>\n\n<p>The scope of the whitehat program is limited to the domains listed at the bottom of this page. <strong>Valid vulnerabilities on any domain not explicitly listed in scope will be accepted but are ineligible for a reward.</strong> For example, vulnerabilities on any Shopify owned app or channel not listed below will not be awarded a bounty unless impact on Shopify core can be demonstrated. Vulnerabilities found in Shopify third party apps should be reported to the responsible developer. You should only report vulnerabilities in Shopify third party apps to Shopify under this program if you do not receive a satisfactory response from the responsible developer.</p>\n\n<p>All software components that are used within the Shopify application may be exploited in your attack, including bugs in the Liquid templating engine, its C performance extension, the Ruby interpreter (MRI), the Ruby on Rails framework, as well as third party libraries that we use (such as Ruby gems). Please note that bugs in third party components only qualify if you can prove that they can be used to successfully attack Shopify. Only original reports will be rewarded.</p>\n\n<p>If you need further clarification of the rules or scope of our bug bounty program, you may email us at <a title=\"bugbounty@shopify.com\" href=\"mailto:bugbounty@shopify.com\" rel=\"nofollow noopener noreferrer\">bugbounty@shopify.com</a>.</p>\n\n<h1 id=\"typical-bounty-amounts\">Typical Bounty Amounts</h1>\n\n<p>In most cases, we will <strong>only</strong> reward the type of vulnerabilities that are listed below. These payouts represent the typical amount awarded per category and we reserve the right to decrease or increase any of them based on our own assessment of impact. Bounty amounts for any vulnerability type not listed below will be determined on a case by case basis at the sole discretion of Shopify.</p>\n\n<p><em>Prior bounty amounts awarded are not precedent for future payments.</em></p>\n\n<table>\n<thead>\n<tr>\n<th>Type</th>\n<th>Shopify Core*</th>\n<th>Non-Core**</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Arbitrary code execution</td>\n<td>$10,000 - $25,000</td>\n<td>$2,500 - $12,500</td>\n</tr>\n<tr>\n<td>SQL Injection</td>\n<td>$10,000 - $20,000</td>\n<td>$2,500 - $10,000</td>\n</tr>\n<tr>\n<td>Privilege escalation to shop owner</td>\n<td>$5,000 - $15,000</td>\n<td>$2,000 - $7,500</td>\n</tr>\n<tr>\n<td>Authentication bypass - login</td>\n<td>$5,000 - $10,000</td>\n<td>$2,000 - $5,000</td>\n</tr>\n<tr>\n<td>Authentication bypass - app installation</td>\n<td>$2,500 - $7,500</td>\n<td>$1000 - $3,750</td>\n</tr>\n<tr>\n<td>IDOR / Information Disclosure</td>\n<td>$1,000 - $5,000</td>\n<td>$500 - $2,500</td>\n</tr>\n<tr>\n<td>Circumvention of user permission model</td>\n<td>$500 - $4,000</td>\n<td>$500 - $2,000</td>\n</tr>\n<tr>\n<td>Server side request forgery</td>\n<td>$500 - $4,000</td>\n<td>$500 - $2,000</td>\n</tr>\n<tr>\n<td>Cross-site scripting - stored <strong>(with exceptions below)</strong>\n</td>\n<td>$500 - $5,000</td>\n<td>$500 - $2,500</td>\n</tr>\n<tr>\n<td>Cross-site scripting - reflected <strong>(with exceptions below)</strong>\n</td>\n<td>$500 - $2,500</td>\n<td>$500 - $1,250</td>\n</tr>\n<tr>\n<td>Cross-site scripting - self <strong>(with exceptions below)</strong>\n</td>\n<td>$500</td>\n<td>$500</td>\n</tr>\n<tr>\n<td>Cross-site request forgery</td>\n<td>$500 - $1,500</td>\n<td>$500 - $750</td>\n</tr>\n</tbody>\n</table>\n\n<p><em>Self-XSS will be awarded at our sole discretion based on whether it&#39;s reasonable to believe a Shopify admin could be tricked into executing the payload (e.g., pasting a code snippet into an applicable text field) not covered in the exclusions below.</em></p>\n\n<p><em>Core means your Shopify store front and administrative pages at /admin. It does not include Shopify apps or sales channels.</em></p>\n\n<p><em>Non-core means other in-scope properties not found at YOURSTORE.myshopify.com, including Shopify apps and sales channels, <a title=\"https://apps.shopify.com/collections/made-by-shopify\" href=\"https://apps.shopify.com/collections/made-by-shopify\" rel=\"nofollow noopener noreferrer\"><span>https://apps.shopify.com/collections/made-by-shopify</span><i class=\"icon-external-link\"></i></a></em></p>\n\n<h1 id=\"google-play-bonus\">Google Play Bonus</h1>\n\n<p>Certain vulnerabilities with a working proof of concept on some of our Android mobile app(s) may qualify for an additional bounty through the <a href=\"http://hackerone.com/googleplay\" rel=\"nofollow noopener noreferrer\"><span>Google Play Security Rewards Program</span><i class=\"icon-external-link\"></i></a>. To see which apps and vulnerabilities may qualify for a bounty, please refer to the <a href=\"http://hackerone.com/googleplay\" rel=\"nofollow noopener noreferrer\"><span>Google Play Security Rewards Program’s Scope and Vulnerability Criteria</span><i class=\"icon-external-link\"></i></a>.</p>\n\n<h1 id=\"known-issues\">Known issues</h1>\n\n<p>The following vulnerability types have already been reported and triaged, and won&#39;t be fixed. These issues will be closed as <strong>Not Applicable</strong>:</p>\n\n<ul>\n<li>\n<strong>XSS - Storefront</strong> - Any issue where a store administrator is able to insert javascript in the storefront area of their own store, including the checkout pages.</li>\n<li>\n<strong>XSS - iFrames</strong> - Any issue related to the storefront area being displayed in a <code>&lt;iframe&gt;</code> element in the admin area, for example in the Theme Editor.</li>\n<li>\n<strong>XSS - Rich Text Editor</strong> - Any issue related to execution of javascript in the Rich Text Editor (for example, when editing the description of a product, blog or collection, etc).</li>\n<li>\n<strong>XSS - Shopify CDN</strong> - The Shopify content distribution network (static.shopify.com and cdn.shopify.com) is available for merchants to use, and we encourage our merchants to host anything they want. We will reject any submission where the issue being reported is that a user or store administrator is able to upload arbitrary files to our CDN or execute javascript in the context of a CDN domain.</li>\n<li>\n<strong>Arbitrary file upload - Shopify CDN</strong> - The Shopify content distribution network (static.shopify.com and cdn.shopify.com) is available for merchants to use, and we encourage our merchants to host anything they want. We will reject any submission where the issue being reported is that a user or store administrator is able to upload arbitrary files to our CDN.</li>\n<li><strong>CSRF access to modify cart</strong></li>\n<li><strong>Insecure cookie handling for account identifying cookies</strong></li>\n<li>\n<strong>CSRF for Login or Logout</strong> - Any login / logout CSRF will be ineligible unless it is chained together with another vulnerability to demonstrate impact</li>\n<li><strong>Password reset tokens don’t expire when changing email address</strong></li>\n<li><strong>Email address change doesn’t require verification</strong></li>\n<li><strong>Tab nabbing</strong></li>\n<li><strong>Issues with the SPF, DKIM or DMARC records on shopify.com or other Shopify domains (sometimes reported as email spoofing)</strong></li>\n<li><strong>Insecure “Opening Soon” password</strong></li>\n<li><strong>Reflected XSS that requires full control of an HTTP header, such as <code>Referer</code>, <code>Host</code>, etc.</strong></li>\n<li><strong>User or store name enumeration</strong></li>\n<li><strong>CSV / formula injection</strong></li>\n<li><strong>Hyperlink injection</strong></li>\n<li>\n<strong>Open redirects</strong> - Unless an additional security impact can be demonstrated, e.g. stealing authentication tokens or XSS</li>\n</ul>\n\n<h1 id=\"ineligible-vulnerability-types\">Ineligible vulnerability types</h1>\n\n<p>Shopify does not consider the following to be eligible vulnerabilities under this program. These issues will be closed as <strong>Not Applicable</strong>:</p>\n\n<ul>\n<li>Denial of Service</li>\n<li>Content spoofing</li>\n<li>Social Engineering, including phishing</li>\n<li>Unconfirmed reports from automated vulnerability scanners</li>\n<li>Disclosure of server or software version numbers</li>\n<li>Generic examples of Host header attacks without evidence of the ability to target a remote victim </li>\n<li>Reports related to permitted password strength </li>\n<li>Lack of mobile binary protection, mobile SSL pinning</li>\n<li>Theoretical sub-domain takeovers with no supporting evidence</li>\n<li>Any issue in a mobile application that can only be exploited on a rooted or jailbroken device, that depends on physical access to the device or debug access being enabled, or that depends on a vulnerability in the operating system</li>\n<li>Perceived security weaknesses without evidence of the ability to target a remote victim. For example credentials are transmitted in POST body as plain text, missing rate limits, bruteforcing without demonstrating impact, etc.</li>\n<li>Reports exploiting the behaviour of, or vulnerabilities in, outdated browsers</li>\n<li>False reports, or reports lacking evidence of a vulnerability</li>\n</ul>\n\n<h1 id=\"rules-for-participation\">Rules for participation</h1>\n\n<p>The following rules must be followed in order for any rewards to be paid:</p>\n\n<ul>\n<li>You may only test against shops you have created which include your HackerOne <code>YOURHANDLE @ wearehackerone.com</code> registered email address.</li>\n<li>You must not attempt to gain access to, or interact with, any shops other than those created by you.</li>\n<li>The use of commercial scanners is prohibited (e.g., Nessus).</li>\n<li>Rules for reporting must be followed.</li>\n<li>Do not disclose any issues publicly before they have been resolved.</li>\n<li>Shopify reserves the right to modify the rules for this program or deem any submissions invalid at any time. Shopify may cancel the whitehat program without notice at any time.</li>\n<li>Contacting Shopify Support over chat, email or phone about your HackerOne report is not allowed. We may disqualify you from receiving a reward, or from participating in the program altogether.</li>\n<li>You are not an employee of Shopify; employees should report bugs to the internal bug bounty program.</li>\n<li>You hereby represent, warrant and covenant that any content you submit to Shopify is an original work of authorship and that you are legally entitled to grant the rights and privileges conveyed by these terms. You further represent, warrant and covenant that the consent of no other person or entity is or will be necessary for Shopify to use the submitted content.</li>\n<li>By submitting content to Shopify, you irrevocably waive all moral rights which you may have in the content.</li>\n<li>All content submitted by you to Shopify under this program is licensed under the MIT License. </li>\n<li>You must report any discovered vulnerability to Shopify as soon as you have validated the vulnerability.</li>\n<li>Failure to follow any of the foregoing rules will disqualify you from participating in this program.</li>\n</ul>\n\n<h1 id=\"miscellaneous\">Miscellaneous</h1>\n\n<p>This program is not open to minors, individuals who are on sanctions lists, or who are in countries (e.g. Cuba, Iran, North Korea, Sudan and Syria) on sanctions lists. You are responsible for any tax implications resulting from payouts depending on your country of residency and citizenship. Shopify reserves the right to cancel this program at any time and the decision to pay a bounty is entirely at our discretion. Your testing and submission must not violate any law, or disrupt or compromise any data that is not your own. There may be additional restrictions on your ability to submit content or receive a bounty depending on your local laws.</p>\n\n<p>Shopify considers activities conducted consistent with this program to constitute “authorized” conduct under the Computer Fraud and Abuse Act. If legal action is initiated by a third party against you and you have fully complied with this program, Shopify will take steps to make it known, either to the public or to the court, that your actions were conducted in compliance with the Shopify policy.</p>\n\n<p>Upon Shopify’s request, you will execute, acknowledge and delivery such further instruments, and will otherwise cooperate and do all other acts as may be necessary or appropriate in order to perfect or carry out the purpose and intent of these terms.</p>\n\n<h1 id=\"product-update-news\">Product Update News</h1>\n\n<p>For our newest product updates, keep an eye on our blog under <a href=\"https://www.shopify.ca/blog/topics/product-updates\" rel=\"nofollow noopener noreferrer\"><span>Product Updates</span><i class=\"icon-external-link\"></i></a> and our Partners Blog under <a href=\"https://www.shopify.ca/partners/blog/topics/shopify-news\" rel=\"nofollow noopener noreferrer\"><span>Shopify News</span><i class=\"icon-external-link\"></i></a>.</p>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "show_mean_bounty_time": true, 
    "total_bounties_paid_prefix": null, 
    "awards_miles": false, 
    "average_bounty_upper_range": 500.0, 
    "top_bounty_lower_range": 1000.0, 
    "anc_enabled": null, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "show_average_bounty": true, 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2018-10-02T14:32:29.860Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2015-04-09T18:44:14.695Z", 
    "bug_count": 558, 
    "mean_time_to_bounty": 338400, 
    "offers_swag": true, 
    "offers_bounties": true, 
    "id": 1382, 
    "mean_time_to_resolution": 1825200, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/001/382/1e9872bf9cfe04008c2673e07bfecaa83858cca1_small.jpg?1532728703", 
        "large": "https://profile-photos.hackerone-user-content.com/000/001/382/ad82a3fd600ffe6664301910bb67eb726e9fb0ea_large.jpg?1532728703", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/001/382/ee74dd46d33fd87c556957ca0045b99559b967d5_xtralarge.jpg?1532728703"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "show_top_bounties": true, 
    "target_signal": -10, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "https://www.shopify.com", 
        "about": "Shopify is a multi-channel commerce platform that helps people sell online, in-store, and everywhere in between.", 
        "twitter_handle": "", 
        "name": "Shopify"
    }, 
    "scopes": [], 
    "handle": "shopify", 
    "cover_color": "#5C6AC4", 
    "mean_time_to_first_response": 43200, 
    "average_bounty_lower_range": 500.0, 
    "response_efficiency_percentage": 100, 
    "policy": "# Introduction\r\nShopify's whitehat program is our way to reward security researchers for finding serious security vulnerabilities in the `In Scope` properties listed at the bottom of this page, including our core application (all functionality associated with a Shopify store, particularly `your-store.myshopify.com/admin`) and certain ancillary applications.\r\n\r\nWe look forward to working with all security researchers and strive to be respectful, always assume the best and treat others as peers. We expect the same in return from all participants. To achieve this, our team strives to:\r\n- Reply to all reports within one business day and triage within two business days (if applicable)\r\n- Determine security impacts transparently\r\n- Award bounties within a week of resolution (excluding extenuating circumstances)\r\n- Only close reports as `N/A` when the issue reported is included in `Known Issues`, `Ineligible Vulnerabilities Types` or lacks evidence of a vulnerability\r\n\r\n**All valid vulnerabilities will be awarded our minimum amount, $500, on triage with the remainder awarded on resolution.** \r\n\r\n# Accounts\r\nWe encourage security researchers to sign up for a whitehat partner account, which allows you to create shops and private Shopify apps for testing within the program guidelines, https://app.shopify.com/services/partners/signup/whitehat. \r\n\r\nYou must use a whitehat partner account to create shops for testing or **use your HackerOne email address, YOURHANDLE @ wearehackerone.com (e.g. hackerjuan @ wearehackerone.com) so we can properly identify your shop**. Doing so may also give you access to new features on your shop before the feature is fully released.\r\n\r\n# Eligibility\r\nThe scope of the whitehat program is limited to the domains listed at the bottom of this page. **Valid vulnerabilities on any domain not explicitly listed in scope will be accepted but are ineligible for a reward.** For example, vulnerabilities on any Shopify owned app or channel not listed below will not be awarded a bounty unless impact on Shopify core can be demonstrated. Vulnerabilities found in Shopify third party apps should be reported to the responsible developer. You should only report vulnerabilities in Shopify third party apps to Shopify under this program if you do not receive a satisfactory response from the responsible developer.\r\n\r\nAll software components that are used within the Shopify application may be exploited in your attack, including bugs in the Liquid templating engine, its C performance extension, the Ruby interpreter (MRI), the Ruby on Rails framework, as well as third party libraries that we use (such as Ruby gems). Please note that bugs in third party components only qualify if you can prove that they can be used to successfully attack Shopify. Only original reports will be rewarded.\r\n\r\nIf you need further clarification of the rules or scope of our bug bounty program, you may email us at bugbounty@shopify.com.\r\n\r\n# Typical Bounty Amounts \r\n\r\nIn most cases, we will **only** reward the type of vulnerabilities that are listed below. These payouts represent the typical amount awarded per category and we reserve the right to decrease or increase any of them based on our own assessment of impact. Bounty amounts for any vulnerability type not listed below will be determined on a case by case basis at the sole discretion of Shopify.\r\n\r\n*Prior bounty amounts awarded are not precedent for future payments.*\r\n\r\nType | Shopify Core* | Non-Core**\r\n--- | --- | ---\r\nArbitrary code execution | $10,000 - $25,000 | $2,500 - $12,500\r\nSQL Injection | $10,000 - $20,000 | $2,500 - $10,000\r\nPrivilege escalation to shop owner | $5,000 - $15,000 | $2,000 - $7,500\r\nAuthentication bypass - login | $5,000 - $10,000 | $2,000 - $5,000\r\nAuthentication bypass - app installation | $2,500 - $7,500 | $1000 - $3,750\r\nIDOR / Information Disclosure | $1,000 - $5,000 | $500 - $2,500\r\nCircumvention of user permission model | $500 - $4,000 | $500 - $2,000\r\nServer side request forgery | $500 - $4,000 | $500 - $2,000\r\nCross-site scripting - stored **(with exceptions below)** | $500 - $5,000 | $500 - $2,500\r\nCross-site scripting - reflected **(with exceptions below)**| $500 - $2,500 | $500 - $1,250\r\nCross-site scripting - self **(with exceptions below)**| $500 | $500\r\nCross-site request forgery | $500 - $1,500 | $500 - $750\r\n\r\n*Self-XSS will be awarded at our sole discretion based on whether it's reasonable to believe a Shopify admin could be tricked into executing the payload (e.g., pasting a code snippet into an applicable text field) not covered in the exclusions below.*\r\n\r\n*Core means your Shopify store front and administrative pages at /admin. It does not include Shopify apps or sales channels.*\r\n\r\n*Non-core means other in-scope properties not found at YOURSTORE.myshopify.com, including Shopify apps and sales channels, https://apps.shopify.com/collections/made-by-shopify*\r\n\r\n# Google Play Bonus\r\n\r\nCertain vulnerabilities with a working proof of concept on some of our Android mobile app(s) may qualify for an additional bounty through the [Google Play Security Rewards Program](hackerone.com/googleplay). To see which apps and vulnerabilities may qualify for a bounty, please refer to the [Google Play Security Rewards Program’s Scope and Vulnerability Criteria](hackerone.com/googleplay).\r\n\r\n# Known issues \r\n\r\nThe following vulnerability types have already been reported and triaged, and won't be fixed. These issues will be closed as **Not Applicable**:\r\n\r\n- **XSS - Storefront** - Any issue where a store administrator is able to insert javascript in the storefront area of their own store, including the checkout pages.\r\n- **XSS - iFrames** - Any issue related to the storefront area being displayed in a `<iframe>` element in the admin area, for example in the Theme Editor.\r\n- **XSS - Rich Text Editor** - Any issue related to execution of javascript in the Rich Text Editor (for example, when editing the description of a product, blog or collection, etc).\r\n- **XSS - Shopify CDN** - The Shopify content distribution network (static.shopify.com and cdn.shopify.com) is available for merchants to use, and we encourage our merchants to host anything they want. We will reject any submission where the issue being reported is that a user or store administrator is able to upload arbitrary files to our CDN or execute javascript in the context of a CDN domain.\r\n- **Arbitrary file upload - Shopify CDN** - The Shopify content distribution network (static.shopify.com and cdn.shopify.com) is available for merchants to use, and we encourage our merchants to host anything they want. We will reject any submission where the issue being reported is that a user or store administrator is able to upload arbitrary files to our CDN.\r\n- **CSRF access to modify cart**\r\n- **Insecure cookie handling for account identifying cookies**\r\n- **CSRF for Login or Logout** - Any login / logout CSRF will be ineligible unless it is chained together with another vulnerability to demonstrate impact\r\n- **Password reset tokens don’t expire when changing email address**\r\n- **Email address change doesn’t require verification**\r\n- **Tab nabbing**\r\n- **Issues with the SPF, DKIM or DMARC records on shopify.com or other Shopify domains (sometimes reported as email spoofing)**\r\n- **Insecure “Opening Soon” password**\r\n- **Reflected XSS that requires full control of an HTTP header, such as `Referer`, `Host`, etc.**\r\n- **User or store name enumeration**\r\n- **CSV / formula injection**\r\n- **Hyperlink injection**\r\n- **Open redirects** - Unless an additional security impact can be demonstrated, e.g. stealing authentication tokens or XSS\r\n\r\n# Ineligible vulnerability types\r\nShopify does not consider the following to be eligible vulnerabilities under this program. These issues will be closed as **Not Applicable**:\r\n\r\n- Denial of Service\r\n- Content spoofing\r\n- Social Engineering, including phishing\r\n- Unconfirmed reports from automated vulnerability scanners\r\n- Disclosure of server or software version numbers\r\n- Generic examples of Host header attacks without evidence of the ability to target a remote victim \r\n- Reports related to permitted password strength \r\n- Lack of mobile binary protection, mobile SSL pinning\r\n- Theoretical sub-domain takeovers with no supporting evidence\r\n- Any issue in a mobile application that can only be exploited on a rooted or jailbroken device, that depends on physical access to the device or debug access being enabled, or that depends on a vulnerability in the operating system\r\n- Perceived security weaknesses without evidence of the ability to target a remote victim. For example credentials are transmitted in POST body as plain text, missing rate limits, bruteforcing without demonstrating impact, etc.\r\n- Reports exploiting the behaviour of, or vulnerabilities in, outdated browsers\r\n- False reports, or reports lacking evidence of a vulnerability\r\n\r\n# Rules for participation\r\nThe following rules must be followed in order for any rewards to be paid:\r\n- You may only test against shops you have created which include your HackerOne `YOURHANDLE @ wearehackerone.com` registered email address.\r\n- You must not attempt to gain access to, or interact with, any shops other than those created by you.\r\n- The use of commercial scanners is prohibited (e.g., Nessus).\r\n- Rules for reporting must be followed.\r\n- Do not disclose any issues publicly before they have been resolved.\r\n- Shopify reserves the right to modify the rules for this program or deem any submissions invalid at any time. Shopify may cancel the whitehat program without notice at any time.\r\n- Contacting Shopify Support over chat, email or phone about your HackerOne report is not allowed. We may disqualify you from receiving a reward, or from participating in the program altogether.\r\n- You are not an employee of Shopify; employees should report bugs to the internal bug bounty program.\r\n- You hereby represent, warrant and covenant that any content you submit to Shopify is an original work of authorship and that you are legally entitled to grant the rights and privileges conveyed by these terms. You further represent, warrant and covenant that the consent of no other person or entity is or will be necessary for Shopify to use the submitted content.\r\n- By submitting content to Shopify, you irrevocably waive all moral rights which you may have in the content.\r\n- All content submitted by you to Shopify under this program is licensed under the MIT License. \r\n- You must report any discovered vulnerability to Shopify as soon as you have validated the vulnerability.\r\n- Failure to follow any of the foregoing rules will disqualify you from participating in this program.\r\n\r\n# Miscellaneous\r\n\r\nThis program is not open to minors, individuals who are on sanctions lists, or who are in countries (e.g. Cuba, Iran, North Korea, Sudan and Syria) on sanctions lists. You are responsible for any tax implications resulting from payouts depending on your country of residency and citizenship. Shopify reserves the right to cancel this program at any time and the decision to pay a bounty is entirely at our discretion. Your testing and submission must not violate any law, or disrupt or compromise any data that is not your own. There may be additional restrictions on your ability to submit content or receive a bounty depending on your local laws.\r\n\r\nShopify considers activities conducted consistent with this program to constitute “authorized” conduct under the Computer Fraud and Abuse Act. If legal action is initiated by a third party against you and you have fully complied with this program, Shopify will take steps to make it known, either to the public or to the court, that your actions were conducted in compliance with the Shopify policy.\r\n\r\nUpon Shopify’s request, you will execute, acknowledge and delivery such further instruments, and will otherwise cooperate and do all other acts as may be necessary or appropriate in order to perfect or carry out the purpose and intent of these terms.\r\n\r\n#  Product Update News\r\nFor our newest product updates, keep an eye on our blog under [Product Updates](https://www.shopify.ca/blog/topics/product-updates) and our Partners Blog under [Shopify News](https://www.shopify.ca/partners/blog/topics/shopify-news).", 
    "can_view_hacktivity": true, 
    "base_bounty": 500, 
    "has_cover_photo": false, 
    "total_bounties_paid": 370450.0, 
    "policy_markdown": "<h1 id=\"introduction\">Introduction</h1>\n\n<p>Shopify&#39;s whitehat program is our way to reward security researchers for finding serious security vulnerabilities in the <code>In Scope</code> properties listed at the bottom of this page, including our core application (all functionality associated with a Shopify store, particularly <code>your-store.myshopify.com/admin</code>) and certain ancillary applications.</p>\n\n<p>We look forward to working with all security researchers and strive to be respectful, always assume the best and treat others as peers. We expect the same in return from all participants. To achieve this, our team strives to:</p>\n\n<ul>\n<li>Reply to all reports within one business day and triage within two business days (if applicable)</li>\n<li>Determine security impacts transparently</li>\n<li>Award bounties within a week of resolution (excluding extenuating circumstances)</li>\n<li>Only close reports as <code>N/A</code> when the issue reported is included in <code>Known Issues</code>, <code>Ineligible Vulnerabilities Types</code> or lacks evidence of a vulnerability</li>\n</ul>\n\n<p><strong>All valid vulnerabilities will be awarded our minimum amount, $500, on triage with the remainder awarded on resolution.</strong> </p>\n\n<h1 id=\"accounts\">Accounts</h1>\n\n<p>We encourage security researchers to sign up for a whitehat partner account, which allows you to create shops and private Shopify apps for testing within the program guidelines, <a title=\"https://app.shopify.com/services/partners/signup/whitehat\" href=\"https://app.shopify.com/services/partners/signup/whitehat\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://app.shopify.com/services/partners/signup/whitehat</span><i class=\"icon-external-link\"></i></a>. </p>\n\n<p>You must use a whitehat partner account to create shops for testing or <strong>use your HackerOne email address, YOURHANDLE @ wearehackerone.com (e.g. hackerjuan @ wearehackerone.com) so we can properly identify your shop</strong>. Doing so may also give you access to new features on your shop before the feature is fully released.</p>\n\n<h1 id=\"eligibility\">Eligibility</h1>\n\n<p>The scope of the whitehat program is limited to the domains listed at the bottom of this page. <strong>Valid vulnerabilities on any domain not explicitly listed in scope will be accepted but are ineligible for a reward.</strong> For example, vulnerabilities on any Shopify owned app or channel not listed below will not be awarded a bounty unless impact on Shopify core can be demonstrated. Vulnerabilities found in Shopify third party apps should be reported to the responsible developer. You should only report vulnerabilities in Shopify third party apps to Shopify under this program if you do not receive a satisfactory response from the responsible developer.</p>\n\n<p>All software components that are used within the Shopify application may be exploited in your attack, including bugs in the Liquid templating engine, its C performance extension, the Ruby interpreter (MRI), the Ruby on Rails framework, as well as third party libraries that we use (such as Ruby gems). Please note that bugs in third party components only qualify if you can prove that they can be used to successfully attack Shopify. Only original reports will be rewarded.</p>\n\n<p>If you need further clarification of the rules or scope of our bug bounty program, you may email us at <a title=\"bugbounty@shopify.com\" href=\"mailto:bugbounty@shopify.com\" rel=\"nofollow noopener noreferrer\">bugbounty@shopify.com</a>.</p>\n\n<h1 id=\"typical-bounty-amounts\">Typical Bounty Amounts</h1>\n\n<p>In most cases, we will <strong>only</strong> reward the type of vulnerabilities that are listed below. These payouts represent the typical amount awarded per category and we reserve the right to decrease or increase any of them based on our own assessment of impact. Bounty amounts for any vulnerability type not listed below will be determined on a case by case basis at the sole discretion of Shopify.</p>\n\n<p><em>Prior bounty amounts awarded are not precedent for future payments.</em></p>\n\n<table>\n<thead>\n<tr>\n<th>Type</th>\n<th>Shopify Core*</th>\n<th>Non-Core**</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Arbitrary code execution</td>\n<td>$10,000 - $25,000</td>\n<td>$2,500 - $12,500</td>\n</tr>\n<tr>\n<td>SQL Injection</td>\n<td>$10,000 - $20,000</td>\n<td>$2,500 - $10,000</td>\n</tr>\n<tr>\n<td>Privilege escalation to shop owner</td>\n<td>$5,000 - $15,000</td>\n<td>$2,000 - $7,500</td>\n</tr>\n<tr>\n<td>Authentication bypass - login</td>\n<td>$5,000 - $10,000</td>\n<td>$2,000 - $5,000</td>\n</tr>\n<tr>\n<td>Authentication bypass - app installation</td>\n<td>$2,500 - $7,500</td>\n<td>$1000 - $3,750</td>\n</tr>\n<tr>\n<td>IDOR / Information Disclosure</td>\n<td>$1,000 - $5,000</td>\n<td>$500 - $2,500</td>\n</tr>\n<tr>\n<td>Circumvention of user permission model</td>\n<td>$500 - $4,000</td>\n<td>$500 - $2,000</td>\n</tr>\n<tr>\n<td>Server side request forgery</td>\n<td>$500 - $4,000</td>\n<td>$500 - $2,000</td>\n</tr>\n<tr>\n<td>Cross-site scripting - stored <strong>(with exceptions below)</strong>\n</td>\n<td>$500 - $5,000</td>\n<td>$500 - $2,500</td>\n</tr>\n<tr>\n<td>Cross-site scripting - reflected <strong>(with exceptions below)</strong>\n</td>\n<td>$500 - $2,500</td>\n<td>$500 - $1,250</td>\n</tr>\n<tr>\n<td>Cross-site scripting - self <strong>(with exceptions below)</strong>\n</td>\n<td>$500</td>\n<td>$500</td>\n</tr>\n<tr>\n<td>Cross-site request forgery</td>\n<td>$500 - $1,500</td>\n<td>$500 - $750</td>\n</tr>\n</tbody>\n</table>\n\n<p><em>Self-XSS will be awarded at our sole discretion based on whether it&#39;s reasonable to believe a Shopify admin could be tricked into executing the payload (e.g., pasting a code snippet into an applicable text field) not covered in the exclusions below.</em></p>\n\n<p><em>Core means your Shopify store front and administrative pages at /admin. It does not include Shopify apps or sales channels.</em></p>\n\n<p><em>Non-core means other in-scope properties not found at YOURSTORE.myshopify.com, including Shopify apps and sales channels, <a title=\"https://apps.shopify.com/collections/made-by-shopify\" href=\"https://apps.shopify.com/collections/made-by-shopify\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>https://apps.shopify.com/collections/made-by-shopify</span><i class=\"icon-external-link\"></i></a></em></p>\n\n<h1 id=\"google-play-bonus\">Google Play Bonus</h1>\n\n<p>Certain vulnerabilities with a working proof of concept on some of our Android mobile app(s) may qualify for an additional bounty through the <a href=\"http://hackerone.com/googleplay\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>Google Play Security Rewards Program</span><i class=\"icon-external-link\"></i></a>. To see which apps and vulnerabilities may qualify for a bounty, please refer to the <a href=\"http://hackerone.com/googleplay\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>Google Play Security Rewards Program’s Scope and Vulnerability Criteria</span><i class=\"icon-external-link\"></i></a>.</p>\n\n<h1 id=\"known-issues\">Known issues</h1>\n\n<p>The following vulnerability types have already been reported and triaged, and won&#39;t be fixed. These issues will be closed as <strong>Not Applicable</strong>:</p>\n\n<ul>\n<li>\n<strong>XSS - Storefront</strong> - Any issue where a store administrator is able to insert javascript in the storefront area of their own store, including the checkout pages.</li>\n<li>\n<strong>XSS - iFrames</strong> - Any issue related to the storefront area being displayed in a <code>&lt;iframe&gt;</code> element in the admin area, for example in the Theme Editor.</li>\n<li>\n<strong>XSS - Rich Text Editor</strong> - Any issue related to execution of javascript in the Rich Text Editor (for example, when editing the description of a product, blog or collection, etc).</li>\n<li>\n<strong>XSS - Shopify CDN</strong> - The Shopify content distribution network (static.shopify.com and cdn.shopify.com) is available for merchants to use, and we encourage our merchants to host anything they want. We will reject any submission where the issue being reported is that a user or store administrator is able to upload arbitrary files to our CDN or execute javascript in the context of a CDN domain.</li>\n<li>\n<strong>Arbitrary file upload - Shopify CDN</strong> - The Shopify content distribution network (static.shopify.com and cdn.shopify.com) is available for merchants to use, and we encourage our merchants to host anything they want. We will reject any submission where the issue being reported is that a user or store administrator is able to upload arbitrary files to our CDN.</li>\n<li><strong>CSRF access to modify cart</strong></li>\n<li><strong>Insecure cookie handling for account identifying cookies</strong></li>\n<li>\n<strong>CSRF for Login or Logout</strong> - Any login / logout CSRF will be ineligible unless it is chained together with another vulnerability to demonstrate impact</li>\n<li><strong>Password reset tokens don’t expire when changing email address</strong></li>\n<li><strong>Email address change doesn’t require verification</strong></li>\n<li><strong>Tab nabbing</strong></li>\n<li><strong>Issues with the SPF, DKIM or DMARC records on shopify.com or other Shopify domains (sometimes reported as email spoofing)</strong></li>\n<li><strong>Insecure “Opening Soon” password</strong></li>\n<li><strong>Reflected XSS that requires full control of an HTTP header, such as <code>Referer</code>, <code>Host</code>, etc.</strong></li>\n<li><strong>User or store name enumeration</strong></li>\n<li><strong>CSV / formula injection</strong></li>\n<li><strong>Hyperlink injection</strong></li>\n<li>\n<strong>Open redirects</strong> - Unless an additional security impact can be demonstrated, e.g. stealing authentication tokens or XSS</li>\n</ul>\n\n<h1 id=\"ineligible-vulnerability-types\">Ineligible vulnerability types</h1>\n\n<p>Shopify does not consider the following to be eligible vulnerabilities under this program. These issues will be closed as <strong>Not Applicable</strong>:</p>\n\n<ul>\n<li>Denial of Service</li>\n<li>Content spoofing</li>\n<li>Social Engineering, including phishing</li>\n<li>Unconfirmed reports from automated vulnerability scanners</li>\n<li>Disclosure of server or software version numbers</li>\n<li>Generic examples of Host header attacks without evidence of the ability to target a remote victim </li>\n<li>Reports related to permitted password strength </li>\n<li>Lack of mobile binary protection, mobile SSL pinning</li>\n<li>Theoretical sub-domain takeovers with no supporting evidence</li>\n<li>Any issue in a mobile application that can only be exploited on a rooted or jailbroken device, that depends on physical access to the device or debug access being enabled, or that depends on a vulnerability in the operating system</li>\n<li>Perceived security weaknesses without evidence of the ability to target a remote victim. For example credentials are transmitted in POST body as plain text, missing rate limits, bruteforcing without demonstrating impact, etc.</li>\n<li>Reports exploiting the behaviour of, or vulnerabilities in, outdated browsers</li>\n<li>False reports, or reports lacking evidence of a vulnerability</li>\n</ul>\n\n<h1 id=\"rules-for-participation\">Rules for participation</h1>\n\n<p>The following rules must be followed in order for any rewards to be paid:</p>\n\n<ul>\n<li>You may only test against shops you have created which include your HackerOne <code>YOURHANDLE @ wearehackerone.com</code> registered email address.</li>\n<li>You must not attempt to gain access to, or interact with, any shops other than those created by you.</li>\n<li>The use of commercial scanners is prohibited (e.g., Nessus).</li>\n<li>Rules for reporting must be followed.</li>\n<li>Do not disclose any issues publicly before they have been resolved.</li>\n<li>Shopify reserves the right to modify the rules for this program or deem any submissions invalid at any time. Shopify may cancel the whitehat program without notice at any time.</li>\n<li>Contacting Shopify Support over chat, email or phone about your HackerOne report is not allowed. We may disqualify you from receiving a reward, or from participating in the program altogether.</li>\n<li>You are not an employee of Shopify; employees should report bugs to the internal bug bounty program.</li>\n<li>You hereby represent, warrant and covenant that any content you submit to Shopify is an original work of authorship and that you are legally entitled to grant the rights and privileges conveyed by these terms. You further represent, warrant and covenant that the consent of no other person or entity is or will be necessary for Shopify to use the submitted content.</li>\n<li>By submitting content to Shopify, you irrevocably waive all moral rights which you may have in the content.</li>\n<li>All content submitted by you to Shopify under this program is licensed under the MIT License. </li>\n<li>You must report any discovered vulnerability to Shopify as soon as you have validated the vulnerability.</li>\n<li>Failure to follow any of the foregoing rules will disqualify you from participating in this program.</li>\n</ul>\n\n<h1 id=\"miscellaneous\">Miscellaneous</h1>\n\n<p>This program is not open to minors, individuals who are on sanctions lists, or who are in countries (e.g. Cuba, Iran, North Korea, Sudan and Syria) on sanctions lists. You are responsible for any tax implications resulting from payouts depending on your country of residency and citizenship. Shopify reserves the right to cancel this program at any time and the decision to pay a bounty is entirely at our discretion. Your testing and submission must not violate any law, or disrupt or compromise any data that is not your own. There may be additional restrictions on your ability to submit content or receive a bounty depending on your local laws.</p>\n\n<p>Shopify considers activities conducted consistent with this program to constitute “authorized” conduct under the Computer Fraud and Abuse Act. If legal action is initiated by a third party against you and you have fully complied with this program, Shopify will take steps to make it known, either to the public or to the court, that your actions were conducted in compliance with the Shopify policy.</p>\n\n<p>Upon Shopify’s request, you will execute, acknowledge and delivery such further instruments, and will otherwise cooperate and do all other acts as may be necessary or appropriate in order to perfect or carry out the purpose and intent of these terms.</p>\n\n<h1 id=\"product-update-news\">Product Update News</h1>\n\n<p>For our newest product updates, keep an eye on our blog under <a href=\"https://www.shopify.ca/blog/topics/product-updates\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>Product Updates</span><i class=\"icon-external-link\"></i></a> and our Partners Blog under <a href=\"https://www.shopify.ca/partners/blog/topics/shopify-news\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>Shopify News</span><i class=\"icon-external-link\"></i></a>.</p>\n", 
    "show_mean_first_response_time": true, 
    "show_total_bounties_paid": true, 
    "can_invite_team_member": false, 
    "researcher_count": 330, 
    "number_of_updates": 0, 
    "show_mean_report_triage_time": true, 
    "top_bounty_upper_range": 24500.0, 
    "name": "Shopify", 
    "submission_state": "open", 
    "url": "https://hackerone.com/shopify", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": 43200, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}