{
    "twitter_handle": "", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": true, 
    "policy_html": "<hr>\n\n<h2 id=\"uber-bug-bounty-program-terms\">Uber Bug Bounty Program Terms</h2>\n\n<hr>\n\n<p>The scope for Uber’s Bug Bounty Program is focused on securing the data of our users. Therefore, our approach is to evaluate any given report based on the specific security impact for users (versus domain + vulnerability class). Below we describe the various security impact buckets that are in-scope, examples of vulnerability types, and domains that could potentially have meaningful security impact.<br><br>\nYour participation in our Bug Bounty Program is voluntary.  By submitting a report or otherwise disclosing a vulnerability to us (making a “Submission”), you are indicating that you have read and agree to follow the rules set forth on this page (“Program Terms”).  </p>\n\n<p><strong>Ground Rules</strong></p>\n\n<ul>\n<li>Research and disclose in good faith.</li>\n<li>Respect our users’ privacy.<br>\n</li>\n<li>No extortion, shake downs, or duress.</li>\n<li>Don’t leave any system in a more vulnerable state than you found it.</li>\n<li>Don’t publicly disclose a vulnerability without our consent.</li>\n<li>Be respectful when interacting with our team, and our team will do the same.</li>\n</ul>\n\n<hr>\n\n<h2 id=\"good-faith-vulnerability-research-and-disclosure\">Good Faith Vulnerability Research and Disclosure</h2>\n\n<hr>\n\n<p>You must act in good faith when investigating and reporting vulnerabilities to us.  Acting in good faith means that you will:</p>\n\n<ol>\n<li><p><strong>Play by the rules.</strong>  This includes the Program Terms, Uber Terms of Use, and any terms and conditions for Uber’s in-scope domains.  If there is any inconsistency between the these Program Terms and any of Uber’s other terms, these Program Terms will control.  </p></li>\n<li>\n<p><strong>Respect our users’ privacy.</strong>  You should only interact with Uber accounts you own or with explicit permission from the account holder.  We want you to hunt for bugs, not user data.  If you encounter user information during the course of your research:</p>\n\n<ul>\n<li>Stop right there.  Actions taken beyond this are not authorized.</li>\n<li>Report this immediately to our Bug Bounty team so we can investigate.</li>\n<li>Do not save, copy, store, transfer, disclose, or otherwise retain the information.</li>\n<li>Work with us if we have any further requests.</li>\n</ul>\n</li>\n<li><p><strong>Don’t extort us.</strong> You should never illegally or in bad faith leverage the existence of a vulnerability or access to sensitive or confidential information, such as making extortionate demands or ransom requests or trying to shake us down.  In other words, if you find a vulnerability, report it to us with no conditions attached.    </p></li>\n<li><p><strong>Don’t cause more harm than good.</strong>  You should never leave a system or users in a more vulnerable state than when you found them.  This means that you should not engage in testing or related activities that degrades, damages, or destroys information within our systems, or that may impact our users, such as denial of service, social engineering or spam.  </p></li>\n</ol>\n\n<p>If you have made a good faith effort to abide by these Program Terms, we will not initiate or recommend legal action against you, and if a third party initiates legal action, we will make it known that your activities were conducted pursuant to the Bug Bounty Program.</p>\n\n<p>Failure to act in good faith will result in immediate disqualification from the Bug Bounty Program and ineligibility for receiving any benefit of the Bug Bounty Program.  </p>\n\n<p>If at any point while researching a vulnerability, you are unsure whether you should continue, immediately engage with our Bug Bounty team.</p>\n\n<hr>\n\n<h2 id=\"eligibility-to-participate\">Eligibility to Participate</h2>\n\n<hr>\n\n<p>To be eligible to participate in our Bug Bounty Program, you must:</p>\n\n<ul>\n<li>Have a signal of at least 1.0 or written permission from Uber’s Bug Bounty Team.</li>\n<li>Be at least 18 years of age if you test using an Uber account.</li>\n<li>Not be employed by Uber or any of its affiliates or an immediate family member of a person employed by Uber or any of its affiliates.</li>\n<li>Not be a resident of, or make Submissions from, a country against which the United States has issued export sanctions or other trade restrictions.</li>\n<li>Not be in violation of any national, state, or local law or regulation with respect to any activities directly or indirectly related to the Bug Bounty Program.</li>\n<li>Not be using duplicate HackerOne accounts.</li>\n</ul>\n\n<p>If (i) you do not meet the eligibility requirements above; (ii) you breach any of these Program Terms or any other agreements you have with Uber or its affiliates; or (iii) we determine that your participation in the Bug Bounty Program could adversely impact us, our affiliates or any of our users, employees or agents, we, in our sole discretion, may remove you from the Bug Bounty Program and disqualify you from receiving any benefit of the Bug Bounty Program. </p>\n\n<hr>\n\n<h2 id=\"security-impact-buckets\">Security Impact Buckets</h2>\n\n<hr>\n\n<p><strong>Exposure of User Data:</strong> the ability to access user or employee data without having an authorized relationship with the Victim.</p>\n\n<ul>\n<li>\n<p>in-scope vulnerability class examples:</p>\n\n<ul>\n<li>AWS <a href=\"https://aws.amazon.com/iam\" rel=\"nofollow noopener noreferrer\"><span>Identity &amp; Access Management</span><i class=\"icon-external-link\"></i></a> credential exposure resulting in access to driver documents in an S3 bucket.</li>\n<li>Adding a user to a Partner’s account, without them accepting the invite, resulting in exposure of name, phone number, and trip history.</li>\n<li>IDOR/authorization vulnerabilities resulting in exposure of personal data.</li>\n</ul>\n</li>\n<li>\n<p>out-of-scope vulnerability class examples:</p>\n\n<ul>\n<li>The ability to determine if a phone number or email has an Uber account, also known as an account oracle.</li>\n</ul>\n</li>\n<li><p>potential domains to look at: auth.uber.com, partners.uber.com, riders.uber.com, eats.uber.com</p></li>\n</ul>\n\n<hr>\n\n<p><strong>Unauthorized Requests on Behalf of User/Employee:</strong> the ability to forge authenticated requests on the behalf of a Victim.</p>\n\n<ul>\n<li>\n<p>in-scope vulnerability class examples:</p>\n\n<ul>\n<li>XSS in domain with authenticated experience allowing forgery of requests.</li>\n<li>CSRF, with non-negligible security impact, in domain with authenticated experience.</li>\n<li>Password reset token exposed, allowing Attacker ability to reset password of victim and login to make state changing requests.</li>\n<li>IDOR/authorization vulnerabilities allowing Attacker to make state changing actions on behalf of a Victim.</li>\n</ul>\n</li>\n<li>\n<p>out-of-scope vulnerability class examples:</p>\n\n<ul>\n<li>XSS or CSRF in a domain without an authenticated experience.</li>\n<li>Credential re-usage from public dumps.</li>\n</ul>\n</li>\n<li><p>potential domains to look at: partners.uber.com, riders.uber.com, eats.uber.com, business.uber.com, rush.uber.com, auth.uber.com, login.uber.com, developer.uber.com, central.uber.com</p></li>\n</ul>\n\n<hr>\n\n<p><strong>Monetary Impact:</strong> the ability to cause monetary impact to Uber or Uber users through a technical vulnerability.</p>\n\n<ul>\n<li>\n<p>in-scope vulnerability class examples:</p>\n\n<ul>\n<li>IDOR/authorization issue allowing an Attacker the ability to provide false payment profile resulting in ride not being charged to account and account not going into arrears -- essentially the ability to take free rides indefinitely with little to no chance of discovery.</li>\n<li>The ability to take drivers offline in a city/region en masse, resulting in service disruption.</li>\n<li>Disclosure of proprietary source code.</li>\n</ul>\n</li>\n<li>\n<p>out-of-scope vulnerability class examples:</p>\n\n<ul>\n<li>Signing up with multiple accounts to abuse invite/promo code usage.</li>\n<li>Invite/Promo code enumeration or collection.</li>\n</ul>\n</li>\n<li><p>potential domains to look at: partners.uber.com, riders.uber.com, eats.uber.com, business.uber.com, rush.uber.com, auth.uber.com, login.uber.com, developer.uber.com</p></li>\n</ul>\n\n<hr>\n\n<p><strong>Phishing:</strong> (almost all examples of Phishing end up out-of-scope) the ability to carry out targeted and convincing phishing on Uber users.</p>\n\n<ul>\n<li>in-scope vulnerability class examples:\n\n<ul>\n<li>HTML injection on <a href=\"http://www.uber.com\" rel=\"nofollow noopener noreferrer\"><span>www.uber.com</span><i class=\"icon-external-link\"></i></a> allowing for convincing phishing.</li>\n<li>XSS in an unauthenticated domain like <a href=\"http://www.uber.com\" rel=\"nofollow noopener noreferrer\"><span>www.uber.com</span><i class=\"icon-external-link\"></i></a>\n</li>\n</ul>\n</li>\n<li>out-of-scope vulnerability class examples:\n\n<ul>\n<li>Reports that do not demonstrate a technical vulnerability, like spear phishing. </li>\n<li>Discussion of SPF/DMARC/DKIM records without verifiable proof of spoofing to a major mail client (e.g. gmail).</li>\n</ul>\n</li>\n<li>potential domains to look at: uber.com, email.uber.com, riders.uber.com, partners.uber.com, eats.uber.com </li>\n</ul>\n\n<hr>\n\n<p><strong>Safety:</strong> the ability to bypass physical safety controls through a technical vulnerability -- the key aspect of these reports is that there exists a technical vulnerability in our services.</p>\n\n<ul>\n<li>in-scope vulnerability class examples:\n\n<ul>\n<li>Trip rate IDOR authorization issue that allows a Driver to increase their rating.</li>\n<li>Ability to update driver image/documents without review from Uber.</li>\n</ul>\n</li>\n<li>potential domains to look at: partners.uber.com, riders.uber.com</li>\n</ul>\n\n<hr>\n\n<h2 id=\"calculating-security-impact\">Calculating Security Impact</h2>\n\n<hr>\n\n<p>Understanding security impact of a given report is understanding which security buckets it lands in, understanding the scale of exposure in each of those situations, understanding what mitigating factors exist, and finally understanding what multiplying factors exist. Below are some categories to consider when assessing security impact.</p>\n\n<h3 id=\"multiplying-factors\">Multiplying Factors</h3>\n\n<ul>\n<li>\n<strong>sensitivity of user data exposed</strong> -- when a vulnerability exposes user data, the sensitivity of the type of information exposed influences the security impact.</li>\n<li>\n<strong>scale of exposure</strong> -- when considering security impact of any given vulnerability, it’s important to understand the scale of exposure and how many potential victims exist if the vulnerability was exploited at scale.</li>\n<li>\n<strong>severity of forged actions</strong> -- when a vulnerability allows an attacker to forge requests/actions on behalf of the user, the sensitivity/severity of those actions determine the security impact. For example, updating a user’s last name versus their bank account number have drastically different security impacts.</li>\n<li>\n<strong>forge communication from Uber</strong> -- when a vulnerability allows an Attacker to send communication (and control the content)  to a Victim and have it come officially from Uber. An example would be the ability to control the contents of an in-app push notification.</li>\n</ul>\n\n<h3 id=\"mitigating-factors\">Mitigating Factors</h3>\n\n<ul>\n<li>\n<strong>requires user interaction</strong> -- when an exploit scenario requires a human from Uber or a Victim to manually interact before exploit is successful.</li>\n<li>\n<strong>authorized relationship</strong> -- when an exploit scenario involves an authorized relationship or is given express permission from the Victim.</li>\n<li>\n<strong>requires brute forcing</strong> -- exploit scenarios that require an Attacker to brute force a value in order for the exploit to be successful. For example, the need to brute force a phone number, email, or UUID. The amount this mitigating factor comes into play is dependent on how “hard” it is to brute force the value in question -- brute forcing phone numbers is much “easier” than a UUID.</li>\n<li>\n<strong>existence of rate limiting</strong> -- exploit scenarios that are mitigated by rate limiting the number of requests, inhibiting the ability to exploit a vulnerability at scale. Forging various IP headers (X-Forwarded-For, X-Real-IP, Client-IP, True-Client-IP) are not considered to be “mitigating” factor since it doesn’t require actually having unique IPs.</li>\n<li>\n<strong>physical access</strong> -- exploit scenarios requiring physical access to a device.</li>\n<li>\n<strong>noticeable to victim</strong> -- exploits that are noticeable to victim. For example, changing someone’s password on their account would lock them out of their account and would be immediately noticeable.</li>\n<li>\n<strong>account put into arrears or banned</strong> -- when an exploit then puts the Attacker’s account into arrears or results in a ban.</li>\n<li>\n<strong>social engineering</strong> -- when an exploit requires social engineering a person to be successful.</li>\n<li>\n<strong>requires privileged network position</strong> -- when an exploit (often times MiTM) requires having privileged network position to be successful</li>\n<li>\n<strong>requires multiple accounts</strong> -- when an exploit requires the ability to mint new accounts indefinitely.</li>\n</ul>\n\n<p>See our recent <a href=\"https://medium.com/@ubersecurity/uber-bug-bounty-treasure-map-17192af85c1a\" rel=\"nofollow noopener noreferrer\"><span>blog post</span><i class=\"icon-external-link\"></i></a> on Treasure Map 2.0 for some specific examples on determining security impact of a given report.</p>\n\n<hr>\n\n<h2 id=\"submissions-and-report-quality\">Submissions and Report Quality</h2>\n\n<hr>\n\n<p>High quality Submissions allow our team to better understand the issue and relay the bug to the internal team to fix. The best reports provide enough actionable information to verify and validate the issue without any follow up clarifying questions.</p>\n\n<ul>\n<li>Check the scope page before you begin writing your report to ensure the issue you are reporting is in scope for the program.</li>\n<li>Think through the attack scenario and exploitability of the vulnerability and provide as many clear details as possible for our team to reproduce the issue (include screenshots if possible).</li>\n<li>Please include your understanding of the security impact of the issue. Our bounty payouts are directly tied to security impact, so the more detail you can provide, the better. We cannot payout after the fact if we don’t have evidence and a mutual understanding of security impact.</li>\n<li>In some cases, it may not be possible to have all of the context on the impact of a bug. If you’re unsure of the direct impact, but feel you may have found something interesting, feel free to submit a detailed report and ask.</li>\n<li>Video only proof-of-concepts (PoCs) will not be considered.</li>\n<li>A vulnerability must be verifiable and reproducible for us to be considered in-scope.<br>\n</li>\n</ul>\n\n<hr>\n\n<h2 id=\"confidentiality\">Confidentiality</h2>\n\n<hr>\n\n<p>Any information you receive or collect about us, our affiliates or any of our users, employees or agents in connection with the Bug Bounty Program (“Confidential Information”) must be kept confidential and only used in connection with the Bug Bounty Program. You may not use, disclose or distribute any such Confidential Information, including without limitation any information regarding your Submission, without our prior written consent.  You must get written consent by submitting a disclosure request through the HackerOne platform.</p>\n\n<hr>\n\n<h2 id=\"report-states\">Report States</h2>\n\n<hr>\n\n<p>We strive to be consistent with how we close reports and below are the details for each state:</p>\n\n<ul>\n<li>\n<strong>spam</strong> -- a report with no useful information</li>\n<li>\n<strong>needs more info</strong> -- not enough actionable information in report to triage</li>\n<li>\n<strong>not applicable</strong> -- no reproducible security vulnerability or explicitly out-of-scope per our guidelines</li>\n<li>\n<strong>duplicate</strong> -- a vulnerability that has previously been found either internally or via Hackerone</li>\n<li>\n<strong>informative</strong> -- a reproducible issue with negligible security impact or an issue with a product that doesn&#39;t affect our service/software (e.g. an S3 bucket named uber-secret-stuff that isn&#39;t actually related to us) </li>\n<li>\n<strong>triaged</strong> -- either a valid report or a report that needs more investigation from an internal team, typically the former</li>\n<li>\n<strong>resolved</strong> -- a verified vulnerability that has been fixed</li>\n</ul>\n\n<hr>\n\n<h2 id=\"bounty-amounts\">Bounty Amounts</h2>\n\n<hr>\n\n<p>Previous bounty amounts are not considered precedent for future bounty amounts -- software is constantly changing and therefore the given security impact of the exact same issue at different times in the development timeline can have significantly different security impacts.</p>\n\n<p>Bounty awards are not additive and are subject to change as our internal environment evolves. We determine the upper bound for security impact and award based on that impact. </p>\n\n<p>We focus bounty amounts on the security impact of any given issue -- things that influence security impact are the scale of exposure and the various mitigating and multiplying factors.</p>\n\n<p>We recognize that researchers value receiving bounties sooner than later, but basing payouts on security impact often requires us to get to resolution before we completely understand the potential security impact. To accomplish both of these needs, we have a hybrid model where we pay out our minimum bounty at time of triage and then full bounty at resolution once we completely understand security impact.</p>\n\n<p>The general process for determining bounty:</p>\n\n<ul>\n<li>Determine which security impact buckets the issue falls in. It’s likely that any given issue will land in several different impact buckets -- we choose the most impactful and severe bucket. We try to answer the question “What is the most damaging thing you could do with this issue?”</li>\n<li>Determine the approximate scale of exposure to try and answer “how many users could be exploited by an Attacker?”</li>\n<li>Determine mitigating factors that reduce the security impact of different issues -- this often involves asking “What could make this vulnerability hard to exploit?” or “How sensitive are the things being changed/accessed by the vulnerability?”</li>\n<li>Determine multiplying factors that increase the security impact of different issues -- this also often involves asking “How sensitive are the things being changed/accessed by the vulnerability?” or “What other exposure exists that the researcher didn’t explicitly call out?”</li>\n<li>With the answers from above, we have a good picture of security impact and potential exploitability of any given issue and can use those details to determine bounty amount.</li>\n</ul>\n\n<p>The bounty ranges for the different security impact buckets:</p>\n\n<ul>\n<li>\n<strong>Exposure of User Data</strong> -- the payout ranges for this bucket range from $0 to $10,000.</li>\n<li>\n<strong>Unauthorized Requests on Behalf of User/Employee</strong> -- the payout ranges for this bucket range from $0 to $10,000.</li>\n<li>\n<strong>Monetary Impact</strong> -- the payout ranges for this bucket range from $0 to $10,000</li>\n<li>\n<strong>Phishing</strong> -- the payout ranges for this bucket range from $0 to $5,000</li>\n<li>\n<strong>Safety</strong>  -- the payout ranges for this bucket range from $0 to $10,000</li>\n</ul>\n\n<p>Bounty payouts and amount, if any, will be determined by us in our sole discretion. In no event are we obligated to provide a payout for any Submission. The format, currency and timing of all bounty payouts shall be determined by us in our sole discretion. You are solely responsible for any tax implications related to any bounty payouts you may receive.</p>\n\n<p>If we receive several reports for the same issue, we offer the bounty to the earliest report for which we had enough actionable information to identify the issue.</p>\n\n<hr>\n\n<h2 id=\"out-of-scope\">Out-of-Scope</h2>\n\n<hr>\n\n<ul>\n<li>Vulnerabilities whose primary security impact is focused on Phishing in a domain that is not in one of our primary domains (e.g. <a href=\"http://www.uber.com\" rel=\"nofollow noopener noreferrer\"><span>www.uber.com</span><i class=\"icon-external-link\"></i></a>, riders.uber.com, partners.uber.com, login.uber.com, auth.uber.com, eats.uber.com, rush.uber.com, developer.uber.com).</li>\n<li>UUID enumeration of any kind.</li>\n<li>Invite/Promo code enumeration.</li>\n<li>Account oracles -- the ability to submit a phone number, email, UUID and receive back a message indicating an Uber account exists.</li>\n<li>Open redirects. 99% of open redirects have low security impact. For the rare cases where the impact is higher, e.g., stealing oauth tokens, we do still want to hear about them.</li>\n<li>Reports that state that software is out of date/vulnerable without a proof-of-concept.</li>\n<li>Reports that affect only outdated user agents or app versions -- we only consider exploits in the latest browser versions for Safari, FireFox, Chrome, Edge, IE and the versions of our application that are currently in the app stores.</li>\n<li>Stack traces, path disclosure, and directory listings.</li>\n<li>CSV injection.</li>\n<li>Best practices concerns.</li>\n<li>Highly speculative reports about theoretical damage -- please always provide a proof-of-concept.</li>\n<li>Vulnerabilities that cannot be used to exploit other users or Uber -- e.g. self-xss or having a user paste JavaScript into the browser console.</li>\n<li>Vulnerabilities as reported by automated tools without additional analysis as to how they&#39;re an issue.</li>\n<li>Reports from automated web vulnerability scanners (Acunetix, Vega, etc.) that have not been validated.</li>\n<li>Distributed denial of service attacks (DDOS).</li>\n<li>Physical or social engineering attempts (this includes phishing attacks against Uber employees).</li>\n<li>Content injection issues.</li>\n<li>Cross-site Request Forgery (CSRF) with minimal security implications (Logout CSRF, etc.)</li>\n<li>Missing cookie flags on non-authentication cookies.</li>\n<li>Issues that require physical access to a victim’s computer/device.</li>\n<li>SSL/TLS scan reports (this means output from sites such as SSL Labs).</li>\n<li>Banner grabbing issues (figuring out what web server we use, etc.).</li>\n<li>Open ports without an accompanying proof-of-concept demonstrating vulnerability.</li>\n<li>Entering the Uber offices, throwing crisps everywhere, unleashing a bunch of hungry raccoons, and hijacking an abandoned terminal on an unlocked workstation while staff are distracted.</li>\n</ul>\n\n<p><strong>Out-of-scope domains</strong></p>\n\n<ul>\n<li>\n<code>*.uber.com.cn</code> domains or any other properties relating to Uber in China, since they belong to Didi Chuxing</li>\n<li>\n<code>uber.onelogin.com</code>\n\n<ul>\n<li>OneLogin runs their own bug bounty program and any vulnerabilities for OneLogin should be reported to them.</li>\n</ul>\n</li>\n<li><code>bizblog.uber.com</code></li>\n<li><code>newsroom.uber.com</code></li>\n<li><code>love.uber.com</code></li>\n<li><code>drive.uber.com</code></li>\n<li><code>eng.uber.com</code></li>\n<li><code>people.uber.com</code></li>\n<li><code>*.et.uber.com</code></li>\n</ul>\n\n<hr>\n\n<h2 id=\"rights-and-licenses\">Rights and Licenses</h2>\n\n<hr>\n\n<p>We may modify the Program Terms or cancel the Bug Bounty Program at any time.  </p>\n\n<p>By making a Submission, you represent and warrant that the Submission is original to you and you have the right to submit the Submission.  </p>\n\n<p>By making a Submission, you give us the right to use your Submission for any purpose.</p>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "show_mean_bounty_time": true, 
    "total_bounties_paid_prefix": null, 
    "awards_miles": false, 
    "average_bounty_upper_range": 500.0, 
    "top_bounty_lower_range": 3250.0, 
    "anc_enabled": null, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "show_average_bounty": true, 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2018-04-26T10:27:57.626Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2016-03-22T15:00:13.258Z", 
    "bug_count": 1075, 
    "mean_time_to_bounty": 3052800, 
    "offers_swag": false, 
    "offers_bounties": true, 
    "id": 314, 
    "mean_time_to_resolution": 7614000, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/000/314/826c90cba1555458df787ae914793cd5070e18df_small.png?1514905146", 
        "large": "https://profile-photos.hackerone-user-content.com/000/000/314/a3485d6003015c089bcc22f74bf9176057f23596_large.png?1514905146", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/000/314/dde89d930f3aec0f3507a9f24725c0a881b113f7_xtralarge.png?1514905146"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "show_top_bounties": true, 
    "target_signal": 1, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "https://www.uber.com", 
        "about": "", 
        "twitter_handle": "", 
        "name": "Uber"
    }, 
    "scopes": [
        "api.uber.com", 
        "bonjour.uber.com", 
        "business.uber.com", 
        "cn-cfe1.uber.com", 
        "cn-dc1.uber.com", 
        "cn-dc2.uber.com", 
        "cn-dc3.uber.com", 
        "cn-dca1.uber.com", 
        "cn-geo1.uber.com", 
        "cn-pek1.uber.com", 
        "cn-pr.uber.com", 
        "cn-sjc1.uber.com", 
        "cn-slow1.uber.com", 
        "cn-slow2.uber.com", 
        "cn-slow3.uber.com", 
        "cn-spdy.uber.com", 
        "cn-tt1.uber.com", 
        "cn.uber.com", 
        "cn1.uber.com", 
        "cnfrontend-dca1.uber.com", 
        "cnfrontend-sjc1.uber.com", 
        "cnfrontend.uber.com", 
        "csp.uber.com", 
        "developer.uber.com", 
        "eats.uber.com", 
        "get.uber.com", 
        "getrush.uber.com", 
        "help.uber.com", 
        "login.uber.com", 
        "m.uber.com", 
        "partners.uber.com", 
        "riders.uber.com", 
        "rush.uber.com", 
        "sftp.uber.com", 
        "sms.uber.com", 
        "track.uber.com", 
        "trip.uber.com", 
        "ubereats.com", 
        "ubermovement.com", 
        "*.uberinternal.com", 
        "vault.uber.com", 
        "www.uber.com", 
        "dial.uber.com"
    ], 
    "handle": "uber", 
    "cover_color": "#ffffff", 
    "mean_time_to_first_response": 18000, 
    "average_bounty_lower_range": 500.0, 
    "response_efficiency_percentage": 100, 
    "policy": "---\r\n##Uber Bug Bounty Program Terms\r\n--- \r\nThe scope for Uber’s Bug Bounty Program is focused on securing the data of our users. Therefore, our approach is to evaluate any given report based on the specific security impact for users (versus domain + vulnerability class). Below we describe the various security impact buckets that are in-scope, examples of vulnerability types, and domains that could potentially have meaningful security impact.  \r\nYour participation in our Bug Bounty Program is voluntary.  By submitting a report or otherwise disclosing a vulnerability to us (making a “Submission”), you are indicating that you have read and agree to follow the rules set forth on this page (“Program Terms”).  \r\n\r\n**Ground Rules**\r\n  * Research and disclose in good faith.\r\n  * Respect our users’ privacy.  \r\n  * No extortion, shake downs, or duress.\r\n  * Don’t leave any system in a more vulnerable state than you found it.\r\n  * Don’t publicly disclose a vulnerability without our consent.\r\n  * Be respectful when interacting with our team, and our team will do the same.\r\n\r\n---\r\n##Good Faith Vulnerability Research and Disclosure\r\n---\r\nYou must act in good faith when investigating and reporting vulnerabilities to us.  Acting in good faith means that you will:\r\n\r\n1. **Play by the rules.**  This includes the Program Terms, Uber Terms of Use, and any terms and conditions for Uber’s in-scope domains.  If there is any inconsistency between the these Program Terms and any of Uber’s other terms, these Program Terms will control.  \r\n\r\n2. **Respect our users’ privacy.**  You should only interact with Uber accounts you own or with explicit permission from the account holder.  We want you to hunt for bugs, not user data.  If you encounter user information during the course of your research:\r\n  * Stop right there.  Actions taken beyond this are not authorized.\r\n  * Report this immediately to our Bug Bounty team so we can investigate.\r\n  * Do not save, copy, store, transfer, disclose, or otherwise retain the information.\r\n  * Work with us if we have any further requests.\r\n\r\n\r\n3. **Don’t extort us.** You should never illegally or in bad faith leverage the existence of a vulnerability or access to sensitive or confidential information, such as making extortionate demands or ransom requests or trying to shake us down.  In other words, if you find a vulnerability, report it to us with no conditions attached.    \r\n\r\n4. **Don’t cause more harm than good.**  You should never leave a system or users in a more vulnerable state than when you found them.  This means that you should not engage in testing or related activities that degrades, damages, or destroys information within our systems, or that may impact our users, such as denial of service, social engineering or spam.  \r\n\r\nIf you have made a good faith effort to abide by these Program Terms, we will not initiate or recommend legal action against you, and if a third party initiates legal action, we will make it known that your activities were conducted pursuant to the Bug Bounty Program.\r\n\r\nFailure to act in good faith will result in immediate disqualification from the Bug Bounty Program and ineligibility for receiving any benefit of the Bug Bounty Program.  \r\n\r\nIf at any point while researching a vulnerability, you are unsure whether you should continue, immediately engage with our Bug Bounty team.\r\n\r\n---\r\n## Eligibility to Participate\r\n---\r\nTo be eligible to participate in our Bug Bounty Program, you must:\r\n  * Have a signal of at least 1.0 or written permission from Uber’s Bug Bounty Team.\r\n  * Be at least 18 years of age if you test using an Uber account.\r\n  * Not be employed by Uber or any of its affiliates or an immediate family member of a person employed by Uber or any of its affiliates.\r\n  * Not be a resident of, or make Submissions from, a country against which the United States has issued export sanctions or other trade restrictions.\r\n  * Not be in violation of any national, state, or local law or regulation with respect to any activities directly or indirectly related to the Bug Bounty Program.\r\n  * Not be using duplicate HackerOne accounts.\r\n\r\nIf (i) you do not meet the eligibility requirements above; (ii) you breach any of these Program Terms or any other agreements you have with Uber or its affiliates; or (iii) we determine that your participation in the Bug Bounty Program could adversely impact us, our affiliates or any of our users, employees or agents, we, in our sole discretion, may remove you from the Bug Bounty Program and disqualify you from receiving any benefit of the Bug Bounty Program. \r\n\r\n---\r\n## Security Impact Buckets\r\n---\r\n\r\n**Exposure of User Data:** the ability to access user or employee data without having an authorized relationship with the Victim.\r\n* in-scope vulnerability class examples:\r\n  * AWS [Identity & Access Management](https://aws.amazon.com/iam) credential exposure resulting in access to driver documents in an S3 bucket.\r\n  * Adding a user to a Partner’s account, without them accepting the invite, resulting in exposure of name, phone number, and trip history.\r\n  * IDOR/authorization vulnerabilities resulting in exposure of personal data.\r\n\r\n* out-of-scope vulnerability class examples:\r\n * The ability to determine if a phone number or email has an Uber account, also known as an account oracle.\r\n* potential domains to look at: auth.uber.com, partners.uber.com, riders.uber.com, eats.uber.com\r\n\r\n---\r\n\r\n**Unauthorized Requests on Behalf of User/Employee:** the ability to forge authenticated requests on the behalf of a Victim.\r\n* in-scope vulnerability class examples:\r\n  * XSS in domain with authenticated experience allowing forgery of requests.\r\n  * CSRF, with non-negligible security impact, in domain with authenticated experience.\r\n  * Password reset token exposed, allowing Attacker ability to reset password of victim and login to make state changing requests.\r\n  * IDOR/authorization vulnerabilities allowing Attacker to make state changing actions on behalf of a Victim.\r\n\r\n\r\n\r\n* out-of-scope vulnerability class examples:\r\n  * XSS or CSRF in a domain without an authenticated experience.\r\n  * Credential re-usage from public dumps.\r\n* potential domains to look at: partners.uber.com, riders.uber.com, eats.uber.com, business.uber.com, rush.uber.com, auth.uber.com, login.uber.com, developer.uber.com, central.uber.com\r\n\r\n---\r\n\r\n**Monetary Impact:** the ability to cause monetary impact to Uber or Uber users through a technical vulnerability.\r\n* in-scope vulnerability class examples:\r\n  * IDOR/authorization issue allowing an Attacker the ability to provide false payment profile resulting in ride not being charged to account and account not going into arrears -- essentially the ability to take free rides indefinitely with little to no chance of discovery.\r\n  * The ability to take drivers offline in a city/region en masse, resulting in service disruption.\r\n  * Disclosure of proprietary source code.\r\n\r\n\r\n* out-of-scope vulnerability class examples:\r\n  * Signing up with multiple accounts to abuse invite/promo code usage.\r\n  * Invite/Promo code enumeration or collection.\r\n* potential domains to look at: partners.uber.com, riders.uber.com, eats.uber.com, business.uber.com, rush.uber.com, auth.uber.com, login.uber.com, developer.uber.com\r\n\r\n---\r\n\r\n**Phishing:** (almost all examples of Phishing end up out-of-scope) the ability to carry out targeted and convincing phishing on Uber users.\r\n* in-scope vulnerability class examples:\r\n  * HTML injection on www.uber.com allowing for convincing phishing.\r\n  * XSS in an unauthenticated domain like www.uber.com\r\n* out-of-scope vulnerability class examples:\r\n  * Reports that do not demonstrate a technical vulnerability, like spear phishing. \r\n  * Discussion of SPF/DMARC/DKIM records without verifiable proof of spoofing to a major mail client (e.g. gmail).\r\n* potential domains to look at: uber.com, email.uber.com, riders.uber.com, partners.uber.com, eats.uber.com \r\n\r\n---\r\n\r\n**Safety:** the ability to bypass physical safety controls through a technical vulnerability -- the key aspect of these reports is that there exists a technical vulnerability in our services.\r\n* in-scope vulnerability class examples:\r\n  * Trip rate IDOR authorization issue that allows a Driver to increase their rating.\r\n  * Ability to update driver image/documents without review from Uber.\r\n* potential domains to look at: partners.uber.com, riders.uber.com\r\n\r\n---\r\n## Calculating Security Impact\r\n---\r\n\r\nUnderstanding security impact of a given report is understanding which security buckets it lands in, understanding the scale of exposure in each of those situations, understanding what mitigating factors exist, and finally understanding what multiplying factors exist. Below are some categories to consider when assessing security impact.\r\n\r\n### Multiplying Factors\r\n\r\n* **sensitivity of user data exposed** -- when a vulnerability exposes user data, the sensitivity of the type of information exposed influences the security impact.\r\n* **scale of exposure** -- when considering security impact of any given vulnerability, it’s important to understand the scale of exposure and how many potential victims exist if the vulnerability was exploited at scale.\r\n* **severity of forged actions** -- when a vulnerability allows an attacker to forge requests/actions on behalf of the user, the sensitivity/severity of those actions determine the security impact. For example, updating a user’s last name versus their bank account number have drastically different security impacts.\r\n* **forge communication from Uber** -- when a vulnerability allows an Attacker to send communication (and control the content)  to a Victim and have it come officially from Uber. An example would be the ability to control the contents of an in-app push notification.\r\n\r\n### Mitigating Factors\r\n\r\n* **requires user interaction** -- when an exploit scenario requires a human from Uber or a Victim to manually interact before exploit is successful.\r\n* **authorized relationship** -- when an exploit scenario involves an authorized relationship or is given express permission from the Victim.\r\n* **requires brute forcing** -- exploit scenarios that require an Attacker to brute force a value in order for the exploit to be successful. For example, the need to brute force a phone number, email, or UUID. The amount this mitigating factor comes into play is dependent on how “hard” it is to brute force the value in question -- brute forcing phone numbers is much “easier” than a UUID.\r\n* **existence of rate limiting** -- exploit scenarios that are mitigated by rate limiting the number of requests, inhibiting the ability to exploit a vulnerability at scale. Forging various IP headers (X-Forwarded-For, X-Real-IP, Client-IP, True-Client-IP) are not considered to be “mitigating” factor since it doesn’t require actually having unique IPs.\r\n* **physical access** -- exploit scenarios requiring physical access to a device.\r\n* **noticeable to victim** -- exploits that are noticeable to victim. For example, changing someone’s password on their account would lock them out of their account and would be immediately noticeable.\r\n* **account put into arrears or banned** -- when an exploit then puts the Attacker’s account into arrears or results in a ban.\r\n* **social engineering** -- when an exploit requires social engineering a person to be successful.\r\n* **requires privileged network position** -- when an exploit (often times MiTM) requires having privileged network position to be successful\r\n* **requires multiple accounts** -- when an exploit requires the ability to mint new accounts indefinitely.\r\n\r\nSee our recent [blog post](https://medium.com/@ubersecurity/uber-bug-bounty-treasure-map-17192af85c1a) on Treasure Map 2.0 for some specific examples on determining security impact of a given report.\r\n\r\n---\r\n##Submissions and Report Quality\r\n---\r\n\r\nHigh quality Submissions allow our team to better understand the issue and relay the bug to the internal team to fix. The best reports provide enough actionable information to verify and validate the issue without any follow up clarifying questions.\r\n\r\n   * Check the scope page before you begin writing your report to ensure the issue you are reporting is in scope for the program.\r\n   * Think through the attack scenario and exploitability of the vulnerability and provide as many clear details as possible for our team to reproduce the issue (include screenshots if possible).\r\n   * Please include your understanding of the security impact of the issue. Our bounty payouts are directly tied to security impact, so the more detail you can provide, the better. We cannot payout after the fact if we don’t have evidence and a mutual understanding of security impact.\r\n   * In some cases, it may not be possible to have all of the context on the impact of a bug. If you’re unsure of the direct impact, but feel you may have found something interesting, feel free to submit a detailed report and ask.\r\n   * Video only proof-of-concepts (PoCs) will not be considered.\r\n   * A vulnerability must be verifiable and reproducible for us to be considered in-scope.  \r\n\r\n\r\n---\r\n##Confidentiality\r\n---\r\n\r\nAny information you receive or collect about us, our affiliates or any of our users, employees or agents in connection with the Bug Bounty Program (“Confidential Information”) must be kept confidential and only used in connection with the Bug Bounty Program. You may not use, disclose or distribute any such Confidential Information, including without limitation any information regarding your Submission, without our prior written consent.  You must get written consent by submitting a disclosure request through the HackerOne platform.\r\n\r\n\r\n---\r\n## Report States\r\n---\r\n\r\nWe strive to be consistent with how we close reports and below are the details for each state:\r\n* **spam** -- a report with no useful information\r\n* **needs more info** -- not enough actionable information in report to triage\r\n* **not applicable** -- no reproducible security vulnerability or explicitly out-of-scope per our guidelines\r\n* **duplicate** -- a vulnerability that has previously been found either internally or via Hackerone\r\n* **informative** -- a reproducible issue with negligible security impact or an issue with a product that doesn't affect our service/software (e.g. an S3 bucket named uber-secret-stuff that isn't actually related to us) \r\n* **triaged** -- either a valid report or a report that needs more investigation from an internal team, typically the former\r\n* **resolved** -- a verified vulnerability that has been fixed\r\n\r\n---\r\n## Bounty Amounts\r\n---\r\n\r\nPrevious bounty amounts are not considered precedent for future bounty amounts -- software is constantly changing and therefore the given security impact of the exact same issue at different times in the development timeline can have significantly different security impacts.\r\n\r\nBounty awards are not additive and are subject to change as our internal environment evolves. We determine the upper bound for security impact and award based on that impact. \r\n\r\nWe focus bounty amounts on the security impact of any given issue -- things that influence security impact are the scale of exposure and the various mitigating and multiplying factors.\r\n\r\nWe recognize that researchers value receiving bounties sooner than later, but basing payouts on security impact often requires us to get to resolution before we completely understand the potential security impact. To accomplish both of these needs, we have a hybrid model where we pay out our minimum bounty at time of triage and then full bounty at resolution once we completely understand security impact.\r\n\r\n\r\n\r\n\r\nThe general process for determining bounty:\r\n* Determine which security impact buckets the issue falls in. It’s likely that any given issue will land in several different impact buckets -- we choose the most impactful and severe bucket. We try to answer the question “What is the most damaging thing you could do with this issue?”\r\n* Determine the approximate scale of exposure to try and answer “how many users could be exploited by an Attacker?”\r\n* Determine mitigating factors that reduce the security impact of different issues -- this often involves asking “What could make this vulnerability hard to exploit?” or “How sensitive are the things being changed/accessed by the vulnerability?”\r\n* Determine multiplying factors that increase the security impact of different issues -- this also often involves asking “How sensitive are the things being changed/accessed by the vulnerability?” or “What other exposure exists that the researcher didn’t explicitly call out?”\r\n* With the answers from above, we have a good picture of security impact and potential exploitability of any given issue and can use those details to determine bounty amount.\r\n\r\nThe bounty ranges for the different security impact buckets:\r\n* **Exposure of User Data** -- the payout ranges for this bucket range from $0 to $10,000.\r\n* **Unauthorized Requests on Behalf of User/Employee** -- the payout ranges for this bucket range from $0 to $10,000.\r\n* **Monetary Impact** -- the payout ranges for this bucket range from $0 to $10,000\r\n* **Phishing** -- the payout ranges for this bucket range from $0 to $5,000\r\n* **Safety**  -- the payout ranges for this bucket range from $0 to $10,000\r\n\r\nBounty payouts and amount, if any, will be determined by us in our sole discretion. In no event are we obligated to provide a payout for any Submission. The format, currency and timing of all bounty payouts shall be determined by us in our sole discretion. You are solely responsible for any tax implications related to any bounty payouts you may receive.\r\n\r\nIf we receive several reports for the same issue, we offer the bounty to the earliest report for which we had enough actionable information to identify the issue.\r\n\r\n---\r\n## Out-of-Scope\r\n---\r\n\r\n  * Vulnerabilities whose primary security impact is focused on Phishing in a domain that is not in one of our primary domains (e.g. www.uber.com, riders.uber.com, partners.uber.com, login.uber.com, auth.uber.com, eats.uber.com, rush.uber.com, developer.uber.com).\r\n  * UUID enumeration of any kind.\r\n  * Invite/Promo code enumeration.\r\n  * Account oracles -- the ability to submit a phone number, email, UUID and receive back a message indicating an Uber account exists.\r\n  * Open redirects. 99% of open redirects have low security impact. For the rare cases where the impact is higher, e.g., stealing oauth tokens, we do still want to hear about them.\r\n  * Reports that state that software is out of date/vulnerable without a proof-of-concept.\r\n  * Reports that affect only outdated user agents or app versions -- we only consider exploits in the latest browser versions for Safari, FireFox, Chrome, Edge, IE and the versions of our application that are currently in the app stores.\r\n  * Stack traces, path disclosure, and directory listings.\r\n  * CSV injection.\r\n  * Best practices concerns.\r\n  * Highly speculative reports about theoretical damage -- please always provide a proof-of-concept.\r\n  * Vulnerabilities that cannot be used to exploit other users or Uber -- e.g. self-xss or having a user paste JavaScript into the browser console.\r\n  * Vulnerabilities as reported by automated tools without additional analysis as to how they're an issue.\r\n  * Reports from automated web vulnerability scanners (Acunetix, Vega, etc.) that have not been validated.\r\n  * Distributed denial of service attacks (DDOS).\r\n  * Physical or social engineering attempts (this includes phishing attacks against Uber employees).\r\n  * Content injection issues.\r\n  * Cross-site Request Forgery (CSRF) with minimal security implications (Logout CSRF, etc.)\r\n  * Missing cookie flags on non-authentication cookies.\r\n  * Issues that require physical access to a victim’s computer/device.\r\n  * SSL/TLS scan reports (this means output from sites such as SSL Labs).\r\n  * Banner grabbing issues (figuring out what web server we use, etc.).\r\n  * Open ports without an accompanying proof-of-concept demonstrating vulnerability.\r\n  * Entering the Uber offices, throwing crisps everywhere, unleashing a bunch of hungry raccoons, and hijacking an abandoned terminal on an unlocked workstation while staff are distracted.\r\n  \r\n**Out-of-scope domains**\r\n\r\n\r\n  * `*.uber.com.cn` domains or any other properties relating to Uber in China, since they belong to Didi Chuxing\r\n  * `uber.onelogin.com`\r\n    * OneLogin runs their own bug bounty program and any vulnerabilities for OneLogin should be reported to them.\r\n  * `bizblog.uber.com`\r\n  * `newsroom.uber.com`\r\n  * `love.uber.com`\r\n  * `drive.uber.com`\r\n  * `eng.uber.com`\r\n  * `people.uber.com`\r\n  * `*.et.uber.com`\r\n\r\n---\r\n##Rights and Licenses\r\n---\r\n\r\nWe may modify the Program Terms or cancel the Bug Bounty Program at any time.  \r\n\r\nBy making a Submission, you represent and warrant that the Submission is original to you and you have the right to submit the Submission.  \r\n\r\nBy making a Submission, you give us the right to use your Submission for any purpose.\r\n", 
    "can_view_hacktivity": true, 
    "base_bounty": 500, 
    "has_cover_photo": false, 
    "total_bounties_paid": 1661093.51, 
    "policy_markdown": "<hr>\n\n<h2 id=\"uber-bug-bounty-program-terms\">Uber Bug Bounty Program Terms</h2>\n\n<hr>\n\n<p>The scope for Uber’s Bug Bounty Program is focused on securing the data of our users. Therefore, our approach is to evaluate any given report based on the specific security impact for users (versus domain + vulnerability class). Below we describe the various security impact buckets that are in-scope, examples of vulnerability types, and domains that could potentially have meaningful security impact.<br><br>\nYour participation in our Bug Bounty Program is voluntary.  By submitting a report or otherwise disclosing a vulnerability to us (making a “Submission”), you are indicating that you have read and agree to follow the rules set forth on this page (“Program Terms”).  </p>\n\n<p><strong>Ground Rules</strong></p>\n\n<ul>\n<li>Research and disclose in good faith.</li>\n<li>Respect our users’ privacy.<br>\n</li>\n<li>No extortion, shake downs, or duress.</li>\n<li>Don’t leave any system in a more vulnerable state than you found it.</li>\n<li>Don’t publicly disclose a vulnerability without our consent.</li>\n<li>Be respectful when interacting with our team, and our team will do the same.</li>\n</ul>\n\n<hr>\n\n<h2 id=\"good-faith-vulnerability-research-and-disclosure\">Good Faith Vulnerability Research and Disclosure</h2>\n\n<hr>\n\n<p>You must act in good faith when investigating and reporting vulnerabilities to us.  Acting in good faith means that you will:</p>\n\n<ol>\n<li><p><strong>Play by the rules.</strong>  This includes the Program Terms, Uber Terms of Use, and any terms and conditions for Uber’s in-scope domains.  If there is any inconsistency between the these Program Terms and any of Uber’s other terms, these Program Terms will control.  </p></li>\n<li>\n<p><strong>Respect our users’ privacy.</strong>  You should only interact with Uber accounts you own or with explicit permission from the account holder.  We want you to hunt for bugs, not user data.  If you encounter user information during the course of your research:</p>\n\n<ul>\n<li>Stop right there.  Actions taken beyond this are not authorized.</li>\n<li>Report this immediately to our Bug Bounty team so we can investigate.</li>\n<li>Do not save, copy, store, transfer, disclose, or otherwise retain the information.</li>\n<li>Work with us if we have any further requests.</li>\n</ul>\n</li>\n<li><p><strong>Don’t extort us.</strong> You should never illegally or in bad faith leverage the existence of a vulnerability or access to sensitive or confidential information, such as making extortionate demands or ransom requests or trying to shake us down.  In other words, if you find a vulnerability, report it to us with no conditions attached.    </p></li>\n<li><p><strong>Don’t cause more harm than good.</strong>  You should never leave a system or users in a more vulnerable state than when you found them.  This means that you should not engage in testing or related activities that degrades, damages, or destroys information within our systems, or that may impact our users, such as denial of service, social engineering or spam.  </p></li>\n</ol>\n\n<p>If you have made a good faith effort to abide by these Program Terms, we will not initiate or recommend legal action against you, and if a third party initiates legal action, we will make it known that your activities were conducted pursuant to the Bug Bounty Program.</p>\n\n<p>Failure to act in good faith will result in immediate disqualification from the Bug Bounty Program and ineligibility for receiving any benefit of the Bug Bounty Program.  </p>\n\n<p>If at any point while researching a vulnerability, you are unsure whether you should continue, immediately engage with our Bug Bounty team.</p>\n\n<hr>\n\n<h2 id=\"eligibility-to-participate\">Eligibility to Participate</h2>\n\n<hr>\n\n<p>To be eligible to participate in our Bug Bounty Program, you must:</p>\n\n<ul>\n<li>Have a signal of at least 1.0 or written permission from Uber’s Bug Bounty Team.</li>\n<li>Be at least 18 years of age if you test using an Uber account.</li>\n<li>Not be employed by Uber or any of its affiliates or an immediate family member of a person employed by Uber or any of its affiliates.</li>\n<li>Not be a resident of, or make Submissions from, a country against which the United States has issued export sanctions or other trade restrictions.</li>\n<li>Not be in violation of any national, state, or local law or regulation with respect to any activities directly or indirectly related to the Bug Bounty Program.</li>\n<li>Not be using duplicate HackerOne accounts.</li>\n</ul>\n\n<p>If (i) you do not meet the eligibility requirements above; (ii) you breach any of these Program Terms or any other agreements you have with Uber or its affiliates; or (iii) we determine that your participation in the Bug Bounty Program could adversely impact us, our affiliates or any of our users, employees or agents, we, in our sole discretion, may remove you from the Bug Bounty Program and disqualify you from receiving any benefit of the Bug Bounty Program. </p>\n\n<hr>\n\n<h2 id=\"security-impact-buckets\">Security Impact Buckets</h2>\n\n<hr>\n\n<p><strong>Exposure of User Data:</strong> the ability to access user or employee data without having an authorized relationship with the Victim.</p>\n\n<ul>\n<li>\n<p>in-scope vulnerability class examples:</p>\n\n<ul>\n<li>AWS <a href=\"https://aws.amazon.com/iam\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>Identity &amp; Access Management</span><i class=\"icon-external-link\"></i></a> credential exposure resulting in access to driver documents in an S3 bucket.</li>\n<li>Adding a user to a Partner’s account, without them accepting the invite, resulting in exposure of name, phone number, and trip history.</li>\n<li>IDOR/authorization vulnerabilities resulting in exposure of personal data.</li>\n</ul>\n</li>\n<li>\n<p>out-of-scope vulnerability class examples:</p>\n\n<ul>\n<li>The ability to determine if a phone number or email has an Uber account, also known as an account oracle.</li>\n</ul>\n</li>\n<li><p>potential domains to look at: auth.uber.com, partners.uber.com, riders.uber.com, eats.uber.com</p></li>\n</ul>\n\n<hr>\n\n<p><strong>Unauthorized Requests on Behalf of User/Employee:</strong> the ability to forge authenticated requests on the behalf of a Victim.</p>\n\n<ul>\n<li>\n<p>in-scope vulnerability class examples:</p>\n\n<ul>\n<li>XSS in domain with authenticated experience allowing forgery of requests.</li>\n<li>CSRF, with non-negligible security impact, in domain with authenticated experience.</li>\n<li>Password reset token exposed, allowing Attacker ability to reset password of victim and login to make state changing requests.</li>\n<li>IDOR/authorization vulnerabilities allowing Attacker to make state changing actions on behalf of a Victim.</li>\n</ul>\n</li>\n<li>\n<p>out-of-scope vulnerability class examples:</p>\n\n<ul>\n<li>XSS or CSRF in a domain without an authenticated experience.</li>\n<li>Credential re-usage from public dumps.</li>\n</ul>\n</li>\n<li><p>potential domains to look at: partners.uber.com, riders.uber.com, eats.uber.com, business.uber.com, rush.uber.com, auth.uber.com, login.uber.com, developer.uber.com, central.uber.com</p></li>\n</ul>\n\n<hr>\n\n<p><strong>Monetary Impact:</strong> the ability to cause monetary impact to Uber or Uber users through a technical vulnerability.</p>\n\n<ul>\n<li>\n<p>in-scope vulnerability class examples:</p>\n\n<ul>\n<li>IDOR/authorization issue allowing an Attacker the ability to provide false payment profile resulting in ride not being charged to account and account not going into arrears -- essentially the ability to take free rides indefinitely with little to no chance of discovery.</li>\n<li>The ability to take drivers offline in a city/region en masse, resulting in service disruption.</li>\n<li>Disclosure of proprietary source code.</li>\n</ul>\n</li>\n<li>\n<p>out-of-scope vulnerability class examples:</p>\n\n<ul>\n<li>Signing up with multiple accounts to abuse invite/promo code usage.</li>\n<li>Invite/Promo code enumeration or collection.</li>\n</ul>\n</li>\n<li><p>potential domains to look at: partners.uber.com, riders.uber.com, eats.uber.com, business.uber.com, rush.uber.com, auth.uber.com, login.uber.com, developer.uber.com</p></li>\n</ul>\n\n<hr>\n\n<p><strong>Phishing:</strong> (almost all examples of Phishing end up out-of-scope) the ability to carry out targeted and convincing phishing on Uber users.</p>\n\n<ul>\n<li>in-scope vulnerability class examples:\n\n<ul>\n<li>HTML injection on <a href=\"http://www.uber.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>www.uber.com</span><i class=\"icon-external-link\"></i></a> allowing for convincing phishing.</li>\n<li>XSS in an unauthenticated domain like <a href=\"http://www.uber.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>www.uber.com</span><i class=\"icon-external-link\"></i></a>\n</li>\n</ul>\n</li>\n<li>out-of-scope vulnerability class examples:\n\n<ul>\n<li>Reports that do not demonstrate a technical vulnerability, like spear phishing. </li>\n<li>Discussion of SPF/DMARC/DKIM records without verifiable proof of spoofing to a major mail client (e.g. gmail).</li>\n</ul>\n</li>\n<li>potential domains to look at: uber.com, email.uber.com, riders.uber.com, partners.uber.com, eats.uber.com </li>\n</ul>\n\n<hr>\n\n<p><strong>Safety:</strong> the ability to bypass physical safety controls through a technical vulnerability -- the key aspect of these reports is that there exists a technical vulnerability in our services.</p>\n\n<ul>\n<li>in-scope vulnerability class examples:\n\n<ul>\n<li>Trip rate IDOR authorization issue that allows a Driver to increase their rating.</li>\n<li>Ability to update driver image/documents without review from Uber.</li>\n</ul>\n</li>\n<li>potential domains to look at: partners.uber.com, riders.uber.com</li>\n</ul>\n\n<hr>\n\n<h2 id=\"calculating-security-impact\">Calculating Security Impact</h2>\n\n<hr>\n\n<p>Understanding security impact of a given report is understanding which security buckets it lands in, understanding the scale of exposure in each of those situations, understanding what mitigating factors exist, and finally understanding what multiplying factors exist. Below are some categories to consider when assessing security impact.</p>\n\n<h3 id=\"multiplying-factors\">Multiplying Factors</h3>\n\n<ul>\n<li>\n<strong>sensitivity of user data exposed</strong> -- when a vulnerability exposes user data, the sensitivity of the type of information exposed influences the security impact.</li>\n<li>\n<strong>scale of exposure</strong> -- when considering security impact of any given vulnerability, it’s important to understand the scale of exposure and how many potential victims exist if the vulnerability was exploited at scale.</li>\n<li>\n<strong>severity of forged actions</strong> -- when a vulnerability allows an attacker to forge requests/actions on behalf of the user, the sensitivity/severity of those actions determine the security impact. For example, updating a user’s last name versus their bank account number have drastically different security impacts.</li>\n<li>\n<strong>forge communication from Uber</strong> -- when a vulnerability allows an Attacker to send communication (and control the content)  to a Victim and have it come officially from Uber. An example would be the ability to control the contents of an in-app push notification.</li>\n</ul>\n\n<h3 id=\"mitigating-factors\">Mitigating Factors</h3>\n\n<ul>\n<li>\n<strong>requires user interaction</strong> -- when an exploit scenario requires a human from Uber or a Victim to manually interact before exploit is successful.</li>\n<li>\n<strong>authorized relationship</strong> -- when an exploit scenario involves an authorized relationship or is given express permission from the Victim.</li>\n<li>\n<strong>requires brute forcing</strong> -- exploit scenarios that require an Attacker to brute force a value in order for the exploit to be successful. For example, the need to brute force a phone number, email, or UUID. The amount this mitigating factor comes into play is dependent on how “hard” it is to brute force the value in question -- brute forcing phone numbers is much “easier” than a UUID.</li>\n<li>\n<strong>existence of rate limiting</strong> -- exploit scenarios that are mitigated by rate limiting the number of requests, inhibiting the ability to exploit a vulnerability at scale. Forging various IP headers (X-Forwarded-For, X-Real-IP, Client-IP, True-Client-IP) are not considered to be “mitigating” factor since it doesn’t require actually having unique IPs.</li>\n<li>\n<strong>physical access</strong> -- exploit scenarios requiring physical access to a device.</li>\n<li>\n<strong>noticeable to victim</strong> -- exploits that are noticeable to victim. For example, changing someone’s password on their account would lock them out of their account and would be immediately noticeable.</li>\n<li>\n<strong>account put into arrears or banned</strong> -- when an exploit then puts the Attacker’s account into arrears or results in a ban.</li>\n<li>\n<strong>social engineering</strong> -- when an exploit requires social engineering a person to be successful.</li>\n<li>\n<strong>requires privileged network position</strong> -- when an exploit (often times MiTM) requires having privileged network position to be successful</li>\n<li>\n<strong>requires multiple accounts</strong> -- when an exploit requires the ability to mint new accounts indefinitely.</li>\n</ul>\n\n<p>See our recent <a href=\"https://medium.com/@ubersecurity/uber-bug-bounty-treasure-map-17192af85c1a\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>blog post</span><i class=\"icon-external-link\"></i></a> on Treasure Map 2.0 for some specific examples on determining security impact of a given report.</p>\n\n<hr>\n\n<h2 id=\"submissions-and-report-quality\">Submissions and Report Quality</h2>\n\n<hr>\n\n<p>High quality Submissions allow our team to better understand the issue and relay the bug to the internal team to fix. The best reports provide enough actionable information to verify and validate the issue without any follow up clarifying questions.</p>\n\n<ul>\n<li>Check the scope page before you begin writing your report to ensure the issue you are reporting is in scope for the program.</li>\n<li>Think through the attack scenario and exploitability of the vulnerability and provide as many clear details as possible for our team to reproduce the issue (include screenshots if possible).</li>\n<li>Please include your understanding of the security impact of the issue. Our bounty payouts are directly tied to security impact, so the more detail you can provide, the better. We cannot payout after the fact if we don’t have evidence and a mutual understanding of security impact.</li>\n<li>In some cases, it may not be possible to have all of the context on the impact of a bug. If you’re unsure of the direct impact, but feel you may have found something interesting, feel free to submit a detailed report and ask.</li>\n<li>Video only proof-of-concepts (PoCs) will not be considered.</li>\n<li>A vulnerability must be verifiable and reproducible for us to be considered in-scope.<br>\n</li>\n</ul>\n\n<hr>\n\n<h2 id=\"confidentiality\">Confidentiality</h2>\n\n<hr>\n\n<p>Any information you receive or collect about us, our affiliates or any of our users, employees or agents in connection with the Bug Bounty Program (“Confidential Information”) must be kept confidential and only used in connection with the Bug Bounty Program. You may not use, disclose or distribute any such Confidential Information, including without limitation any information regarding your Submission, without our prior written consent.  You must get written consent by submitting a disclosure request through the HackerOne platform.</p>\n\n<hr>\n\n<h2 id=\"report-states\">Report States</h2>\n\n<hr>\n\n<p>We strive to be consistent with how we close reports and below are the details for each state:</p>\n\n<ul>\n<li>\n<strong>spam</strong> -- a report with no useful information</li>\n<li>\n<strong>needs more info</strong> -- not enough actionable information in report to triage</li>\n<li>\n<strong>not applicable</strong> -- no reproducible security vulnerability or explicitly out-of-scope per our guidelines</li>\n<li>\n<strong>duplicate</strong> -- a vulnerability that has previously been found either internally or via Hackerone</li>\n<li>\n<strong>informative</strong> -- a reproducible issue with negligible security impact or an issue with a product that doesn&#39;t affect our service/software (e.g. an S3 bucket named uber-secret-stuff that isn&#39;t actually related to us) </li>\n<li>\n<strong>triaged</strong> -- either a valid report or a report that needs more investigation from an internal team, typically the former</li>\n<li>\n<strong>resolved</strong> -- a verified vulnerability that has been fixed</li>\n</ul>\n\n<hr>\n\n<h2 id=\"bounty-amounts\">Bounty Amounts</h2>\n\n<hr>\n\n<p>Previous bounty amounts are not considered precedent for future bounty amounts -- software is constantly changing and therefore the given security impact of the exact same issue at different times in the development timeline can have significantly different security impacts.</p>\n\n<p>Bounty awards are not additive and are subject to change as our internal environment evolves. We determine the upper bound for security impact and award based on that impact. </p>\n\n<p>We focus bounty amounts on the security impact of any given issue -- things that influence security impact are the scale of exposure and the various mitigating and multiplying factors.</p>\n\n<p>We recognize that researchers value receiving bounties sooner than later, but basing payouts on security impact often requires us to get to resolution before we completely understand the potential security impact. To accomplish both of these needs, we have a hybrid model where we pay out our minimum bounty at time of triage and then full bounty at resolution once we completely understand security impact.</p>\n\n<p>The general process for determining bounty:</p>\n\n<ul>\n<li>Determine which security impact buckets the issue falls in. It’s likely that any given issue will land in several different impact buckets -- we choose the most impactful and severe bucket. We try to answer the question “What is the most damaging thing you could do with this issue?”</li>\n<li>Determine the approximate scale of exposure to try and answer “how many users could be exploited by an Attacker?”</li>\n<li>Determine mitigating factors that reduce the security impact of different issues -- this often involves asking “What could make this vulnerability hard to exploit?” or “How sensitive are the things being changed/accessed by the vulnerability?”</li>\n<li>Determine multiplying factors that increase the security impact of different issues -- this also often involves asking “How sensitive are the things being changed/accessed by the vulnerability?” or “What other exposure exists that the researcher didn’t explicitly call out?”</li>\n<li>With the answers from above, we have a good picture of security impact and potential exploitability of any given issue and can use those details to determine bounty amount.</li>\n</ul>\n\n<p>The bounty ranges for the different security impact buckets:</p>\n\n<ul>\n<li>\n<strong>Exposure of User Data</strong> -- the payout ranges for this bucket range from $0 to $10,000.</li>\n<li>\n<strong>Unauthorized Requests on Behalf of User/Employee</strong> -- the payout ranges for this bucket range from $0 to $10,000.</li>\n<li>\n<strong>Monetary Impact</strong> -- the payout ranges for this bucket range from $0 to $10,000</li>\n<li>\n<strong>Phishing</strong> -- the payout ranges for this bucket range from $0 to $5,000</li>\n<li>\n<strong>Safety</strong>  -- the payout ranges for this bucket range from $0 to $10,000</li>\n</ul>\n\n<p>Bounty payouts and amount, if any, will be determined by us in our sole discretion. In no event are we obligated to provide a payout for any Submission. The format, currency and timing of all bounty payouts shall be determined by us in our sole discretion. You are solely responsible for any tax implications related to any bounty payouts you may receive.</p>\n\n<p>If we receive several reports for the same issue, we offer the bounty to the earliest report for which we had enough actionable information to identify the issue.</p>\n\n<hr>\n\n<h2 id=\"out-of-scope\">Out-of-Scope</h2>\n\n<hr>\n\n<ul>\n<li>Vulnerabilities whose primary security impact is focused on Phishing in a domain that is not in one of our primary domains (e.g. <a href=\"http://www.uber.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>www.uber.com</span><i class=\"icon-external-link\"></i></a>, riders.uber.com, partners.uber.com, login.uber.com, auth.uber.com, eats.uber.com, rush.uber.com, developer.uber.com).</li>\n<li>UUID enumeration of any kind.</li>\n<li>Invite/Promo code enumeration.</li>\n<li>Account oracles -- the ability to submit a phone number, email, UUID and receive back a message indicating an Uber account exists.</li>\n<li>Open redirects. 99% of open redirects have low security impact. For the rare cases where the impact is higher, e.g., stealing oauth tokens, we do still want to hear about them.</li>\n<li>Reports that state that software is out of date/vulnerable without a proof-of-concept.</li>\n<li>Reports that affect only outdated user agents or app versions -- we only consider exploits in the latest browser versions for Safari, FireFox, Chrome, Edge, IE and the versions of our application that are currently in the app stores.</li>\n<li>Stack traces, path disclosure, and directory listings.</li>\n<li>CSV injection.</li>\n<li>Best practices concerns.</li>\n<li>Highly speculative reports about theoretical damage -- please always provide a proof-of-concept.</li>\n<li>Vulnerabilities that cannot be used to exploit other users or Uber -- e.g. self-xss or having a user paste JavaScript into the browser console.</li>\n<li>Vulnerabilities as reported by automated tools without additional analysis as to how they&#39;re an issue.</li>\n<li>Reports from automated web vulnerability scanners (Acunetix, Vega, etc.) that have not been validated.</li>\n<li>Distributed denial of service attacks (DDOS).</li>\n<li>Physical or social engineering attempts (this includes phishing attacks against Uber employees).</li>\n<li>Content injection issues.</li>\n<li>Cross-site Request Forgery (CSRF) with minimal security implications (Logout CSRF, etc.)</li>\n<li>Missing cookie flags on non-authentication cookies.</li>\n<li>Issues that require physical access to a victim’s computer/device.</li>\n<li>SSL/TLS scan reports (this means output from sites such as SSL Labs).</li>\n<li>Banner grabbing issues (figuring out what web server we use, etc.).</li>\n<li>Open ports without an accompanying proof-of-concept demonstrating vulnerability.</li>\n<li>Entering the Uber offices, throwing crisps everywhere, unleashing a bunch of hungry raccoons, and hijacking an abandoned terminal on an unlocked workstation while staff are distracted.</li>\n</ul>\n\n<p><strong>Out-of-scope domains</strong></p>\n\n<ul>\n<li>\n<code>*.uber.com.cn</code> domains or any other properties relating to Uber in China, since they belong to Didi Chuxing</li>\n<li>\n<code>uber.onelogin.com</code>\n\n<ul>\n<li>OneLogin runs their own bug bounty program and any vulnerabilities for OneLogin should be reported to them.</li>\n</ul>\n</li>\n<li><code>bizblog.uber.com</code></li>\n<li><code>newsroom.uber.com</code></li>\n<li><code>love.uber.com</code></li>\n<li><code>drive.uber.com</code></li>\n<li><code>eng.uber.com</code></li>\n<li><code>people.uber.com</code></li>\n<li><code>*.et.uber.com</code></li>\n</ul>\n\n<hr>\n\n<h2 id=\"rights-and-licenses\">Rights and Licenses</h2>\n\n<hr>\n\n<p>We may modify the Program Terms or cancel the Bug Bounty Program at any time.  </p>\n\n<p>By making a Submission, you represent and warrant that the Submission is original to you and you have the right to submit the Submission.  </p>\n\n<p>By making a Submission, you give us the right to use your Submission for any purpose.</p>\n", 
    "show_mean_first_response_time": true, 
    "show_total_bounties_paid": true, 
    "can_invite_team_member": false, 
    "researcher_count": 647, 
    "number_of_updates": 0, 
    "show_mean_report_triage_time": false, 
    "top_bounty_upper_range": 20000.0, 
    "name": "Uber", 
    "submission_state": "open", 
    "url": "https://hackerone.com/uber", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": null, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}