{
    "twitter_handle": "", 
    "can_manage_team_member_groups": false, 
    "allowed_to_use_saml_in_sandbox": false, 
    "show_mean_resolution_time": false, 
    "policy_html": "<h1 id=\"introduction\">Introduction</h1>\n\n<p>At Ubiquiti Networks, Inc. (&quot;Ubiquiti&quot;), we take security very seriously, and embrace the security research community. We provide products and services that millions around the world use every day, and understand privacy and security is very important to our customers. Therefore, Ubiquiti offers this Security Reward Program (&quot;Program&quot;) to continuously improve the security of our products, while publicly recognizing the security enthusiasts submitting valid issues. If you believe you have found a vulnerability in any of Ubiquiti&#39;s products or services, let us know as soon as possible, and we&#39;ll do our best to get the issues addressed as quickly as possible.</p>\n\n<p>By clicking &quot;Submit Report&quot;, you consent to your information being transferred to and stored in the United States and acknowledge that you have read and accepted the Terms, Privacy Policy and Disclosure Guidelines presented to you when you created your account. </p>\n\n<p>Please read the rules described in this policy carefully. By clicking &quot;Submit Report&quot;, you agree to comply with all such rules. Violations of the rules are grounds for immediate forfeiture of any reward as well as possible removal from the Program</p>\n\n<h1 id=\"general-rules\">General Rules</h1>\n\n<ul>\n<li>This Program is limited strictly to technical vulnerabilities of Ubiquiti products and services.</li>\n<li>Do not exploit, investigate or target vulnerabilities in any other user’s account or Ubiquiti product not owned by you.</li>\n<li>Do not cause harm to Ubiquiti, our customers, or third parties.</li>\n<li>Do not compromise the privacy or safety of our customers and the operation of our services. Any activity that would disrupt, damage or adversely affect any third-party data, account or equipment is not allowed.</li>\n<li>Do not violate any criminal law or other applicable laws.</li>\n<li>Confirm that you are not currently located in or otherwise ordinarily resident of a sanctioned country (for example, Cuba, Iran, North Korea, Sudan, Syria or Crimea) and not on the U.S. Department of the Treasury’s Specially Designated Nationals List.</li>\n<li>You must not be the author of the code with the vulnerability or bug.</li>\n<li>Public disclosure or limited private release of any vulnerability to any other party in violation of the <u>Disclosure Guidelines</u> below will disqualify such vulnerability from consideration.</li>\n<li>Any vulnerability disclosed to any third party that might potentially exploit the vulnerability, including vulnerability brokers, will disqualify such vulnerability from this Program.</li>\n<li>The following are strictly prohibited:\n\n<ul>\n<li>Physical attacks on Ubiquiti infrastructure or facilities</li>\n<li>DOS attacks are not allowed</li>\n<li>Social engineering attacks or phishing.</li>\n</ul>\n</li>\n</ul>\n\n<h1 id=\"program-scope\">Program Scope</h1>\n\n<p>The Program encompasses all of Ubiquiti&#39;s products. Including, but not limited to:</p>\n\n<h2 id=\"web-products\">Web Products</h2>\n\n<ul>\n<li>*.ubnt.com -- any web applications under ubnt.com domain (WWW, SSO Account, etc.).</li>\n<li>Current and future cloud applications </li>\n<li>\n<strong>Exceptions:</strong> sites on a *.ubnt.com domain but hosted by a third party are not in scope. For examples: store.ubnt.com (Store), community.ubnt.com (Community and Forums), training.ubnt.com (Training), blog.ubnt.com (Blog) and ir.ubnt.com (Investor Relations). While we are thankful for any reports against these sites, we are unable to issue rewards</li>\n</ul>\n\n<h2 id=\"platform-products\">Platform Products</h2>\n\n<ul>\n<li>airMAX, UniFi, UniFi Video, EdgeMAX, airFiber and UFiber embedded devices</li>\n<li>Distributed Software Platforms -- Any controller software, such as UniFi, UniFi Video, airControl, and others</li>\n<li>\n<strong>Exceptions:</strong> mFi, any product that’s End-of-Life.</li>\n</ul>\n\n<p>We consider a vulnerability to be an error, flaw, mistake, failure or fault in a computer program or system that impacts the security of a device, system, network or data. </p>\n\n<p>Some examples of vulnerabilities include:</p>\n\n<ul>\n<li>Remote code execution</li>\n<li>Authentication bypass, unauthorized data access</li>\n<li>SQL injection</li>\n<li>XSS, XSRF, CSRF</li>\n</ul>\n\n<p>You must be the first to report a certain issue. Vulnerabilities eligible for reward or recognition must be new and previously unreported. In the event of duplicate vulnerability submissions, only the earliest submission with sufficient actionable information will be considered for a reward.</p>\n\n<p>In general, any vulnerability may be considered for this Program, however, please see exceptions below.</p>\n\n<h1 id=\"exceptions\">Exceptions &amp; Additional Rules</h1>\n\n<ul>\n<li>Generally, all <u>Alpha/Beta/Demo</u> products and platforms are Out of Scope. Please note that Ubiquiti may designate a specific Beta product or platform as In-Scope for this Program from time to time with select researchers, subject to additional conditions. </li>\n<li>Any vulnerabilities in the latest release of a product or platform are not eligible for rewards until at least <u>one month</u> after the product’s or platform&#39;s release.</li>\n<li>While we encourage any submission affecting the security of Ubiquiti products or platforms, unless evidence is provided demonstrating exploitability, the following examples are excluded from this Program: \n\n<ul>\n<li>Clickjacking</li>\n<li>Recently disclosed 0-day vulnerabilities</li>\n<li>Issues without clearly identified security impact, missing security headers, or descriptive error messages</li>\n<li>Missing best practices, information disclosures, use of a known-vulnerable libraries or descriptive / verbose / unique error pages (without substantive information indicating exploitability)</li>\n<li>Speculative reports about theoretical damage without concrete evidence or some substantive information indicating exploitability</li>\n<li>Forms missing CSRF tokens without evidence of the actual CSRF vulnerability</li>\n<li>Self-exploitation (e.g., cookie reuse)</li>\n<li>Reports of insecure SSL / TLS ciphers <em>(unless you have a working proof of concept, and not just a report from a scanner)</em>\n</li>\n<li>Our policies on presence/absence of SPF / DMARC records</li>\n<li>Password complexity requirements, account/e-mail enumeration, or any report that discusses how you can learn whether a given username or email address has a Ubiquiti-related account</li>\n<li>Missing security-related HTTP headers which do not lead directly to a vulnerability, including but not limited to X-Xss-Protection, X-Content-Type-Options, Content-Security-Policy-Report-Only, etc.</li>\n<li>Self XSS vulnerabilities without evidence on how the vulnerability can be used to attack another user</li>\n<li>Presence of autocomplete attribute on web forms</li>\n<li>Missing secure cookie flags on non-sensitive cookies</li>\n<li>Banner identification issues </li>\n<li>Open ports which do not lead directly to a vulnerability</li>\n<li>Open redirect vulnerabilities</li>\n<li>Publicly accessible login panels</li>\n<li>Content spoofing / text injection</li>\n<li>Any vulnerability that makes use of Spanish Inquisition, we aren’t expecting that!</li>\n</ul>\n</li>\n</ul>\n\n<h1 id=\"reporting-template\">Reporting Template</h1>\n\n<p>Please be aware that the quality of your report is critical to our evaluation of your submission. We encourage you to use the list below as a template for your report. This does NOT mean you need to fully exploit the issue, just provide the information with as much detail as possible. </p>\n\n<ul>\n<li>State the name of the applicable product or platform, including the version numbers. </li>\n<li>Describe the type of issue with as much detail as possible.</li>\n<li>What are all the steps required to reproduce the issue?</li>\n<li>What is the impact of your issue?</li>\n<li>What are some scenarios where an attacker would be able to exploit this vulnerability? A proof of concept or functional exploit code would be helpful.</li>\n<li>If available, what would be your recommended fix? </li>\n</ul>\n\n<h1 id=\"rewards\">Rewards</h1>\n\n<p>Rewards may vary depending on the application, the risk, complexity, impact and overall severity of the vulnerability. The internal criteria that we use to determine a reward is subject to change from time to time. Historical rewards paid for a vulnerability report does not indicate and will not be used as a basis to determine future payout for vulnerability of a similar type. </p>\n\n<p>Our reward panel will review each vulnerability submission for eligibility and final reward consideration. Final reward amounts are at the sole and final discretion of Ubiquiti&#39;s reward panel. In some instances, our reward panel may choose higher rewards for unusually major, clever or complex vulnerability submissions.</p>\n\n<p>If we receive several reports for the same issue, we offer the reward to the earliest report for which we have enough actionable information to identify the issue. </p>\n\n<p>If a single fix resolves multiple vulnerabilities, we treat this as a single vulnerability, which will receive a single bounty.</p>\n\n<p>Rewards may be reduced or declined if there is evidence of abuse, such as data exfiltration or withholding reports in order to chain multiple issues together. </p>\n\n<p><u><em>PLEASE NOTE</em></u>: For eligible vulnerability submissions, 50% of the reward will be paid after Ubiquiti has an opportunity to evaluate and confirm the eligibility of the submitted issues. The remaining 50% of the reward will be paid after the fix for the vulnerabilities (confirmed by both you and Ubiquiti) is publicly released.</p>\n\n<h1 id=\"recognition\">Recognition</h1>\n\n<p>Ubiquiti may publish a leaderboard of vulnerability reporters based on previous security vulnerability and bug reports. These previous reporters may receive special access to Ubiquiti engineers. If you wish to remain anonymous to the public, we will honor your request.</p>\n\n<h1 id=\"disclosure-guidelines\">Disclosure Guidelines</h1>\n\n<h2 id=\"guidelines-for-web-products\">Guidelines for Web Products:</h2>\n\n<p>We ask you to please wait until thirty (30) days after the vulnerability relating to the Web Products is fixed and the fix is publicly released before any disclosure. </p>\n\n<p>When the completion date of a fix is not yet available or cannot be ascertained, we ask you to give us time to remediate the issue and refrain from any public disclosure. </p>\n\n<h2 id=\"guidelines-for-platform-products\">Guidelines for Platform Products:</h2>\n\n<p>Because the users of our Platform Products have exclusive control over their devices, HackerOne’s disclosure guidelines shall not apply with respect to any vulnerabilities submitted in relation to our Platform Products.</p>\n\n<p>The disclosure guidelines for vulnerabilities submitted in relation to our Platform Products are determined by reference to the significance of the vulnerability (as determined in the sole and absolute discretion of Ubiquiti), as follows: </p>\n\n<ul>\n<li>Minor issues: Limited disclosure (i.e., a summary written by Ubiquiti) is allowed 60 days after we publicly release the security fix.</li>\n<li>Significant, but non-critical issues: Limited disclosure (i.e., a summary written by Ubiquiti) is allowed 120 days after we publicly release the security fix.</li>\n<li>Critical issues: No disclosure. </li>\n</ul>\n\n<p>All disclosure shall be limited to a summary of the relevant vulnerabilities written by Ubiquiti. Full disclosure of the submitted report or the underlying vulnerabilities relating to the Platform Products is <u>not allowed under any circumstances</u>. </p>\n\n<p>Posting details or conversations about the vulnerabilities in violation of the disclosure guidelines reflects poorly on this Program and jeopardize the security and privacy of our customers.  <strong>VIOLATION OF THE DISCLOSURE GUIDELINES ABOVE WILL RESULT IN FORFEITURE OF ANY REWARD AND/OR IMMEDIATE REMOVAL FROM THIS PROGRAM.</strong></p>\n\n<h1 id=\"legal\">Legal</h1>\n\n<p>Ubiquiti reserves the right to modify this policy or terminate this Program at any time and for any reason. </p>\n\n<p>You hereby represent and warrant that all submissions are your <u>original</u> work and you own all right, title and interest therein and thereto. You grant Ubiquiti and its affiliates a worldwide, perpetual, irrevocable, non-exclusive, transferrable, fully paid and royalty-free license under any intellectual property rights or other rights to use, copy, modify, create derivative works based upon and otherwise exploit the materials submitted by you.</p>\n\n<p>All reward payments are subject to compliance with local laws, rules and regulations. Before you receive your reward, we may require that you sign an affidavit of eligibility, a questionnaire, and a release of liability. You will be solely responsible for all applicable taxes relating to any reward under this Program.</p>\n\n<p>Any information you receive or collect about Ubiquiti, its affiliates or any of their customers, employees or agents in connect with this Program (&quot;Confidential Information&quot;) must be kept confidential and only used in connection with this Program. You may not use, disclose or distribute any such Confidential Information without Ubiquiti’s prior written approval.</p>\n", 
    "facebook_team": false, 
    "can_view_private_program_application_requirement": false, 
    "show_mean_bounty_time": false, 
    "total_bounties_paid_prefix": ">", 
    "awards_miles": false, 
    "average_bounty_upper_range": 250.0, 
    "top_bounty_lower_range": null, 
    "anc_enabled": true, 
    "offers_thanks": true, 
    "default_currency": "usd", 
    "show_average_bounty": true, 
    "can_edit_name_and_handle": false, 
    "last_policy_change_at": "2017-12-20T12:49:00.044Z", 
    "can_view_scope_versions": true, 
    "only_cleared_hackers": false, 
    "launched_publicly_at": "2015-03-12T21:33:24.229Z", 
    "bug_count": 738, 
    "mean_time_to_bounty": null, 
    "offers_swag": true, 
    "offers_bounties": true, 
    "id": 800, 
    "mean_time_to_resolution": null, 
    "has_cover_video": false, 
    "profile_picture_urls": {
        "small": "https://profile-photos.hackerone-user-content.com/000/000/800/19a040983c9b2494808c87f77337d30023b97ea7_small.png?1419364363", 
        "large": "https://profile-photos.hackerone-user-content.com/000/000/800/7529e3f52207b4c9bbe63426bd00f3795e32833e_large.png?1419364363", 
        "xtralarge": "https://profile-photos.hackerone-user-content.com/000/000/800/d44577215e7f9472356bdeb4b97d762cb9e8180d_xtralarge.png?1419364363"
    }, 
    "show_response_efficiency_percentage": true, 
    "is_external_program": false, 
    "allows_disclosure_assistance": true, 
    "show_top_bounties": false, 
    "target_signal": 1, 
    "cover_photo_url": "/cover_photos/default/missing.png", 
    "can_view_policy_versions": true, 
    "profile": {
        "website": "http://ubnt.com", 
        "about": "", 
        "twitter_handle": "", 
        "name": "Ubiquiti Networks"
    }, 
    "scopes": [], 
    "handle": "ubnt", 
    "cover_color": "", 
    "mean_time_to_first_response": null, 
    "average_bounty_lower_range": 250.0, 
    "response_efficiency_percentage": 96, 
    "policy": "# Introduction\r\nAt Ubiquiti Networks, Inc. (\"Ubiquiti\"), we take security very seriously, and embrace the security research community. We provide products and services that millions around the world use every day, and understand privacy and security is very important to our customers. Therefore, Ubiquiti offers this Security Reward Program (\"Program\") to continuously improve the security of our products, while publicly recognizing the security enthusiasts submitting valid issues. If you believe you have found a vulnerability in any of Ubiquiti's products or services, let us know as soon as possible, and we'll do our best to get the issues addressed as quickly as possible.\r\n\r\nBy clicking \"Submit Report\", you consent to your information being transferred to and stored in the United States and acknowledge that you have read and accepted the Terms, Privacy Policy and Disclosure Guidelines presented to you when you created your account. \r\n\r\nPlease read the rules described in this policy carefully. By clicking \"Submit Report\", you agree to comply with all such rules. Violations of the rules are grounds for immediate forfeiture of any reward as well as possible removal from the Program\r\n\r\n# General Rules\r\n* This Program is limited strictly to technical vulnerabilities of Ubiquiti products and services.\r\n* Do not exploit, investigate or target vulnerabilities in any other user’s account or Ubiquiti product not owned by you.\r\n* Do not cause harm to Ubiquiti, our customers, or third parties.\r\n* Do not compromise the privacy or safety of our customers and the operation of our services. Any activity that would disrupt, damage or adversely affect any third-party data, account or equipment is not allowed.\r\n* Do not violate any criminal law or other applicable laws.\r\n* Confirm that you are not currently located in or otherwise ordinarily resident of a sanctioned country (for example, Cuba, Iran, North Korea, Sudan, Syria or Crimea) and not on the U.S. Department of the Treasury’s Specially Designated Nationals List.\r\n* You must not be the author of the code with the vulnerability or bug.\r\n* Public disclosure or limited private release of any vulnerability to any other party in violation of the _Disclosure Guidelines_ below will disqualify such vulnerability from consideration.\r\n* Any vulnerability disclosed to any third party that might potentially exploit the vulnerability, including vulnerability brokers, will disqualify such vulnerability from this Program.\r\n* The following are strictly prohibited:\r\n    * Physical attacks on Ubiquiti infrastructure or facilities\r\n    * DOS attacks are not allowed\r\n    * Social engineering attacks or phishing.\r\n\r\n# Program Scope\r\nThe Program encompasses all of Ubiquiti's products. Including, but not limited to:\r\n\r\n## Web Products\r\n* \\*.ubnt.com -- any web applications under ubnt.com domain (WWW, SSO Account, etc.).\r\n* Current and future cloud applications \r\n* **Exceptions:** sites on a \\*.ubnt.com domain but hosted by a third party are not in scope. For examples: store.ubnt.com (Store), community.ubnt.com (Community and Forums), training.ubnt.com (Training), blog.ubnt.com (Blog) and ir.ubnt.com (Investor Relations). While we are thankful for any reports against these sites, we are unable to issue rewards\r\n\r\n## Platform Products\r\n* airMAX, UniFi, UniFi Video, EdgeMAX, airFiber and UFiber embedded devices\r\n* Distributed Software Platforms -- Any controller software, such as UniFi, UniFi Video, airControl, and others\r\n* **Exceptions:** mFi, any product that’s End-of-Life.\r\n\r\nWe consider a vulnerability to be an error, flaw, mistake, failure or fault in a computer program or system that impacts the security of a device, system, network or data. \r\n\r\nSome examples of vulnerabilities include:\r\n* Remote code execution\r\n* Authentication bypass, unauthorized data access\r\n* SQL injection\r\n* XSS, XSRF, CSRF\r\n\r\nYou must be the first to report a certain issue. Vulnerabilities eligible for reward or recognition must be new and previously unreported. In the event of duplicate vulnerability submissions, only the earliest submission with sufficient actionable information will be considered for a reward.\r\n\r\nIn general, any vulnerability may be considered for this Program, however, please see exceptions below.\r\n\r\n# Exceptions & Additional Rules\r\n* Generally, all _Alpha/Beta/Demo_ products and platforms are Out of Scope. Please note that Ubiquiti may designate a specific Beta product or platform as In-Scope for this Program from time to time with select researchers, subject to additional conditions. \r\n* Any vulnerabilities in the latest release of a product or platform are not eligible for rewards until at least _one month_ after the product’s or platform's release.\r\n* While we encourage any submission affecting the security of Ubiquiti products or platforms, unless evidence is provided demonstrating exploitability, the following examples are excluded from this Program: \r\n    * Clickjacking\r\n    * Recently disclosed 0-day vulnerabilities\r\n    * Issues without clearly identified security impact, missing security headers, or descriptive error messages\r\n    * Missing best practices, information disclosures, use of a known-vulnerable libraries or descriptive / verbose / unique error pages (without substantive information indicating exploitability)\r\n    * Speculative reports about theoretical damage without concrete evidence or some substantive information indicating exploitability\r\n    * Forms missing CSRF tokens without evidence of the actual CSRF vulnerability\r\n    * Self-exploitation (e.g., cookie reuse)\r\n    * Reports of insecure SSL / TLS ciphers *(unless you have a working proof of concept, and not just a report from a scanner)*\r\n    * Our policies on presence/absence of SPF / DMARC records\r\n    * Password complexity requirements, account/e-mail enumeration, or any report that discusses how you can learn whether a given username or email address has a Ubiquiti-related account\r\n    * Missing security-related HTTP headers which do not lead directly to a vulnerability, including but not limited to X-Xss-Protection, X-Content-Type-Options, Content-Security-Policy-Report-Only, etc.\r\n    * Self XSS vulnerabilities without evidence on how the vulnerability can be used to attack another user\r\n    * Presence of autocomplete attribute on web forms\r\n    * Missing secure cookie flags on non-sensitive cookies\r\n    * Banner identification issues \r\n    * Open ports which do not lead directly to a vulnerability\r\n    * Open redirect vulnerabilities\r\n    * Publicly accessible login panels\r\n    * Content spoofing / text injection\r\n    * Any vulnerability that makes use of Spanish Inquisition, we aren’t expecting that!\r\n\r\n# Reporting Template\r\nPlease be aware that the quality of your report is critical to our evaluation of your submission. We encourage you to use the list below as a template for your report. This does NOT mean you need to fully exploit the issue, just provide the information with as much detail as possible. \r\n* State the name of the applicable product or platform, including the version numbers. \r\n* Describe the type of issue with as much detail as possible.\r\n* What are all the steps required to reproduce the issue?\r\n* What is the impact of your issue?\r\n* What are some scenarios where an attacker would be able to exploit this vulnerability? A proof of concept or functional exploit code would be helpful.\r\n* If available, what would be your recommended fix? \r\n\r\n# Rewards\r\nRewards may vary depending on the application, the risk, complexity, impact and overall severity of the vulnerability. The internal criteria that we use to determine a reward is subject to change from time to time. Historical rewards paid for a vulnerability report does not indicate and will not be used as a basis to determine future payout for vulnerability of a similar type. \r\n\r\nOur reward panel will review each vulnerability submission for eligibility and final reward consideration. Final reward amounts are at the sole and final discretion of Ubiquiti's reward panel. In some instances, our reward panel may choose higher rewards for unusually major, clever or complex vulnerability submissions.\r\n\r\nIf we receive several reports for the same issue, we offer the reward to the earliest report for which we have enough actionable information to identify the issue. \r\n\r\nIf a single fix resolves multiple vulnerabilities, we treat this as a single vulnerability, which will receive a single bounty.\r\n\r\nRewards may be reduced or declined if there is evidence of abuse, such as data exfiltration or withholding reports in order to chain multiple issues together. \r\n\r\n_*PLEASE NOTE*_: For eligible vulnerability submissions, 50% of the reward will be paid after Ubiquiti has an opportunity to evaluate and confirm the eligibility of the submitted issues. The remaining 50% of the reward will be paid after the fix for the vulnerabilities (confirmed by both you and Ubiquiti) is publicly released.\r\n\r\n# Recognition\r\nUbiquiti may publish a leaderboard of vulnerability reporters based on previous security vulnerability and bug reports. These previous reporters may receive special access to Ubiquiti engineers. If you wish to remain anonymous to the public, we will honor your request.\r\n\r\n# Disclosure Guidelines\r\n## Guidelines for Web Products:\r\nWe ask you to please wait until thirty (30) days after the vulnerability relating to the Web Products is fixed and the fix is publicly released before any disclosure. \r\n\r\nWhen the completion date of a fix is not yet available or cannot be ascertained, we ask you to give us time to remediate the issue and refrain from any public disclosure. \r\n\r\n## Guidelines for Platform Products: \r\nBecause the users of our Platform Products have exclusive control over their devices, HackerOne’s disclosure guidelines shall not apply with respect to any vulnerabilities submitted in relation to our Platform Products.\r\n\r\nThe disclosure guidelines for vulnerabilities submitted in relation to our Platform Products are determined by reference to the significance of the vulnerability (as determined in the sole and absolute discretion of Ubiquiti), as follows: \r\n* Minor issues: Limited disclosure (i.e., a summary written by Ubiquiti) is allowed 60 days after we publicly release the security fix.\r\n* Significant, but non-critical issues: Limited disclosure (i.e., a summary written by Ubiquiti) is allowed 120 days after we publicly release the security fix.\r\n* Critical issues: No disclosure. \r\n\r\nAll disclosure shall be limited to a summary of the relevant vulnerabilities written by Ubiquiti. Full disclosure of the submitted report or the underlying vulnerabilities relating to the Platform Products is _not allowed under any circumstances_. \r\n\r\nPosting details or conversations about the vulnerabilities in violation of the disclosure guidelines reflects poorly on this Program and jeopardize the security and privacy of our customers.  **VIOLATION OF THE DISCLOSURE GUIDELINES ABOVE WILL RESULT IN FORFEITURE OF ANY REWARD AND/OR IMMEDIATE REMOVAL FROM THIS PROGRAM.**\r\n\r\n# Legal\r\nUbiquiti reserves the right to modify this policy or terminate this Program at any time and for any reason. \r\n\r\nYou hereby represent and warrant that all submissions are your _original_ work and you own all right, title and interest therein and thereto. You grant Ubiquiti and its affiliates a worldwide, perpetual, irrevocable, non-exclusive, transferrable, fully paid and royalty-free license under any intellectual property rights or other rights to use, copy, modify, create derivative works based upon and otherwise exploit the materials submitted by you.\r\n\r\nAll reward payments are subject to compliance with local laws, rules and regulations. Before you receive your reward, we may require that you sign an affidavit of eligibility, a questionnaire, and a release of liability. You will be solely responsible for all applicable taxes relating to any reward under this Program.\r\n\r\nAny information you receive or collect about Ubiquiti, its affiliates or any of their customers, employees or agents in connect with this Program (\"Confidential Information\") must be kept confidential and only used in connection with this Program. You may not use, disclose or distribute any such Confidential Information without Ubiquiti’s prior written approval.\r\n\r\n", 
    "can_view_hacktivity": true, 
    "base_bounty": 100, 
    "has_cover_photo": false, 
    "total_bounties_paid": 500000.0, 
    "policy_markdown": "<h1 id=\"introduction\">Introduction</h1>\n\n<p>At Ubiquiti Networks, Inc. (&quot;Ubiquiti&quot;), we take security very seriously, and embrace the security research community. We provide products and services that millions around the world use every day, and understand privacy and security is very important to our customers. Therefore, Ubiquiti offers this Security Reward Program (&quot;Program&quot;) to continuously improve the security of our products, while publicly recognizing the security enthusiasts submitting valid issues. If you believe you have found a vulnerability in any of Ubiquiti&#39;s products or services, let us know as soon as possible, and we&#39;ll do our best to get the issues addressed as quickly as possible.</p>\n\n<p>By clicking &quot;Submit Report&quot;, you consent to your information being transferred to and stored in the United States and acknowledge that you have read and accepted the Terms, Privacy Policy and Disclosure Guidelines presented to you when you created your account. </p>\n\n<p>Please read the rules described in this policy carefully. By clicking &quot;Submit Report&quot;, you agree to comply with all such rules. Violations of the rules are grounds for immediate forfeiture of any reward as well as possible removal from the Program</p>\n\n<h1 id=\"general-rules\">General Rules</h1>\n\n<ul>\n<li>This Program is limited strictly to technical vulnerabilities of Ubiquiti products and services.</li>\n<li>Do not exploit, investigate or target vulnerabilities in any other user’s account or Ubiquiti product not owned by you.</li>\n<li>Do not cause harm to Ubiquiti, our customers, or third parties.</li>\n<li>Do not compromise the privacy or safety of our customers and the operation of our services. Any activity that would disrupt, damage or adversely affect any third-party data, account or equipment is not allowed.</li>\n<li>Do not violate any criminal law or other applicable laws.</li>\n<li>Confirm that you are not currently located in or otherwise ordinarily resident of a sanctioned country (for example, Cuba, Iran, North Korea, Sudan, Syria or Crimea) and not on the U.S. Department of the Treasury’s Specially Designated Nationals List.</li>\n<li>You must not be the author of the code with the vulnerability or bug.</li>\n<li>Public disclosure or limited private release of any vulnerability to any other party in violation of the <u>Disclosure Guidelines</u> below will disqualify such vulnerability from consideration.</li>\n<li>Any vulnerability disclosed to any third party that might potentially exploit the vulnerability, including vulnerability brokers, will disqualify such vulnerability from this Program.</li>\n<li>The following are strictly prohibited:\n\n<ul>\n<li>Physical attacks on Ubiquiti infrastructure or facilities</li>\n<li>DOS attacks are not allowed</li>\n<li>Social engineering attacks or phishing.</li>\n</ul>\n</li>\n</ul>\n\n<h1 id=\"program-scope\">Program Scope</h1>\n\n<p>The Program encompasses all of Ubiquiti&#39;s products. Including, but not limited to:</p>\n\n<h2 id=\"web-products\">Web Products</h2>\n\n<ul>\n<li>*.ubnt.com -- any web applications under ubnt.com domain (WWW, SSO Account, etc.).</li>\n<li>Current and future cloud applications </li>\n<li>\n<strong>Exceptions:</strong> sites on a *.ubnt.com domain but hosted by a third party are not in scope. For examples: store.ubnt.com (Store), community.ubnt.com (Community and Forums), training.ubnt.com (Training), blog.ubnt.com (Blog) and ir.ubnt.com (Investor Relations). While we are thankful for any reports against these sites, we are unable to issue rewards</li>\n</ul>\n\n<h2 id=\"platform-products\">Platform Products</h2>\n\n<ul>\n<li>airMAX, UniFi, UniFi Video, EdgeMAX, airFiber and UFiber embedded devices</li>\n<li>Distributed Software Platforms -- Any controller software, such as UniFi, UniFi Video, airControl, and others</li>\n<li>\n<strong>Exceptions:</strong> mFi, any product that’s End-of-Life.</li>\n</ul>\n\n<p>We consider a vulnerability to be an error, flaw, mistake, failure or fault in a computer program or system that impacts the security of a device, system, network or data. </p>\n\n<p>Some examples of vulnerabilities include:</p>\n\n<ul>\n<li>Remote code execution</li>\n<li>Authentication bypass, unauthorized data access</li>\n<li>SQL injection</li>\n<li>XSS, XSRF, CSRF</li>\n</ul>\n\n<p>You must be the first to report a certain issue. Vulnerabilities eligible for reward or recognition must be new and previously unreported. In the event of duplicate vulnerability submissions, only the earliest submission with sufficient actionable information will be considered for a reward.</p>\n\n<p>In general, any vulnerability may be considered for this Program, however, please see exceptions below.</p>\n\n<h1 id=\"exceptions\">Exceptions &amp; Additional Rules</h1>\n\n<ul>\n<li>Generally, all <u>Alpha/Beta/Demo</u> products and platforms are Out of Scope. Please note that Ubiquiti may designate a specific Beta product or platform as In-Scope for this Program from time to time with select researchers, subject to additional conditions. </li>\n<li>Any vulnerabilities in the latest release of a product or platform are not eligible for rewards until at least <u>one month</u> after the product’s or platform&#39;s release.</li>\n<li>While we encourage any submission affecting the security of Ubiquiti products or platforms, unless evidence is provided demonstrating exploitability, the following examples are excluded from this Program: \n\n<ul>\n<li>Clickjacking</li>\n<li>Recently disclosed 0-day vulnerabilities</li>\n<li>Issues without clearly identified security impact, missing security headers, or descriptive error messages</li>\n<li>Missing best practices, information disclosures, use of a known-vulnerable libraries or descriptive / verbose / unique error pages (without substantive information indicating exploitability)</li>\n<li>Speculative reports about theoretical damage without concrete evidence or some substantive information indicating exploitability</li>\n<li>Forms missing CSRF tokens without evidence of the actual CSRF vulnerability</li>\n<li>Self-exploitation (e.g., cookie reuse)</li>\n<li>Reports of insecure SSL / TLS ciphers <em>(unless you have a working proof of concept, and not just a report from a scanner)</em>\n</li>\n<li>Our policies on presence/absence of SPF / DMARC records</li>\n<li>Password complexity requirements, account/e-mail enumeration, or any report that discusses how you can learn whether a given username or email address has a Ubiquiti-related account</li>\n<li>Missing security-related HTTP headers which do not lead directly to a vulnerability, including but not limited to X-Xss-Protection, X-Content-Type-Options, Content-Security-Policy-Report-Only, etc.</li>\n<li>Self XSS vulnerabilities without evidence on how the vulnerability can be used to attack another user</li>\n<li>Presence of autocomplete attribute on web forms</li>\n<li>Missing secure cookie flags on non-sensitive cookies</li>\n<li>Banner identification issues </li>\n<li>Open ports which do not lead directly to a vulnerability</li>\n<li>Open redirect vulnerabilities</li>\n<li>Publicly accessible login panels</li>\n<li>Content spoofing / text injection</li>\n<li>Any vulnerability that makes use of Spanish Inquisition, we aren’t expecting that!</li>\n</ul>\n</li>\n</ul>\n\n<h1 id=\"reporting-template\">Reporting Template</h1>\n\n<p>Please be aware that the quality of your report is critical to our evaluation of your submission. We encourage you to use the list below as a template for your report. This does NOT mean you need to fully exploit the issue, just provide the information with as much detail as possible. </p>\n\n<ul>\n<li>State the name of the applicable product or platform, including the version numbers. </li>\n<li>Describe the type of issue with as much detail as possible.</li>\n<li>What are all the steps required to reproduce the issue?</li>\n<li>What is the impact of your issue?</li>\n<li>What are some scenarios where an attacker would be able to exploit this vulnerability? A proof of concept or functional exploit code would be helpful.</li>\n<li>If available, what would be your recommended fix? </li>\n</ul>\n\n<h1 id=\"rewards\">Rewards</h1>\n\n<p>Rewards may vary depending on the application, the risk, complexity, impact and overall severity of the vulnerability. The internal criteria that we use to determine a reward is subject to change from time to time. Historical rewards paid for a vulnerability report does not indicate and will not be used as a basis to determine future payout for vulnerability of a similar type. </p>\n\n<p>Our reward panel will review each vulnerability submission for eligibility and final reward consideration. Final reward amounts are at the sole and final discretion of Ubiquiti&#39;s reward panel. In some instances, our reward panel may choose higher rewards for unusually major, clever or complex vulnerability submissions.</p>\n\n<p>If we receive several reports for the same issue, we offer the reward to the earliest report for which we have enough actionable information to identify the issue. </p>\n\n<p>If a single fix resolves multiple vulnerabilities, we treat this as a single vulnerability, which will receive a single bounty.</p>\n\n<p>Rewards may be reduced or declined if there is evidence of abuse, such as data exfiltration or withholding reports in order to chain multiple issues together. </p>\n\n<p><u><em>PLEASE NOTE</em></u>: For eligible vulnerability submissions, 50% of the reward will be paid after Ubiquiti has an opportunity to evaluate and confirm the eligibility of the submitted issues. The remaining 50% of the reward will be paid after the fix for the vulnerabilities (confirmed by both you and Ubiquiti) is publicly released.</p>\n\n<h1 id=\"recognition\">Recognition</h1>\n\n<p>Ubiquiti may publish a leaderboard of vulnerability reporters based on previous security vulnerability and bug reports. These previous reporters may receive special access to Ubiquiti engineers. If you wish to remain anonymous to the public, we will honor your request.</p>\n\n<h1 id=\"disclosure-guidelines\">Disclosure Guidelines</h1>\n\n<h2 id=\"guidelines-for-web-products\">Guidelines for Web Products:</h2>\n\n<p>We ask you to please wait until thirty (30) days after the vulnerability relating to the Web Products is fixed and the fix is publicly released before any disclosure. </p>\n\n<p>When the completion date of a fix is not yet available or cannot be ascertained, we ask you to give us time to remediate the issue and refrain from any public disclosure. </p>\n\n<h2 id=\"guidelines-for-platform-products\">Guidelines for Platform Products:</h2>\n\n<p>Because the users of our Platform Products have exclusive control over their devices, HackerOne’s disclosure guidelines shall not apply with respect to any vulnerabilities submitted in relation to our Platform Products.</p>\n\n<p>The disclosure guidelines for vulnerabilities submitted in relation to our Platform Products are determined by reference to the significance of the vulnerability (as determined in the sole and absolute discretion of Ubiquiti), as follows: </p>\n\n<ul>\n<li>Minor issues: Limited disclosure (i.e., a summary written by Ubiquiti) is allowed 60 days after we publicly release the security fix.</li>\n<li>Significant, but non-critical issues: Limited disclosure (i.e., a summary written by Ubiquiti) is allowed 120 days after we publicly release the security fix.</li>\n<li>Critical issues: No disclosure. </li>\n</ul>\n\n<p>All disclosure shall be limited to a summary of the relevant vulnerabilities written by Ubiquiti. Full disclosure of the submitted report or the underlying vulnerabilities relating to the Platform Products is <u>not allowed under any circumstances</u>. </p>\n\n<p>Posting details or conversations about the vulnerabilities in violation of the disclosure guidelines reflects poorly on this Program and jeopardize the security and privacy of our customers.  <strong>VIOLATION OF THE DISCLOSURE GUIDELINES ABOVE WILL RESULT IN FORFEITURE OF ANY REWARD AND/OR IMMEDIATE REMOVAL FROM THIS PROGRAM.</strong></p>\n\n<h1 id=\"legal\">Legal</h1>\n\n<p>Ubiquiti reserves the right to modify this policy or terminate this Program at any time and for any reason. </p>\n\n<p>You hereby represent and warrant that all submissions are your <u>original</u> work and you own all right, title and interest therein and thereto. You grant Ubiquiti and its affiliates a worldwide, perpetual, irrevocable, non-exclusive, transferrable, fully paid and royalty-free license under any intellectual property rights or other rights to use, copy, modify, create derivative works based upon and otherwise exploit the materials submitted by you.</p>\n\n<p>All reward payments are subject to compliance with local laws, rules and regulations. Before you receive your reward, we may require that you sign an affidavit of eligibility, a questionnaire, and a release of liability. You will be solely responsible for all applicable taxes relating to any reward under this Program.</p>\n\n<p>Any information you receive or collect about Ubiquiti, its affiliates or any of their customers, employees or agents in connect with this Program (&quot;Confidential Information&quot;) must be kept confidential and only used in connection with this Program. You may not use, disclose or distribute any such Confidential Information without Ubiquiti’s prior written approval.</p>\n", 
    "show_mean_first_response_time": false, 
    "show_total_bounties_paid": true, 
    "can_invite_team_member": false, 
    "researcher_count": 500, 
    "number_of_updates": 0, 
    "show_mean_report_triage_time": false, 
    "top_bounty_upper_range": null, 
    "name": "Ubiquiti Networks", 
    "submission_state": "open", 
    "url": "https://hackerone.com/ubnt", 
    "ibb": false, 
    "rejecting_submissions": false, 
    "can_manage_credentials": false, 
    "can_subscribe_to_policy_changes": true, 
    "vpn_enabled": null, 
    "can_edit_profile": false, 
    "response_efficiency_indicator": "ok", 
    "mean_time_to_triage": null, 
    "show_challenge_policy": false, 
    "can_view_team_updates": true, 
    "external_url": null
}